Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# errorUploadingPhotoWithDetails
source: Error uploading photo: {details}
ar: خطأ في تحميل الصورة: {details}
de: Fehler beim Hochladen des Fotos: {details}
es: Error al subir foto: {details}
fr: Erreur lors du téléchargement de la photo : {details}
it: Errore caricamento foto: {details}
ru: Ошибка загрузки фото: {details}
tr: Fotoğraf yüklenirken hata: {details}
zh: 上传照片错误: {details}

# campaignNoProductsAdded
source: No products have been added yet.
ar: لم تتم إضافة أي منتجات بعد.
de: Es wurden noch keine Produkte hinzugefügt.
es: Aún no se han añadido productos.
fr: Aucun produit n'a été ajouté pour le moment.
it: Nessun prodotto è stato ancora aggiunto.
ru: Продукты еще не добавлены.
tr: Henüz ürün eklenmedi.
zh: 尚未添加任何产品。

# campaignAddProductButton
source: Add Product
ar: إضافة منتج
de: Produkt hinzufügen
es: Añadir Producto
fr: Ajouter un Produit
it: Aggiungi Prodotto
ru: Добавить продукт
tr: Ürün Ekle
zh: 添加产品

# productSelectorNoProducts
source: No products found.
ar: لم يتم العثور على منتجات.
de: Keine Produkte gefunden.
es: No se encontraron productos.
fr: Aucun produit trouvé.
it: Nessun prodotto trovato.
ru: Продукты не найдены.
tr: Ürün bulunamadı.
zh: 未找到产品。

# setupWizardStepLocalizationTitle
source: Step 1: Language and Currency
ar: الخطوة 1: اللغة والعملة
de: Schritt 1: Sprache und Währung
es: Paso 1: Idioma y Moneda
fr: Étape 1 : Langue et Devise
it: Passaggio 1: Lingua e Valuta
ru: Шаг 1: Язык и валюта
tr: Adım 1: Dil ve Para Birimi
zh: 步骤 1: 语言和货币

# setupWizardSaveAndContinueButton
source: Save and Continue
ar: حفظ ومتابعة
de: Speichern und fortfahren
es: Guardar y Continuar
fr: Enregistrer et Continuer
it: Salva e Continua
ru: Сохранить и продолжить
tr: Kaydet ve Devam Et
zh: 保存并继续

# setupWizardErrorSavingSettings
source: Error saving settings: {errorDetails}
ar: خطأ في حفظ الإعدادات: {errorDetails}
de: Fehler beim Speichern der Einstellungen: {errorDetails}
es: Error al guardar ajustes: {errorDetails}
fr: Erreur lors de l'enregistrement des paramètres : {errorDetails}
it: Errore durante il salvataggio delle impostazioni: {errorDetails}
ru: Ошибка сохранения настроек: {errorDetails}
tr: Ayarlar kaydedilirken hata oluştu: {errorDetails}
zh: 保存设置错误: {errorDetails}

# subscriptionScreenTitle
source: Subscription Management
ar: إدارة الاشتراك
de: Abonnement-Verwaltung
es: Gestión de Suscripciones
fr: Gestion des Abonnements
it: Gestione Abbonamenti
ru: Управление подпиской
tr: Abonelik Yönetimi
zh: 订阅管理

# subscriptionErrorLoadingProducts
source: Could not load subscription options. Please try again.
ar: تعذر تحميل خيارات الاشتراك. الرجاء المحاولة مرة أخرى.
de: Abonnementoptionen konnten nicht geladen werden. Bitte versuchen Sie es erneut.
es: No se pudieron cargar las opciones de suscripción. Por favor, inténtalo de nuevo.
fr: Impossible de charger les options d'abonnement. Veuillez réessayer.
it: Impossibile caricare le opzioni di abbonamento. Per favore, riprova.
ru: Не удалось загрузить варианты подписки. Пожалуйста, попробуйте снова.
tr: Abonelik seçenekleri yüklenemedi. Lütfen tekrar deneyin.
zh: 无法加载订阅选项。请重试。

# subscriptionScreenHeader
source: Subscribe to Continue Using the Application
ar: اشترك لمواصلة استخدام التطبيق
de: Abonnieren, um die Anwendung weiterhin nutzen zu können
es: Suscríbete para Seguir Usando la Aplicación
fr: Abonnez-vous pour Continuer à Utiliser l'Application
it: Abbonati per Continuare ad Utilizzare l'Applicazione
ru: Подпишитесь, чтобы продолжить использование приложения
tr: Uygulamayı Kullanmaya Devam Etmek İçin Abone Olun
zh: 订阅以继续使用应用程序

# subscriptionStatusTrial
source: You have {days} days left in your trial. Click to subscribe.
ar: تبقى {days} يومًا في نسختك التجريبية. انقر للاشتراك.
de: Sie haben noch {days} Tage in Ihrer Testversion. Klicken Sie, um sich anzumelden.
es: Te quedan {days} días de prueba. Haz clic para suscribirte.
fr: Il vous reste {days} jours d'essai. Cliquez pour vous abonner.
it: Ti restano {days} giorni di prova. Clicca per abbonarti.
ru: У вас осталось {days} дней пробного периода. Нажмите, чтобы подписаться.
tr: Deneme sürenizin bitmesine {days} gün kaldı. Abone olmak için tıklayın.
zh: 您的试用期还剩 {days} 天。点击订阅。

# subscriptionStatusTrialLastDay
source: Less than 1 day left in your trial!
ar: أقل من يوم واحد متبقٍ في النسخة التجريبية!
de: Weniger als 1 Tag verbleibt in Ihrer Testversion!
es: ¡Queda menos de 1 día para que termine tu prueba!
fr: Il vous reste moins d'un jour d'essai !
it: Meno di 1 giorno rimasto nella tua prova!
ru: Остался меньше 1 дня пробного периода!
tr: Deneme sürenizin bitmesine 1 günden az kaldı!
zh: 您的试用期不足 1 天！

# subscriptionStatusTrialEnded
source: Your trial period has ended!
ar: انتهت الفترة التجريبية!
de: Ihre Testphase ist beendet!
es: ¡Tu período de prueba ha terminado!
fr: Votre période d'essai est terminée !
it: Il tuo periodo di prova è terminato!
ru: Срок вашего пробного периода истек!
tr: Deneme süreniz sona erdi!
zh: 您的试用期已结束！

# subscriptionStatusInactive
source: Your subscription is inactive. Please subscribe to continue.
ar: اشتراكك غير نشط. يرجى الاشتراك للمتابعة.
de: Ihr Abonnement ist inaktiv. Bitte abonnieren Sie, um fortzufahren.
es: Tu suscripción está inactiva. Por favor, suscríbete para continuar.
fr: Votre abonnement est inactif. Veuillez vous abonner pour continuer.
it: Il tuo abbonamento è inattivo. Per favore, abbonati per continuare.
ru: Ваша подписка неактивна. Пожалуйста, подпишитесь, чтобы продолжить.
tr: Aboneliğiniz pasif. Devam etmek için lütfen abone olun.
zh: 您的订阅处于非活跃状态。请订阅以继续。

# subscriptionStatusButtonSubscribe
source: Subscribe
ar: اشترك
de: Abonnieren
es: Suscribirse
fr: S'abonner
it: Abbonati
ru: Подписаться
tr: Abone Ol
zh: 订阅

# loginErrorSubscriptionExpired
source: You cannot log in because your subscription has expired. Please renew it.
ar: لا يمكنك تسجيل الدخول لأن اشتراكك انتهى. يرجى تجديده.
de: Sie können sich nicht anmelden, da Ihr Abonnement abgelaufen ist. Bitte verlängern Sie es.
es: No puedes iniciar sesión porque tu suscripción ha caducado. Por favor, renuévala.
fr: Vous ne pouvez pas vous connecter car votre abonnement a expiré. Veuillez le renouveler.
it: Non puoi accedere perché il tuo abbonamento è scaduto. Per favore, rinnovalo.
ru: Вы не можете войти, так как срок действия вашей подписки истек. Пожалуйста, продлите ее.
tr: Aboneliğiniz sona erdiği için giriş yapamazsınız. Lütfen yenileyin.
zh: 您的订阅已过期，无法登录。请续订。

# setupTablesErrorNoTablesCreated
source: You must create at least one table before continuing.
ar: يجب عليك إنشاء طاولة واحدة على الأقل قبل المتابعة.
de: Sie müssen mindestens einen Tisch erstellen, bevor Sie fortfahren können.
es: Debes crear al menos una mesa antes de continuar.
fr: Vous devez créer au moins une table avant de continuer.
it: Devi creare almeno un tavolo prima di continuare.
ru: Вы должны создать хотя бы один стол, прежде чем продолжить.
tr: Devam etmeden önce en az bir masa oluşturmalısınız.
zh: 您必须至少创建一个桌位才能继续。

# setupKdsErrorNoScreensCreated
source: You must create at least one KDS screen before continuing.
ar: يجب عليك إنشاء شاشة KDS واحدة على الأقل قبل المتابعة.
de: Sie müssen mindestens einen KDS-Bildschirm erstellen, bevor Sie fortfahren können.
es: Debes crear al menos una pantalla KDS antes de continuar.
fr: Vous devez créer au moins un écran KDS avant de continuer.
it: Devi creare almeno uno schermo KDS prima di continuare.
ru: Вы должны создать хотя бы один экран KDS, прежде чем продолжить.
tr: Devam etmeden önce en az bir KDS ekranı oluşturmalısınız.
zh: 您必须至少创建一个 KDS 屏幕才能继续。

# setupCategoriesErrorNoCategoriesCreated
source: You must create at least one category before continuing.
ar: يجب عليك إنشاء فئة واحدة على الأقل قبل المتابعة.
de: Sie müssen mindestens eine Kategorie erstellen, bevor Sie fortfahren können.
es: Debes crear al menos una categoría antes de continuar.
fr: Vous devez créer au moins une catégorie avant de continuer.
it: Devi creare almeno una categoria prima di continuare.
ru: Вы должны создать хотя бы одну категорию, прежде чем продолжить.
tr: Devam etmeden önce en az bir kategori oluşturmalısınız.
zh: 您必须至少创建一个类别才能继续。

# setupMenuItemsErrorNoItemsCreated
source: You must create at least one product before continuing.
ar: يجب عليك إنشاء منتج واحد على الأقل قبل المتابعة.
de: Sie müssen mindestens ein Produkt erstellen, bevor Sie fortfahren können.
es: Debes crear al menos un producto antes de continuar.
fr: Vous devez créer au moins un produit avant de continuer.
it: Devi creare almeno un prodotto prima di continuare.
ru: Вы должны создать хотя бы один продукт, прежде чем продолжить.
tr: Devam etmeden önce en az bir ürün oluşturmalısınız.
zh: 您必须至少创建一个产品才能继续。

# setupVariantsErrorNoVariantsCreated
source: You must create at least one variant for each product (e.g., Standard Price) before continuing.
ar: يجب عليك إنشاء متغير واحد على الأقل لكل منتج (مثل السعر القياسي) قبل المتابعة.
de: Sie müssen mindestens eine Variante für jedes Produkt (z. B. Standardpreis) erstellen, bevor Sie fortfahren können.
es: Debes crear al menos una variante para cada producto (ej. Precio Estándar) antes de continuar.
fr: Vous devez créer au moins une variante pour chaque produit (ex: Prix Standard) avant de continuer.
it: Devi creare almeno una variante per ogni prodotto (es. Prezzo Standard) prima di continuare.
ru: Вы должны создать хотя бы один вариант для каждого продукта (например, Стандартная цена), прежде чем продолжить.
tr: Devam etmeden önce her ürün için en az bir varyant (örn: Standart Fiyat) oluşturmalısınız.
zh: 您必须为每个产品创建至少一个变体 (例如: 标准价格) 才能继续。

# setupTablesTotalCreatedWithLimit
source: Current Number of Tables: {currentCount} / {limit}
ar: العدد الحالي للطاولات: {currentCount} / {limit}
de: Aktuelle Anzahl Tische: {currentCount} / {limit}
es: Número Actual de Mesas: {currentCount} / {limit}
fr: Nombre Actuel de Tables : {currentCount} / {limit}
it: Numero Attuale di Tavoli: {currentCount} / {limit}
ru: Текущее количество столов: {currentCount} / {limit}
tr: Mevcut Masa Sayısı: {currentCount} / {limit}
zh: 当前桌位数: {currentCount} / {limit}

# setupKdsTotalCreatedWithLimit
source: Current Number of KDS Screens: {currentCount} / {limit}
ar: العدد الحالي لشاشات KDS: {currentCount} / {limit}
de: Aktuelle Anzahl KDS-Bildschirme: {currentCount} / {limit}
es: Número Actual de Pantallas KDS: {currentCount} / {limit}
fr: Nombre Actuel d'Écrans KDS : {currentCount} / {limit}
it: Numero Attuale di Schermi KDS: {currentCount} / {limit}
ru: Текущее количество экранов KDS: {currentCount} / {limit}
tr: Mevcut KDS Ekran Sayısı: {currentCount} / {limit}
zh: 当前 KDS 屏幕数: {currentCount} / {limit}

# setupCategoriesTotalCreatedWithLimit
source: {count} / {limit} Categories Created
ar: تم إنشاء {count} / {limit} فئة
de: {count} / {limit} Kategorien erstellt
es: {count} / {limit} Categorías Creadas
fr: {count} / {limit} Catégories Créées
it: {count} / {limit} Categorie Create
ru: Создано категорий: {count} / {limit}
tr: {count} / {limit} Kategori Oluşturuldu
zh: 已创建 {count} / {limit} 个类别

# setupMenuItemsTotalCreatedWithLimit
source: Current Number of Products: {currentCount} / {limit}
ar: العدد الحالي للمنتجات: {currentCount} / {limit}
de: Aktuelle Anzahl Produkte: {currentCount} / {limit}
es: Número Actual de Productos: {currentCount} / {limit}
fr: Nombre Actuel de Produits : {currentCount} / {limit}
it: Numero Attuale di Prodotti: {currentCount} / {limit}
ru: Текущее количество продуктов: {currentCount} / {limit}
tr: Mevcut Ürün Sayısı: {currentCount} / {limit}
zh: 当前产品数: {currentCount} / {limit}

# setupVariantsTotalCreatedWithLimit
source: Total Number of Variants: {currentCount} / {limit}
ar: العدد الإجمالي للمتغيرات: {currentCount} / {limit}
de: Gesamtzahl Varianten: {currentCount} / {limit}
es: Número Total de Variantes: {currentCount} / {limit}
fr: Nombre Total de Variantes : {currentCount} / {limit}
it: Numero Totale di Varianti: {currentCount} / {limit}
ru: Общее количество вариантов: {currentCount} / {limit}
tr: Toplam Varyant Sayısı: {currentCount} / {limit}
zh: 总变体数: {currentCount} / {limit}

# manageStaffTotalWithLimit
source: Number of Staff: {currentCount} / {limit}
ar: عدد الموظفين: {currentCount} / {limit}
de: Anzahl Personal: {currentCount} / {limit}
es: Número de Personal: {currentCount} / {limit}
fr: Nombre de Personnel : {currentCount} / {limit}
it: Numero di Staff: {currentCount} / {limit}
ru: Количество персонала: {currentCount} / {limit}
tr: Personel Sayısı: {currentCount} / {limit}
zh: 员工数: {currentCount} / {limit}

# dialogLimitReachedTitle
source: Limit Reached
ar: تم الوصول إلى الحد الأقصى
de: Limit erreicht
es: Límite Alcanzado
fr: Limite Atteinte
it: Limite Raggiunto
ru: Лимит достигнут
tr: Limit Aşıldı
zh: 达到限制

# dialogButtonLater
source: Later
ar: لاحقًا
de: Später
es: Más Tarde
fr: Plus Tard
it: Più Tardi
ru: Позже
tr: Daha Sonra
zh: 稍后

# dialogButtonUpgradePlan
source: Upgrade Plan
ar: ترقية الباقة
de: Plan upgraden
es: Mejorar Plan
fr: Mettre à Niveau le Forfait
it: Aggiorna Piano
ru: Обновить план
tr: Paketi Yükselt
zh: 升级套餐

# setupTablesErrorLimitReached
source: You have reached your table creation limit. Please upgrade your subscription plan to add new tables.
ar: لقد وصلت إلى الحد الأقصى لإنشاء الطاولات. يرجى ترقية باقة اشتراكك لإضافة طاولات جديدة.
de: Sie haben Ihr Tisch-Erstellungslimit erreicht. Bitte upgraden Sie Ihren Abonnement-Plan, um neue Tische hinzuzufügen.
es: Has alcanzado tu límite de creación de mesas. Por favor, mejora tu plan de suscripción para añadir nuevas mesas.
fr: Vous avez atteint votre limite de création de tables. Veuillez mettre à niveau votre forfait d'abonnement pour ajouter de nouvelles tables.
it: Hai raggiunto il limite di creazione tavoli. Per favore, aggiorna il tuo piano di abbonamento per aggiungere nuovi tavoli.
ru: Вы достигли лимита на создание столов. Пожалуйста, обновите план подписки, чтобы добавить новые столы.
tr: Masa oluşturma limitinize ulaştınız. Yeni masa eklemek için lütfen abonelik paketinizi yükseltin.
zh: 您已达到桌位创建限制。请升级您的订阅套餐以添加新桌位。

# setupKdsErrorLimitReached
source: You have reached your KDS screen creation limit. Please upgrade your subscription plan to add new screens.
ar: لقد وصلت إلى الحد الأقصى لإنشاء شاشات KDS. يرجى ترقية باقة اشتراكك لإضافة شاشات جديدة.
de: Sie haben Ihr KDS-Bildschirm-Erstellungslimit erreicht. Bitte upgraden Sie Ihren Abonnement-Plan, um neue Bildschirme hinzuzufügen.
es: Has alcanzado tu límite de creación de pantallas KDS. Por favor, mejora tu plan de suscripción para añadir nuevas pantallas.
fr: Vous avez atteint votre limite de création d'écrans KDS. Veuillez mettre à niveau votre forfait d'abonnement pour ajouter de nouveaux écrans.
it: Hai raggiunto il limite di creazione schermi KDS. Per favore, aggiorna il tuo piano di abbonamento per aggiungere nuovi schermi.
ru: Вы достигли лимита на создание экранов KDS. Пожалуйста, обновите план подписки, чтобы добавить новые экраны.
tr: KDS ekranı oluşturma limitinize ulaştınız. Yeni ekran eklemek için lütfen abonelik paketinizi yükseltin.
zh: 您已达到 KDS 屏幕创建限制。请升级您的订阅套餐以添加新屏幕。

# setupMenuItemsErrorLimitReached
source: You have reached your product creation limit. Please upgrade your subscription plan to add new products.
ar: لقد وصلت إلى الحد الأقصى لإنشاء المنتجات. يرجى ترقية باقة اشتراكك لإضافة منتجات جديدة.
de: Sie haben Ihr Produkt-Erstellungslimit erreicht. Bitte upgraden Sie Ihren Abonnement-Plan, um neue Produkte hinzuzufügen.
es: Has alcanzado tu límite de creación de productos. Por favor, mejora tu plan de suscripción para añadir nuevos productos.
fr: Vous avez atteint votre limite de création de produits. Veuillez mettre à niveau votre forfait d'abonnement pour ajouter de nouveaux produits.
it: Hai raggiunto il limite di creazione prodotti. Per favore, aggiorna il tuo piano di abbonamento per aggiungere nuovi prodotti.
ru: Вы достигли лимита на создание продуктов. Пожалуйста, обновите план подписки, чтобы добавить новые продукты.
tr: Ürün oluşturma limitinize ulaştınız. Yeni ürün eklemek için lütfen abonelik paketinizi yükseltin.
zh: 您已达到产品创建限制。请升级您的订阅套餐以添加新产品。

# setupTablesErrorLimitExceeded
source: You have exceeded your table limit ({maxTables}). You cannot add {newTables} more tables to your current {currentTables}.
ar: لقد تجاوزت الحد الأقصى لعدد الطاولات ({maxTables}). لا يمكنك إضافة {newTables} طاولات إضافية إلى طاولاتك الحالية {currentTables}.
de: Sie haben Ihr Tisch-Limit ({maxTables}) überschritten. Sie können nicht {newTables} weitere Tische zu Ihren aktuellen {currentTables} hinzufügen.
es: Has excedido tu límite de mesas ({maxTables}). No puedes añadir {newTables} mesas más a tus {currentTables} actuales.
fr: Vous avez dépassé votre limite de tables ({maxTables}). Vous ne pouvez pas ajouter {newTables} tables supplémentaires à vos {currentTables} actuelles.
it: Hai superato il limite di tavoli ({maxTables}). Non puoi aggiungere {newTables} tavoli in più ai tuoi {currentTables} attuali.
ru: Вы превысили лимит столов ({maxTables}). Вы не можете добавить еще {newTables} стола к вашим текущим {currentTables}.
tr: Masa limitinizi ({maxTables}) aştınız. Mevcut {currentTables} masanıza {newTables} adet daha ekleyemezsiniz.
zh: 您已超出桌位限制 ({maxTables})。您不能在当前 {currentTables} 个桌位基础上再添加 {newTables} 个桌位。

# setupKdsErrorLimitExceeded
source: You have exceeded your KDS Screen limit ({maxKds}). You cannot add {newKds} more screens to your current {currentKds}.
ar: لقد تجاوزت الحد الأقصى لشاشات KDS ({maxKds}). لا يمكنك إضافة {newKds} شاشات إضافية إلى شاشاتك الحالية {currentKds}.
de: Sie haben Ihr KDS-Bildschirm-Limit ({maxKds}) überschritten. Sie können nicht {newKds} weitere Bildschirme zu Ihren aktuellen {currentKds} hinzufügen.
es: Has excedido tu límite de pantallas KDS ({maxKds}). No puedes añadir {newKds} pantallas más a tus {currentKds} actuales.
fr: Vous avez dépassé votre limite d'Écrans KDS ({maxKds}). Vous ne pouvez pas ajouter {newKds} écrans supplémentaires à vos {currentKds} actuels.
it: Hai superato il limite di Schermi KDS ({maxKds}). Non puoi aggiungere {newKds} schermi in più ai tuoi {currentKds} attuali.
ru: Вы превысили лимит экранов KDS ({maxKds}). Вы не можете добавить еще {newKds} экрана к вашим текущим {currentKds}.
tr: KDS Ekran limitinizi ({maxKds}) aştınız. Mevcut {currentKds} ekranınıza {newKds} adet daha ekleyemezsiniz.
zh: 您已超出 KDS 屏幕限制 ({maxKds})。您不能在当前 {currentKds} 个屏幕基础上再添加 {newKds} 个屏幕。

# createCategoryErrorLimitExceeded
source: You have reached your category creation limit ({maxCategories}). Please upgrade your plan to add a new category.
ar: لقد وصلت إلى الحد الأقصى لإنشاء الفئات ({maxCategories}). يرجى ترقية باقتك لإضافة فئة جديدة.
de: Sie haben Ihr Kategorie-Erstellungslimit ({maxCategories}) erreicht. Bitte upgraden Sie Ihren Plan, um eine neue Kategorie hinzuzufügen.
es: Has alcanzado tu límite de creación de categorías ({maxCategories}). Por favor, mejora tu plan para añadir una nueva categoría.
fr: Vous avez atteint votre limite de création de catégories ({maxCategories}). Veuillez mettre à niveau votre forfait pour ajouter une nouvelle catégorie.
it: Hai raggiunto il limite di creazione categorie ({maxCategories}). Per favore, aggiorna il tuo piano per aggiungere una nuova categoria.
ru: Вы достигли лимита на создание категорий ({maxCategories}). Пожалуйста, обновите план, чтобы добавить новую категорию.
tr: Kategori oluşturma limitinize ({maxCategories}) ulaştınız. Yeni bir kategori ekleyebilmek için lütfen paketinizi yükseltin.
zh: 您已达到类别创建限制 ({maxCategories})。请升级您的套餐以添加新类别。

# createMenuItemErrorLimitExceeded
source: You have reached your product creation limit ({maxMenuItems}). Please upgrade your plan to add a new product.
ar: لقد وصلت إلى الحد الأقصى لإنشاء المنتجات ({maxMenuItems}). يرجى ترقية باقتك لإضافة منتج جديد.
de: Sie haben Ihr Produkt-Erstellungslimit ({maxMenuItems}) erreicht. Bitte upgraden Sie Ihren Plan, um ein neues Produkt hinzuzufügen.
es: Has alcanzado tu límite de creación de productos ({maxMenuItems}). Por favor, mejora tu plan para añadir un nuevo producto.
fr: Vous avez atteint votre limite de création de produits ({maxMenuItems}). Veuillez mettre à niveau votre forfait pour ajouter un nouveau produit.
it: Hai raggiunto il limite di creazione prodotti ({maxMenuItems}). Per favore, aggiorna il tuo piano per aggiungere un nuovo prodotto.
ru: Вы достигли лимита на создание продуктов ({maxMenuItems}). Пожалуйста, обновите план, чтобы добавить новый продукт.
tr: Ürün oluşturma limitinize ({maxMenuItems}) ulaştınız. Yeni bir ürün ekleyebilmek için lütfen paketinizi yükseltin.
zh: 您已达到产品创建限制 ({maxMenuItems})。请升级您的套餐以添加新产品。

# manageKdsErrorLimitExceeded
source: You have reached your KDS Screen creation limit ({maxKds}). Please upgrade your plan to add a new screen.
ar: لقد وصلت إلى الحد الأقصى لإنشاء شاشات KDS ({maxKds}). يرجى ترقية باقتك لإضافة شاشة جديدة.
de: Sie haben Ihr KDS-Bildschirm-Erstellungslimit ({maxKds}) erreicht. Bitte upgraden Sie Ihren Plan, um einen neuen Bildschirm hinzuzufügen.
es: Has alcanzado tu límite de creación de pantallas KDS ({maxKds}). Por favor, mejora tu plan para añadir una nueva pantalla.
fr: Vous avez atteint votre limite de création d'Écrans KDS ({maxKds}). Veuillez mettre à niveau votre forfait pour ajouter un nouvel écran.
it: Hai raggiunto il limite di creazione Schermi KDS ({maxKds}). Per favore, aggiorna il tuo piano per aggiungere un nuovo schermo.
ru: Вы достигли лимита на создание экранов KDS ({maxKds}). Пожалуйста, обновите план, чтобы добавить новый экран.
tr: KDS Ekranı oluşturma limitinize ({maxKds}) ulaştınız. Yeni bir ekran ekleyebilmek için lütfen paketinizi yükseltin.
zh: 您已达到 KDS 屏幕创建限制 ({maxKds})。请升级您的套餐以添加新屏幕。

# manageTablesErrorLimitExceeded
source: You have reached your table creation limit ({maxTables}). Please upgrade your plan to add a new table.
ar: لقد وصلت إلى الحد الأقصى لإنشاء الطاولات ({maxTables}). يرجى ترقية باقتك لإضافة طاولة جديدة.
de: Sie haben Ihr Tisch-Erstellungslimit ({maxTables}) erreicht. Bitte upgraden Sie Ihren Plan, um einen neuen Tisch hinzuzufügen.
es: Has alcanzado tu límite de creación de mesas ({maxTables}). Por favor, mejora tu plan para añadir una nueva mesa.
fr: Vous avez atteint votre limite de création de tables ({maxTables}). Veuillez mettre à niveau votre forfait pour ajouter une nouvelle table.
it: Hai raggiunto il limite di creazione tavoli ({maxTables}). Per favore, aggiorna il tuo piano per aggiungere un nuovo tavolo.
ru: Вы достигли лимита на создание столов ({maxTables}). Пожалуйста, обновите план, чтобы добавить новый стол.
tr: Masa oluşturma limitinize ({maxTables}) ulaştınız. Yeni bir masa ekleyebilmek için lütfen paketinizi yükseltin.
zh: 您已达到桌位创建限制 ({maxTables})。请升级您的套餐以添加新桌位。

# createVariantErrorLimitExceeded
source: You have reached your variant/option creation limit ({maxVariants}). Please upgrade your plan to add a new variant.
ar: لقد وصلت إلى الحد الأقصى لإنشاء المتغيرات/الخيارات ({maxVariants}). يرجى ترقية باقتك لإضافة متغير جديد.
de: Sie haben Ihr Varianten-/Options-Erstellungslimit ({maxVariants}) erreicht. Bitte upgraden Sie Ihren Plan, um eine neue Variante hinzuzufügen.
es: Has alcanzado tu límite de creación de variantes/opciones ({maxVariants}). Por favor, mejora tu plan para añadir una nueva variante.
fr: Vous avez atteint votre limite de création de variantes/options ({maxVariants}). Veuillez mettre à niveau votre forfait pour ajouter une nouvelle variante.
it: Hai raggiunto il limite di creazione varianti/opzioni ({maxVariants}). Per favore, aggiorna il tuo piano per aggiungere una nuova variante.
ru: Вы достигли лимита на создание вариантов/опций ({maxVariants}). Пожалуйста, обновите план, чтобы добавить новый вариант.
tr: Varyant/seçenek oluşturma limitinize ({maxVariants}) ulaştınız. Yeni bir varyant ekleyebilmek için lütfen paketinizi yükseltin.
zh: 您已达到变体/选项创建限制 ({maxVariants})。请升级您的套餐以添加新变体。
