Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# infoPrintingKitchenTicket
source: Printing kitchen ticket...
ar: جاري طباعة تذكرة المطبخ...
de: Küchenticket wird gedruckt...
es: Imprimiendo ticket de cocina...
fr: Impression du ticket de cuisine en cours...
it: Stampa ticket cucina...
ru: Печать кухонного чека...
tr: Mutfak fişi yazdırılıyor...
zh: 正在打印厨房小票...

# errorPrintingKitchenTicket
source: Kitchen ticket printing error: {error}
ar: خطأ في طباعة تذكرة المطبخ: {error}
de: Fehler beim Drucken des Küchentickets: {error}
es: Error de impresión del ticket de cocina: {error}
fr: Erreur d'impression du ticket de cuisine : {error}
it: Errore stampa ticket cucina: {error}
ru: Ошибка печати кухонного чека: {error}
tr: Mutfak fişi yazdırma hatası: {error}
zh: 厨房小票打印错误: {error}

# dialogCancelOrderTitle
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# dialogCancelOrderContent
source: Are you sure you want to cancel this order? This action cannot be undone.
ar: هل أنت متأكد أنك تريد إلغاء هذا الطلب؟ لا يمكن التراجع عن هذا الإجراء.
de: Sind Sie sicher, dass Sie diese Bestellung stornieren möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres cancelar este pedido? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir annuler cette commande ? Cette action est irréversible.
it: Sei sicuro di voler annullare questo ordine? Questa azione non può essere annullata.
ru: Вы уверены, что хотите отменить этот заказ? Это действие необратимо.
tr: Bu siparişi iptal etmek istediğinize emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要取消此订单吗？此操作无法撤销。

# dialogButtonNo
source: No
ar: لا
de: Nein
fr: Non
ru: Нет
tr: Hayır
zh: 否

# dialogButtonYesCancel
source: Yes, Cancel
ar: نعم، إلغاء
de: Ja, stornieren
es: Sí, Cancelar
fr: Oui, Annuler
it: Sì, Annulla
ru: Да, отменить
tr: Evet, İptal Et
zh: 是，取消

# buttonDeliver
source: Deliver
ar: توصيل
de: Ausliefern
es: Entregar
fr: Livrer
it: Consegna
ru: Доставить
tr: Teslim Et
zh: 送达

# buttonAddExtra
source: Add Extra
ar: إضافة إضافي
de: Extra hinzufügen
es: Añadir Extra
fr: Ajouter un Extra
it: Aggiungi Extra
ru: Добавить дополнительно
tr: Ekstra Ekle
zh: 添加附加项

# buttonRemove
source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Retirer
it: Rimuovi
ru: Удалить
tr: Kaldır
zh: 移除

# buttonPaymentScreen
source: Payment Screen
ar: شاشة الدفع
de: Zahlungsbildschirm
es: Pantalla de Pago
fr: Écran de Paiement
it: Schermata Pagamento
ru: Экран оплаты
tr: Ödeme Ekranı
zh: 支付屏幕

# statusDelivered
source: Delivered
ar: تم التوصيل
de: Ausgeliefert
es: Entregado
fr: Livrée
it: Consegnato
ru: Доставлено
tr: Teslim Edildi
zh: 已送达

# statusPaidFull
source: THIS ORDER HAS BEEN PAID
ar: تم دفع هذا الطلب
de: DIESE BESTELLUNG WURDE BEZAHLT
es: ESTE PEDIDO HA SIDO PAGADO
fr: CETTE COMMANDE A ÉTÉ PAYÉE
it: QUESTO ORDINE È STATO PAGATO
ru: ЭТОТ ЗАКАЗ ОПЛАЧЕН
tr: BU SİPARİŞ ÖDENDİ
zh: 此订单已支付

# statusCancelledFull
source: ORDER CANCELED
ar: تم إلغاء الطلب
de: BESTELLUNG STORNIERT
es: PEDIDO CANCELADO
fr: COMMANDE ANNULÉE
it: ORDINE ANNULLATO
ru: ЗАКАЗ ОТМЕНЕН
tr: SİPARİŞ İPTAL EDİLDİ
zh: 订单已取消

# statusRejectedFull
source: ORDER REJECTED
ar: تم رفض الطلب
de: BESTELLUNG ABGELEHNT
es: PEDIDO RECHAZADO
fr: COMMANDE REJETÉE
it: ORDINE RIFIUTATO
ru: ЗАКАЗ ОТКЛОНЕН
tr: SİPARİŞ REDDEDİLDİ
zh: 订单已拒绝

# errorNoOrderItems
source: No order items found.
ar: لم يتم العثور على عناصر في الطلب.
de: Keine Bestellpositionen gefunden.
es: No se encontraron artículos del pedido.
fr: Aucun article de commande trouvé.
it: Nessun articolo d'ordine trovato.
ru: Элементы заказа не найдены.
tr: Sipariş kalemleri bulunamadı.
zh: 未找到订单项。

# infoProductAdded
source: Product added successfully.
ar: تمت إضافة المنتج بنجاح.
de: Produkt erfolgreich hinzugefügt.
es: Producto añadido con éxito.
fr: Produit ajouté avec succès.
it: Prodotto aggiunto con successo.
ru: Продукт успешно добавлен.
tr: Ürün başarıyla eklendi.
zh: 产品添加成功。

# errorAddingProduct
source: Error while adding product: {statusCode} - {details}
ar: خطأ أثناء إضافة المنتج: {statusCode} - {details}
de: Fehler beim Hinzufügen des Produkts: {statusCode} - {details}
es: Error al añadir producto: {statusCode} - {details}
fr: Erreur lors de l'ajout du produit : {statusCode} - {details}
it: Errore durante l'aggiunta del prodotto: {statusCode} - {details}
ru: Ошибка при добавлении продукта: {statusCode} - {details}
tr: Ürün eklenirken hata: {statusCode} - {details}
zh: 添加产品时出错: {statusCode} - {details}

# errorAddingProductGeneral
source: An unexpected error occurred while adding product: {error}
ar: حدث خطأ غير متوقع أثناء إضافة المنتج: {error}
de: Ein unerwarteter Fehler beim Hinzufügen des Produkts ist aufgetreten: {error}
es: Ocurrió un error inesperado al añadir producto: {error}
fr: Une erreur inattendue s'est produite lors de l'ajout du produit : {error}
it: Si è verificato un errore inatteso durante l'aggiunta del prodotto: {error}
ru: Произошла непредвиденная ошибка при добавлении продукта: {error}
tr: Ürün ekleme sırasında beklenmedik bir hata: {error}
zh: 添加产品时发生意外错误: {error}

# infoProductDeleted
source: Product deleted successfully.
ar: تم حذف المنتج بنجاح.
de: Produkt erfolgreich gelöscht.
es: Producto eliminado con éxito.
fr: Produit supprimé avec succès.
it: Prodotto eliminato con successo.
ru: Продукт успешно удален.
tr: Ürün başarıyla silindi.
zh: 产品删除成功。

# errorDeletingProduct
source: Error occurred while deleting product: {statusCode} - {details}
ar: حدث خطأ أثناء حذف المنتج: {statusCode} - {details}
de: Fehler beim Löschen des Produkts: {statusCode} - {details}
es: Ocurrió un error al eliminar producto: {statusCode} - {details}
fr: Une erreur s'est produite lors de la suppression du produit : {statusCode} - {details}
it: Si è verificato un errore durante l'eliminazione del prodotto: {statusCode} - {details}
ru: Произошла ошибка при удалении продукта: {statusCode} - {details}
tr: Ürün silinirken hata oluştu: {statusCode} - {details}
zh: 删除产品时出错: {statusCode} - {details}

# errorDeletingProductGeneral
source: Error: {error}
ar: خطأ: {error}
de: Fehler: {error}
fr: Erreur : {error}
it: Errore: {error}
ru: Ошибка: {error}
tr: Hata: {error}
zh: 错误: {error}

# infoItemDelivered
source: Item delivered.
ar: تم توصيل العنصر.
de: Position ausgeliefert.
es: Artículo entregado.
fr: Article livré.
it: Articolo consegnato.
ru: Товар доставлен.
tr: Kalem teslim edildi.
zh: 产品已送达。

# errorDeliveringItem
source: An error occurred during delivery: {statusCode}
ar: حدث خطأ أثناء التسليم: {statusCode}
de: Ein Fehler ist während der Auslieferung aufgetreten: {statusCode}
es: Ocurrió un error durante la entrega: {statusCode}
fr: Une erreur s'est produite lors de la livraison : {statusCode}
it: Si è verificato un errore durante la consegna: {statusCode}
ru: Произошла ошибка при доставке: {statusCode}
tr: Teslim işlemi sırasında hata oluştu: {statusCode}
zh: 送达过程中发生错误: {statusCode}

# errorDeliveringItemGeneral
source: Delivery error: {error}
ar: خطأ في التسليم: {error}
de: Auslieferungsfehler: {error}
es: Error de entrega: {error}
fr: Erreur de livraison : {error}
it: Errore di consegna: {error}
ru: Ошибка доставки: {error}
tr: Teslim işlemi hatası: {error}
zh: 送达错误: {error}

# infoPagerAssigned
source: Pager assigned to order.
ar: تم تعيين جهاز النداء للطلب.
de: Pager der Bestellung zugewiesen.
es: Localizador asignado al pedido.
fr: Biper assigné à la commande.
it: Pager assegnato all'ordine.
ru: Пейджер назначен заказу.
tr: Çağrı cihazı siparişe atandı.
zh: 传呼机已分配给订单。

# errorAssigningPager
source: Pager assignment error: {statusCode}
ar: خطأ في تعيين جهاز النداء: {statusCode}
de: Fehler bei der Pager-Zuweisung: {statusCode}
es: Error de asignación de localizador: {statusCode}
fr: Erreur d'assignation du biper : {statusCode}
it: Errore assegnazione pager: {statusCode}
ru: Ошибка назначения пейджера: {statusCode}
tr: Cihaz atama hatası: {statusCode}
zh: 传呼机分配错误: {statusCode}

# errorAssigningPagerGeneral
source: Error while assigning pager: {error}
ar: خطأ أثناء تعيين جهاز النداء: {error}
de: Fehler beim Zuweisen des Pagers: {error}
es: Error al asignar localizador: {error}
fr: Erreur lors de l'assignation du biper : {error}
it: Errore durante l'assegnazione del pager: {error}
ru: Ошибка при назначении пейджера: {error}
tr: Cihaz atama sırasında hata: {error}
zh: 分配传呼机时出错: {error}

# infoOrderCancelled
source: Order canceled successfully.
ar: تم إلغاء الطلب بنجاح.
de: Bestellung erfolgreich storniert.
es: Pedido cancelado con éxito.
fr: Commande annulée avec succès.
it: Ordine annullato con successo.
ru: Заказ успешно отменен.
tr: Sipariş başarıyla iptal edildi.
zh: 订单取消成功。

# errorCancellingOrder
source: Error while canceling order: {statusCode} - {details}
ar: خطأ أثناء إلغاء الطلب: {statusCode} - {details}
de: Fehler beim Stornieren der Bestellung: {statusCode} - {details}
es: Error al cancelar pedido: {statusCode} - {details}
fr: Erreur lors de l'annulation de la commande : {statusCode} - {details}
it: Errore durante l'annullamento dell'ordine: {statusCode} - {details}
ru: Ошибка при отмене заказа: {statusCode} - {details}
tr: Sipariş iptal edilirken hata: {statusCode} - {details}
zh: 取消订单时出错: {statusCode} - {details}

# errorCancellingOrderGeneral
source: Cancellation error: {error}
ar: خطأ في الإلغاء: {error}
de: Stornierungsfehler: {error}
es: Error de cancelación: {error}
fr: Erreur d'annulation : {error}
it: Errore di annullamento: {error}
ru: Ошибка отмены: {error}
tr: İptal hatası: {error}
zh: 取消错误: {error}

# dialogDeleteItemTitle
source: Delete Product
ar: حذف المنتج
de: Produkt löschen
es: Eliminar Producto
fr: Supprimer le Produit
it: Elimina Prodotto
ru: Удалить продукт
tr: Ürünü Sil
zh: 删除产品

# dialogDeleteItemContent
source: Are you sure you want to remove this product from the order?
ar: هل أنت متأكد أنك تريد إزالة هذا المنتج من الطلب؟
de: Sind Sie sicher, dass Sie dieses Produkt von der Bestellung entfernen möchten?
es: ¿Estás seguro de que quieres eliminar este producto del pedido?
fr: Êtes-vous sûr de vouloir retirer ce produit de la commande ?
it: Sei sicuro di voler rimuovere questo prodotto dall'ordine?
ru: Вы уверены, что хотите удалить этот продукт из заказа?
tr: Bu ürünü siparişten kaldırmak istediğinize emin misiniz?
zh: 您确定要从订单中移除此产品吗？

# dialogButtonDelete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ru: Удалить
tr: Sil
zh: 删除

# dialogQrTitle
source: Customer Order Link (#{orderId})
ar: رابط طلب العميل (#{orderId})
de: Kundenbestell-Link (#{orderId})
es: Enlace de Pedido del Cliente (#{orderId})
fr: Lien de Commande Client (#{orderId})
it: Link Ordine Cliente (#{orderId})
ru: Ссылка на заказ клиента (#{orderId})
tr: Müşteri Sipariş Linki (#{orderId})
zh: 顾客订单链接 (单号: #{orderId})

# dialogButtonClose
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ru: Закрыть
tr: Kapat
zh: 关闭

# errorOrderDetailsNotFound
source: Order details could not be retrieved or the order may have been deleted.
ar: لا يمكن استرداد تفاصيل الطلب أو ربما تم حذف الطلب.
de: Bestelldetails konnten nicht abgerufen werden oder die Bestellung wurde möglicherweise gelöscht.
es: No se pudieron recuperar los detalles del pedido o el pedido pudo haber sido eliminado.
fr: Les détails de la commande n'ont pas pu être récupérés ou la commande a peut-être été supprimée.
it: Impossibile recuperare i dettagli dell'ordine o l'ordine potrebbe essere stato eliminato.
ru: Не удалось получить детали заказа или заказ мог быть удален.
tr: Sipariş detayları alınamadı veya sipariş silinmiş olabilir.
zh: 无法检索订单详情，或订单可能已被删除。

# errorOrderDetailsUpdate
source: Order details update error: {error}
ar: خطأ في تحديث تفاصيل الطلب: {error}
de: Fehler beim Aktualisieren der Bestelldetails: {error}
es: Error de actualización de detalles del pedido: {error}
fr: Erreur de mise à jour des détails de la commande : {error}
it: Errore aggiornamento dettagli ordine: {error}
ru: Ошибка обновления деталей заказа: {error}
tr: Sipariş detayları güncelleme hatası: {error}
zh: 订单详情更新错误: {error}

# infoAddingProduct
source: Adding product...
ar: جاري إضافة المنتج...
de: Produkt wird hinzugefügt...
es: Añadiendo producto...
fr: Ajout du produit en cours...
it: Aggiunta prodotto in corso...
ru: Добавление продукта...
tr: Ürün ekleniyor...
zh: 正在添加产品...

# takeawayOrderDetailsTitle
source: Takeaway Order Details #{orderId}
ar: تفاصيل طلب سفري رقم #{orderId}
de: Details zur Außer-Haus-Bestellung #{orderId}
es: Detalles del Pedido para Llevar #{orderId}
fr: Détails de la Commande à Emporter #{orderId}
it: Dettagli Ordine da Asporto #{orderId}
ru: Детали заказа на вынос #{orderId}
tr: Paket Sipariş Detayları #{orderId}
zh: 外卖订单详情 #{orderId}

# categoryListPageTitle
source: Categories
ar: الفئات
de: Kategorien
es: Categorías
fr: Catégories
it: Categorie
ru: Категории
tr: Kategoriler
zh: 类别

# tooltipAddCategory
source: Add Category
ar: إضافة فئة
de: Kategorie hinzufügen
es: Añadir Categoría
fr: Ajouter une Catégorie
it: Aggiungi Categoria
ru: Добавить категорию
tr: Kategori Ekle
zh: 添加类别

# tooltipEdit
source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ru: Редактировать
tr: Düzenle
zh: 编辑

# tooltipDelete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ru: Удалить
tr: Sil
zh: 删除

# dialogDeleteCategoryTitle
source: Delete Category
ar: حذف الفئة
de: Kategorie löschen
es: Eliminar Categoría
fr: Supprimer la Catégorie
it: Elimina Categoria
ru: Удалить категорию
tr: Kategoriyi Sil
zh: 删除类别

# dialogButtonCancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ru: Отмена
tr: İptal
zh: 取消

# dialogButtonDeleteConfirm
source: Yes, Delete
ar: نعم، حذف
de: Ja, löschen
es: Sí, Eliminar
fr: Oui, Supprimer
it: Sì, Elimina
ru: Да, удалить
tr: Evet, Sil
zh: 是，删除

# infoCategoryDeleted
source: Category deleted successfully.
ar: تم حذف الفئة بنجاح.
de: Kategorie erfolgreich gelöscht.
es: Categoría eliminada con éxito.
fr: Catégorie supprimée avec succès.
it: Categoria eliminata con successo.
ru: Категория успешно удалена.
tr: Kategori başarıyla silindi.
zh: 类别删除成功。

# errorCategoryDelete
source: Error occurred while deleting category: {statusCode} - {details}
ar: حدث خطأ أثناء حذف الفئة: {statusCode} - {details}
de: Fehler beim Löschen der Kategorie: {statusCode} - {details}
es: Ocurrió un error al eliminar categoría: {statusCode} - {details}
fr: Une erreur s'est produite lors de la suppression de la catégorie : {statusCode} - {details}
it: Si è verificato un errore durante l'eliminazione della categoria: {statusCode} - {details}
ru: Произошла ошибка при удалении категории: {statusCode} - {details}
tr: Kategori silinirken hata oluştu: {statusCode} - {details}
zh: 删除类别时出错: {statusCode} - {details}

# noCategoriesAdded
source: No categories have been added yet.
ar: لم تتم إضافة أي فئات بعد.
de: Es wurden noch keine Kategorien hinzugefügt.
es: Aún no se han añadido categorías.
fr: Aucune catégorie n'a été ajoutée pour le moment.
it: Nessuna categoria è stata ancora aggiunta.
ru: Категории еще не добавлены.
tr: Henüz kategori eklenmemiş.
zh: 尚未添加任何类别。

# buttonAddFirstCategory
source: Add First Category
ar: إضافة الفئة الأولى
de: Erste Kategorie hinzufügen
es: Añadir Primera Categoría
fr: Ajouter la Première Catégorie
it: Aggiungi Prima Categoria
ru: Добавить первую категорию
tr: İlk Kategoriyi Ekle
zh: 添加第一个类别

# errorFetchingCategories
source: An error occurred while fetching the category list: {statusCode}
ar: حدث خطأ أثناء جلب قائمة الفئات: {statusCode}
de: Ein Fehler ist beim Abrufen der Kategorieliste aufgetreten: {statusCode}
es: Ocurrió un error al obtener la lista de categorías: {statusCode}
fr: Une erreur s'est produite lors de la récupération de la liste des catégories : {statusCode}
it: Si è verificato un errore durante il recupero dell'elenco delle categorie: {statusCode}
ru: Произошла ошибка при получении списка категорий: {statusCode}
tr: Kategori listesi alınırken hata oluştu: {statusCode}
zh: 获取类别列表时发生错误: {statusCode}

source: Unknown Category
ar: فئة غير معروفة
de: Unbekannte Kategorie
es: Categoría Desconocida
fr: Catégorie Inconnue
it: Categoria Sconosciuta
ru: Неизвестная категория
tr: Bilinmeyen Kategori
zh: 未知类别

# manageMenuPageTitle
source: Menu Management
ar: إدارة القائمة
de: Menüverwaltung
es: Gestión de Menú
fr: Gestion du Menu
it: Gestione Menù
ru: Управление меню
tr: Menü Yönetimi
zh: 菜单管理

# tooltipAddMenuItem
source: Add New Menu Item
ar: إضافة عنصر قائمة جديد
de: Neuen Menüpunkt hinzufügen
es: Añadir Nuevo Artículo de Menú
fr: Ajouter un Nouvel Élément de Menu
it: Aggiungi Nuovo Elemento Menù
ru: Добавить новый пункт меню
tr: Yeni Menü Öğesi Ekle
zh: 添加新的菜单项

# noMenuItemsAdded
source: No menu items have been added yet.
ar: لم تتم إضافة أي عناصر للقائمة بعد.
de: Es wurden noch keine Menüpunkte hinzugefügt.
es: Aún no se han añadido artículos de menú.
fr: Aucun élément de menu n'a été ajouté pour le moment.
it: Nessun elemento menù è stato ancora aggiunto.
ru: Пункты меню еще не добавлены.
tr: Henüz menü öğesi eklenmemiş.
zh: 尚未添加任何菜单项。

# buttonAddFirstMenuItem
source: Add First Menu Item
ar: إضافة عنصر القائمة الأول
de: Ersten Menüpunkt hinzufügen
es: Añadir Primer Artículo de Menú
fr: Ajouter le Premier Élément de Menu
it: Aggiungi Primo Elemento Menù
ru: Добавить первый пункт меню
tr: İlk Menü Öğesini Ekle
zh: 添加第一个菜单项

# dialogDeleteMenuItemTitle
source: Delete Menu Item
ar: حذف عنصر القائمة
de: Menüpunkt löschen
es: Eliminar Artículo de Menú
fr: Supprimer l'Élément de Menu
it: Elimina Elemento Menù
ru: Удалить пункт меню
tr: Menü Öğesi Sil
zh: 删除菜单项

# dialogDeleteMenuItemContent
source: Are you sure you want to delete the item {menuItemName}?
ar: هل أنت متأكد أنك تريد حذف العنصر {menuItemName}؟
de: Sind Sie sicher, dass Sie den Artikel {menuItemName} löschen möchten?
es: ¿Estás seguro de que quieres eliminar el artículo {menuItemName}?
fr: Êtes-vous sûr de vouloir supprimer l'article {menuItemName} ?
it: Sei sicuro di voler eliminare l'articolo {menuItemName}?
ru: Вы уверены, что хотите удалить товар {menuItemName}?
tr: {menuItemName} ürününü silmek istediğinizden emin misiniz?
zh: 您确定要删除产品 {menuItemName} 吗？

# infoMenuItemDeleted
source: Menu item deleted successfully.
ar: تم حذف عنصر القائمة بنجاح.
de: Menüpunkt erfolgreich gelöscht.
es: Artículo de menú eliminado con éxito.
fr: Élément de menu supprimé avec succès.
it: Elemento menù eliminato con successo.
ru: Пункт меню успешно удален.
tr: Menü öğesi başarıyla silindi.
zh: 菜单项删除成功。

# errorDeletingMenuItem
source: Error while deleting menu item: {statusCode} - {details}
ar: خطأ أثناء حذف عنصر القائمة: {statusCode} - {details}
de: Fehler beim Löschen des Menüpunkts: {statusCode} - {details}
es: Error al eliminar artículo de menú: {statusCode} - {details}
fr: Erreur lors de la suppression de l'élément de menu : {statusCode} - {details}
it: Errore durante l'eliminazione dell'elemento menù: {statusCode} - {details}
ru: Ошибка при удалении пункта меню: {statusCode} - {details}
tr: Menü öğesi silinirken hata: {statusCode} - {details}
zh: 删除菜单项时出错: {statusCode} - {details}

# errorDeletingMenuItemGeneral
source: Menu item deletion error: {error}
ar: خطأ في حذف عنصر القائمة: {error}
de: Fehler beim Löschen des Menüpunkts: {error}
es: Error al eliminar artículo de menú: {error}
fr: Erreur de suppression de l'élément de menu : {error}
it: Errore eliminazione elemento menù: {error}
ru: Ошибка удаления пункта меню: {error}
tr: Menü öğesi silme hatası: {error}
zh: 菜单项删除错误: {error}

# errorFetchingMenuItems
source: An error occurred while fetching menu items: {statusCode}
ar: حدث خطأ أثناء جلب عناصر القائمة: {statusCode}
de: Ein Fehler ist beim Abrufen der Menüpunkte aufgetreten: {statusCode}
es: Ocurrió un error al obtener artículos de menú: {statusCode}
fr: Une erreur s'est produite lors de la récupération des éléments de menu : {statusCode}
it: Si è verificato un errore durante il recupero degli elementi menù: {statusCode}
ru: Произошла ошибка при получении пунктов меню: {statusCode}
tr: Menü öğeleri alınırken hata oluştu: {statusCode}
zh: 获取菜单项时发生错误: {statusCode}

# addMenuItemTitle
source: New Menu Item
ar: عنصر قائمة جديد
de: Neuer Menüpunkt
es: Nuevo Artículo de Menú
fr: Nouvel Élément de Menu
it: Nuovo Elemento Menù
ru: Новый пункт меню
tr: Yeni Menü Öğesi
zh: 新菜单项

# editMenuItemTitle
source: Edit Menu Item
ar: تعديل عنصر القائمة
de: Menüpunkt bearbeiten
es: Editar Artículo de Menú
fr: Modifier l'Élément de Menu
it: Modifica Elemento Menù
ru: Редактировать пункт меню
tr: Menü Öğesini Düzenle
zh: 编辑菜单项

# menuItemPhotoNotSelected
source: Photo not selected.
ar: لم يتم تحديد صورة.
de: Foto nicht ausgewählt.
es: Foto no seleccionada.
fr: Photo non sélectionnée.
it: Foto non selezionata.
ru: Фото не выбрано.
tr: Fotoğraf seçilmedi.
zh: 未选择照片。

# buttonSelectOrChangePhoto
source: Select/Change Photo
ar: تحديد/تغيير الصورة
de: Foto auswählen/ändern
es: Seleccionar/Cambiar Foto
fr: Sélectionner/Changer la Photo
it: Seleziona/Cambia Foto
ru: Выбрать/Изменить фото
tr: Fotoğraf Seç/Değiştir
zh: 选择/更改照片

# menuItemNameLabel
source: Product Name
ar: اسم المنتج
de: Produktname
es: Nombre del Producto
fr: Nom du Produit
it: Nome Prodotto
ru: Название продукта
tr: Ürün Adı
zh: 产品名称

# menuItemNameValidator
source: Please enter the product name
ar: الرجاء إدخال اسم المنتج
de: Bitte geben Sie den Produktnamen ein
es: Por favor, introduce el nombre del producto
fr: Veuillez saisir le nom du produit
it: Per favore, inserisci il nome del prodotto
ru: Пожалуйста, введите название продукта
tr: Lütfen ürün adını girin
zh: 请输入产品名称

# menuItemDescriptionLabel
source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ru: Описание
tr: Açıklama
zh: 描述

# menuItemDescriptionValidator
source: Please enter a description
ar: الرجاء إدخال وصف
de: Bitte geben Sie eine Beschreibung ein
es: Por favor, introduce una descripción
fr: Veuillez saisir une description
it: Per favore, inserisci una descrizione
ru: Пожалуйста, введите описание
tr: Lütfen açıklama girin
zh: 请输入描述

# menuCategoryLabel
source: Category (Optional)
ar: الفئة (اختياري)
de: Kategorie (Optional)
es: Categoría (Opcional)
fr: Catégorie (Facultatif)
it: Categoria (Opzionale)
ru: Категория (Необязательно)
tr: Kategori (Opsiyonel)
zh: 类别 (可选)

# menuCategoryNotSelected
source: Category not selected
ar: لم يتم تحديد فئة
de: Kategorie nicht ausgewählt
es: Categoría no seleccionada
fr: Catégorie non sélectionnée
it: Categoria non selezionata
ru: Категория не выбрана
tr: Kategori seçilmedi
zh: 未选择类别

# infoMenuItemCreated
source: Menu item created successfully!
ar: تم إنشاء عنصر القائمة بنجاح!
de: Menüpunkt erfolgreich erstellt!
es: ¡Artículo de menú creado con éxito!
fr: Élément de menu créé avec succès !
it: Elemento menù creato con successo!
ru: Пункт меню успешно создан!
tr: Menü öğesi başarıyla oluşturuldu!
zh: 菜单项创建成功！

# infoMenuItemUpdated
source: Menu item updated successfully!
ar: تم تحديث عنصر القائمة بنجاح!
de: Menüpunkt erfolgreich aktualisiert!
es: ¡Artículo de menú actualizado con éxito!
fr: Élément de menu mis à jour avec succès !
it: Elemento menù aggiornato con successo!
ru: Пункт меню успешно обновлен!
tr: Menü öğesi başarıyla güncellendi!
zh: 菜单项更新成功！

# errorUploadingPhoto
source: An error occurred while uploading the photo to Firebase.
ar: حدث خطأ أثناء تحميل الصورة إلى Firebase.
de: Beim Hochladen des Fotos auf Firebase ist ein Fehler aufgetreten.
es: Ocurrió un error al subir la foto a Firebase.
fr: Une erreur s'est produite lors du téléchargement de la photo vers Firebase.
it: Si è verificato un errore durante il caricamento della foto su Firebase.
ru: Произошла ошибка при загрузке фото в Firebase.
tr: Fotoğraf Firebase'e yüklenirken hata oluştu.
zh: 将照片上传到Firebase时发生错误。
