Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# setupStockDescription
source: Enter the initial stock quantities for your products. You can complete this step later.
ar: أدخل كميات المخزون الأولية لمنتجاتك. يمكنك إكمال هذه الخطوة لاحقًا.
de: Geben Sie die anfänglichen Lagermengen für Ihre Produkte ein. Sie können diesen Schritt später abschließen.
es: Introduce las cantidades de stock inicial para tus productos. Puedes completar este paso más tarde.
fr: Saisissez les quantités de stock initiales pour vos produits. Vous pouvez compléter cette étape plus tard.
it: Inserisci le quantità iniziali di magazzino per i tuoi prodotti. Puoi completare questo passaggio in seguito.
ru: Введите начальное количество запасов для ваших продуктов. Вы можете завершить этот шаг позже.
tr: Ürünlerinizin başlangıç stok miktarlarını girin. Bu adımı daha sonra da tamamlayabilirsiniz.
zh: 输入产品的初始库存数量。您可以稍后完成此步骤。

# setupStockNoStockEntered
source: No stock has been entered yet.
ar: لم يتم إدخال أي مخزون بعد.
de: Es wurde noch kein Bestand eingegeben.
es: Aún no se ha introducido stock.
fr: Aucun stock n'a été saisi pour le moment.
it: Nessuna scorta è stata ancora inserita.
ru: Запас еще не введен.
tr: Henüz stok girilmedi.
zh: 尚未输入库存。

# setupStockLastUpdate
source: Last Update: {date}
ar: آخر تحديث: {date}
de: Letzte Aktualisierung: {date}
es: Última Actualización: {date}
fr: Dernière Mise à Jour : {date}
it: Ultimo Aggiornamento: {date}
ru: Последнее обновление: {date}
tr: Son Güncelleme: {date}
zh: 上次更新: {date}

# setupStockQuantityHint
source: Quantity
ar: الكمية
de: Menge
es: Cantidad
fr: Quantité
it: Quantità
ru: Количество
tr: Adet
zh: 数量

# setupKdsErrorLoadingExisting
source: Could not load existing screens: {error}
ar: تعذر تحميل الشاشات الموجودة: {error}
de: Vorhandene Bildschirme konnten nicht geladen werden: {error}
es: No se pudieron cargar las pantallas existentes: {error}
fr: Impossible de charger les écrans existants : {error}
it: Impossibile caricare gli schermi esistenti: {error}
ru: Не удалось загрузить существующие экраны: {error}
tr: Mevcut ekranlar yüklenemedi: {error}
zh: 无法加载现有屏幕: {error}

# setupKdsDefaultKitchen
source: Kitchen
ar: مطبخ
de: Küche
es: Cocina
fr: Cuisine
it: Cucina
ru: Кухня
tr: Mutfak
zh: 厨房

# setupKdsDefaultBar
source: Bar
ar: بار
ru: Бар
zh: 吧台

# setupKdsErrorEnterOneName
source: Please enter at least one valid screen name.
ar: الرجاء إدخال اسم شاشة واحد صالح على الأقل.
de: Bitte geben Sie mindestens einen gültigen Bildschirmnamen ein.
es: Por favor, introduce al menos un nombre de pantalla válido.
fr: Veuillez saisir au moins un nom d'écran valide.
it: Per favore, inserisci almeno un nome di schermo valido.
ru: Пожалуйста, введите хотя бы одно действительное имя экрана.
tr: Lütfen en az bir geçerli ekran adı girin.
zh: 请至少输入一个有效的屏幕名称。

# setupKdsSuccessCreated
source: {count} new KDS screen(s) created.
ar: تم إنشاء {count} شاشة (شاشات) KDS جديدة.
de: {count} neuer KDS-Bildschirm(e) erstellt.
es: {count} nueva(s) pantalla(s) KDS creada(s).
fr: {count} nouvel(s) écran(s) KDS créé(s).
it: {count} nuovo(i) schermo(i) KDS creato(i).
ru: Создано {count} новый(х) экран(а/ов) KDS.
tr: {count} adet yeni KDS ekranı oluşturuldu.
zh: 已创建 {count} 个新 KDS 屏幕。

# setupKdsDeleteDialogTitle
source: Delete Screen
ar: حذف الشاشة
de: Bildschirm löschen
es: Eliminar Pantalla
fr: Supprimer l'Écran
it: Elimina Schermo
ru: Удалить экран
tr: Ekranı Sil
zh: 删除屏幕

# setupKdsDeleteDialogContent
source: Are you sure you want to delete the screen named '{screenName}'?
ar: هل أنت متأكد أنك تريد حذف الشاشة المسماة '{screenName}'؟
de: Sind Sie sicher, dass Sie den Bildschirm namens '{screenName}' löschen möchten?
es: ¿Estás seguro de que quieres eliminar la pantalla llamada '{screenName}'?
fr: Êtes-vous sûr de vouloir supprimer l'écran nommé '{screenName}' ?
it: Sei sicuro di voler eliminare lo schermo chiamato '{screenName}'?
ru: Вы уверены, что хотите удалить экран с именем «{screenName}»?
tr: '{screenName}' adlı ekranı silmek istediğinizden emin misiniz?
zh: 您确定要删除名为“{screenName}”的屏幕吗？

# setupKdsInfoDeleted
source: '{screenName}' has been deleted.
ar: تم حذف '{screenName}'.
de: '{screenName}' wurde gelöscht.
es: '{screenName}' ha sido eliminada.
fr: '{screenName}' a été supprimé.
it: '{screenName}' è stato eliminato.
ru: «{screenName}» удален.
tr: '{screenName}' silindi.
zh: “{screenName}”已删除。

# setupKdsErrorDeleting
source: Deletion error: {error}
ar: خطأ في الحذف: {error}
de: Fehler beim Löschen: {error}
es: Error de eliminación: {error}
fr: Erreur de suppression : {error}
it: Errore di eliminazione: {error}
ru: Ошибка удаления: {error}
tr: Silme hatası: {error}
zh: 删除错误: {error}

# setupKdsEditDialogTitle
source: Edit Screen
ar: تعديل الشاشة
de: Bildschirm bearbeiten
es: Editar Pantalla
fr: Modifier l'Écran
it: Modifica Schermo
ru: Редактировать экран
tr: Ekranı Düzenle
zh: 编辑屏幕

# setupKdsEditDialogNameLabel
source: Screen Name
ar: اسم الشاشة
de: Bildschirmname
es: Nombre de la Pantalla
fr: Nom de l'Écran
it: Nome Schermo
ru: Имя экрана
tr: Ekran Adı
zh: 屏幕名称

# setupKdsEditDialogActiveLabel
source: Active
ar: نشط
de: Aktiv
es: Activo
fr: Actif
it: Attivo
ru: Активный
tr: Aktif
zh: 活跃

# setupKdsErrorUpdating
source: Update error: {error}
ar: خطأ في التحديث: {error}
de: Fehler beim Aktualisieren: {error}
es: Error de actualización: {error}
fr: Erreur de mise à jour : {error}
it: Errore di aggiornamento: {error}
ru: Ошибка обновления: {error}
tr: Güncelleme hatası: {error}
zh: 更新错误: {error}

# setupKdsDescription
source: How many screens do you want to divide your order process into? (e.g., Kitchen, Bar, Patisserie)
ar: كم عدد الشاشات التي تريد تقسيم عملية طلبك إليها؟ (مثل المطبخ، البار، الحلويات)
de: In wie viele Bildschirme möchten Sie Ihren Bestellprozess unterteilen? (z. B. Küche, Bar, Patisserie)
es: ¿En cuántas pantallas quieres dividir tu proceso de pedidos? (ej. Cocina, Bar, Pastelería)
fr: En combien d'écrans souhaitez-vous diviser votre processus de commande ? (ex: Cuisine, Bar, Pâtisserie)
it: In quante schermate vuoi dividere il processo dei tuoi ordini? (es. Cucina, Bar, Pasticceria)
ru: На сколько экранов вы хотите разделить процесс заказа? (например, Кухня, Бар, Кондитерская)
tr: Sipariş sürecinizi kaç ekrana bölmek istersiniz? (Örn: Mutfak, Bar, Pastane)
zh: 您想将订单流程划分成多少个屏幕？ (例如: 厨房、吧台、糕点房)

# setupKdsNewLabel
source: Number of New Screens*
ar: عدد الشاشات الجديدة*
de: Anzahl neuer Bildschirme*
es: Número de Nuevas Pantallas*
fr: Nombre de Nouveaux Écrans*
it: Numero di Nuovi Schermi*
ru: Количество новых экранов*
tr: Yeni Ekran Sayısı*
zh: 新屏幕数量*

# setupKdsScreenNameLabel
source: Screen {number} Name*
ar: اسم الشاشة {number}*
de: Bildschirm {number} Name*
es: Nombre de la Pantalla {number}*
fr: Nom de l'Écran {number}*
it: Nome Schermo {number}*
ru: Имя экрана {number}*
tr: Ekran {number} Adı*
zh: 屏幕 {number} 名称*

# setupKdsScreenNameValidator
source: Screen name cannot be empty.
ar: لا يمكن أن يكون اسم الشاشة فارغًا.
de: Der Bildschirmname darf nicht leer sein.
es: El nombre de la pantalla no puede estar vacío.
fr: Le nom de l'écran ne peut pas être vide.
it: Il nome dello schermo non può essere vuoto.
ru: Имя экрана не может быть пустым.
tr: Ekran adı boş olamaz.
zh: 屏幕名称不能为空。

# setupKdsAddButton
source: Add New Screen(s)
ar: إضافة شاشة (شاشات) جديدة
de: Neuen Bildschirm/Neue Bildschirme hinzufügen
es: Añadir Nueva(s) Pantalla(s)
fr: Ajouter de Nouvel(s) Écran(s)
it: Aggiungi Nuovo(i) Schermo(i)
ru: Добавить новый(е) экран(ы)
tr: Yeni Ekran(lar) Ekle
zh: 添加新屏幕

# setupKdsExistingTitle
source: Existing KDS Screens
ar: شاشات KDS الموجودة
de: Vorhandene KDS-Bildschirme
es: Pantallas KDS Existentes
fr: Écrans KDS Existants
it: Schermi KDS Esistenti
ru: Существующие экраны KDS
tr: Mevcut KDS Ekranları
zh: 现有 KDS 屏幕

# setupKdsNoScreensYet
source: No KDS screens have been created yet.
ar: لم يتم إنشاء أي شاشات KDS بعد.
de: Es wurden noch keine KDS-Bildschirme erstellt.
es: Aún no se han creado pantallas KDS.
fr: Aucun écran KDS n'a été créé pour le moment.
it: Nessuno schermo KDS è stato ancora creato.
ru: Экраны KDS еще не созданы.
tr: Henüz KDS ekranı oluşturulmadı.
zh: 尚未创建 KDS 屏幕。

# setupKdsStatusLabel
source: Status: {status}
ar: الحالة: {status}
es: Estado: {status}
fr: Statut : {status}
it: Stato: {status}
ru: Статус: {status}
tr: Durum: {status}
zh: 状态: {status}

# setupKdsStatusActive
source: Active
ar: نشط
de: Aktiv
es: Activo
fr: Actif
it: Attivo
ru: Активный
tr: Aktif
zh: 活跃

# setupKdsStatusInactive
source: Inactive
ar: غير نشط
de: Inaktiv
es: Inactivo
fr: Inactif
it: Inattivo
ru: Неактивный
tr: Pasif
zh: 非活跃

# setupTablesErrorLoadingExisting
source: An error occurred while loading existing tables.
ar: حدث خطأ أثناء تحميل الطاولات الموجودة.
de: Beim Laden vorhandener Tische ist ein Fehler aufgetreten.
es: Ocurrió un error al cargar mesas existentes.
fr: Une erreur s'est produite lors du chargement des tables existantes.
it: Si è verificato un errore durante il caricamento dei tavoli esistenti.
ru: Произошла ошибка при загрузке существующих столов.
tr: Mevcut masalar yüklenirken bir hata oluştu.
zh: 加载现有桌位时发生错误。

# setupTablesSuccessCreated
source: {count} new table(s) were successfully created. Total tables: {total}
ar: تم إنشاء {count} طاولة (طاولات) جديدة بنجاح. إجمالي الطاولات: {total}
de: {count} neuer Tisch(e) wurde(n) erfolgreich erstellt. Gesamtzahl Tische: {total}
es: {count} nueva(s) mesa(s) fueron creadas con éxito. Total de mesas: {total}
fr: {count} nouvelle(s) table(s) ont été créées avec succès. Total des tables : {total}
it: {count} nuovo(i) tavolo(i) creato(i) con successo. Totale tavoli: {total}
ru: Успешно создано {count} новый(х) стол(а/ов). Всего столов: {total}
tr: {count} adet yeni masa başarıyla oluşturuldu. Toplam masa sayısı: {total}
zh: 已成功创建 {count} 个新桌位。 总桌位数: {total}

# setupTablesDescription
source: Create all your tables instantly by entering the total number of tables in your establishment. You can view the automatically generated QR menus for each table after completing the setup screen.
ar: أنشئ جميع طاولاتك على الفور عن طريق إدخال العدد الإجمالي للطاولات في منشأتك. يمكنك عرض قوائم QR التي تم إنشاؤها تلقائيًا لكل طاولة بعد إكمال شاشة الإعداد.
de: Erstellen Sie alle Ihre Tische sofort, indem Sie die Gesamtzahl der Tische in Ihrem Lokal eingeben. Sie können die automatisch generierten QR-Menüs für jeden Tisch nach Abschluss der Einrichtung anzeigen.
es: Crea todas tus mesas al instante introduciendo el número total de mesas en tu establecimiento. Puedes ver los menús QR generados automáticamente para cada mesa después de completar la pantalla de configuración.
fr: Créez toutes vos tables instantanément en saisissant le nombre total de tables dans votre établissement. Vous pourrez visualiser les menus QR générés automatiquement pour chaque table après avoir terminé l'écran de configuration.
it: Crea tutti i tuoi tavoli istantaneamente inserendo il numero totale di tavoli nel tuo locale. Puoi visualizzare i menù QR generati automaticamente per ogni tavolo dopo aver completato la schermata di configurazione.
ru: Мгновенно создайте все ваши столы, введя общее количество столов в вашем заведении. Вы можете просмотреть автоматически сгенерированные QR-меню для каждого стола после завершения экрана настройки.
tr: İşletmenizdeki toplam masa sayısını girerek tüm masalarınızı anında oluşturun. Her masa için otomatik olarak oluşturulacak QR menülerinizi, kurulum ekranı tamamladıktan sonra görüntüleyebilirsiniz.
zh: 输入您场所的总桌位数，立即创建所有桌位。您可以在完成设置屏幕后查看每个桌位自动生成的二维码菜单。

# setupTablesLabelQuantity
source: Number of Tables to Create
ar: عدد الطاولات المراد إنشاؤها
de: Anzahl der zu erstellenden Tische
es: Número de Mesas a Crear
fr: Nombre de Tables à Créer
it: Numero di Tavoli da Creare
ru: Количество столов для создания
tr: Oluşturulacak Masa Adedi
zh: 要创建的桌位数

# setupTablesButtonCreate
source: Create Tables
ar: إنشاء الطاولات
de: Tische erstellen
es: Crear Mesas
fr: Créer les Tables
it: Crea Tavoli
ru: Создать столы
tr: Masaları Oluştur
zh: 创建桌位

# setupTablesLoadingExisting
source: Loading existing tables...
ar: جاري تحميل الطاولات الموجودة...
de: Vorhandene Tische werden geladen...
es: Cargando mesas existentes...
fr: Chargement des tables existantes...
it: Caricamento tavoli esistenti...
ru: Загрузка существующих столов...
tr: Mevcut masalar yükleniyor...
zh: 正在加载现有桌位...

# setupTablesTotalCreated
source: Total Tables Created: {count}
ar: إجمالي الطاولات التي تم إنشاؤها: {count}
de: Gesamtzahl erstellter Tische: {count}
es: Total de Mesas Creadas: {count}
fr: Total des Tables Créées : {count}
it: Totale Tavoli Creati: {count}
ru: Всего создано столов: {count}
tr: Oluşturulan Toplam Masa: {count}
zh: 已创建总桌位数: {count}

# setupMenuItemsErrorSelectCategory
source: Please select a category for the product.
ar: الرجاء تحديد فئة للمنتج.
de: Bitte wählen Sie eine Kategorie für das Produkt aus.
es: Por favor, selecciona una categoría para el producto.
fr: Veuillez sélectionner une catégorie pour le produit.
it: Per favore, seleziona una categoria per il prodotto.
ru: Пожалуйста, выберите категорию для продукта.
tr: Lütfen ürün için bir kategori seçin.
zh: 请为产品选择一个类别。

# setupMenuItemsSuccessAdded
source: The '{productName}' product was successfully added.
ar: تمت إضافة منتج '{productName}' بنجاح.
de: Das Produkt '{productName}' wurde erfolgreich hinzugefügt.
es: El producto '{productName}' fue añadido con éxito.
fr: Le produit '{productName}' a été ajouté avec succès.
it: Il prodotto '{productName}' è stato aggiunto con successo.
ru: Продукт «{productName}» успешно добавлен.
tr: '{productName}' ürünü başarıyla eklendi.
zh: “{productName}”产品已成功添加。

# setupMenuItemsInfoDeleted
source: The '{productName}' product was deleted.
ar: تم حذف منتج '{productName}'.
de: Das Produkt '{productName}' wurde gelöscht.
es: El producto '{productName}' fue eliminado.
fr: Le produit '{productName}' a été supprimé.
it: Il prodotto '{productName}' è stato eliminato.
ru: Продукт «{productName}» удален.
tr: '{productName}' ürünü silindi.
zh: “{productName}”产品已删除。

# setupMenuItemsDescription
source: Add your menu items. You can add prices and variants in the next step.
ar: أضف عناصر قائمتك. يمكنك إضافة الأسعار والمتغيرات في الخطوة التالية.
de: Fügen Sie Ihre Menüpunkte hinzu. Preise und Varianten können Sie im nächsten Schritt hinzufügen.
es: Añade los artículos de tu menú. Puedes añadir precios y variantes en el siguiente paso.
fr: Ajoutez vos éléments de menu. Vous pourrez ajouter les prix et les variantes à l'étape suivante.
it: Aggiungi i tuoi elementi del menù. Puoi aggiungere prezzi e varianti nel passaggio successivo.
ru: Добавьте ваши пункты меню. Вы можете добавить цены и варианты на следующем шаге.
tr: Menü öğelerinizi ekleyin. Fiyatları ve varyantları bir sonraki adımda ekleyebilirsiniz.
zh: 添加您的菜单项。您可以在下一步中添加价格和变体。

# setupMenuItemsNameLabel
source: Product Name*
ar: اسم المنتج*
de: Produktname*
es: Nombre del Producto*
fr: Nom du Produit*
it: Nome Prodotto*
ru: Название продукта*
tr: Ürün Adı*
zh: 产品名称*

# setupMenuItemsNameValidator
source: Product name is required.
ar: اسم المنتج مطلوب.
de: Der Produktname ist erforderlich.
es: El nombre del producto es obligatorio.
fr: Le nom du produit est requis.
it: Il nome del prodotto è obbligatorio.
ru: Название продукта обязательно.
tr: Ürün adı gerekli.
zh: 产品名称为必填项。

# setupMenuItemsDescriptionLabel
source: Description (Optional)
ar: الوصف (اختياري)
de: Beschreibung (Optional)
es: Descripción (Opcional)
fr: Description (Facultatif)
it: Descrizione (Opzionale)
ru: Описание (Необязательно)
tr: Açıklama (Opsiyonel)
zh: 描述 (可选)

# setupMenuItemsLoadingCategories
source: Loading categories...
ar: جاري تحميل الفئات...
de: Kategorien werden geladen...
es: Cargando categorías...
fr: Chargement des catégories...
it: Caricamento categorie...
ru: Загрузка категорий...
tr: Kategoriler yükleniyor...
zh: 正在加载类别...

# setupMenuItemsErrorCreateCategoryFirst
source: Please create a category first or go back to the previous step.
ar: الرجاء إنشاء فئة أولاً أو العودة إلى الخطوة السابقة.
de: Bitte erstellen Sie zuerst eine Kategorie oder gehen Sie zum vorherigen Schritt zurück.
es: Por favor, crea una categoría primero o vuelve al paso anterior.
fr: Veuillez d'abord créer une catégorie ou revenir à l'étape précédente.
it: Per favore, crea prima una categoria o torna al passaggio precedente.
ru: Пожалуйста, сначала создайте категорию или вернитесь к предыдущему шагу.
tr: Lütfen önce bir kategori oluşturun veya önceki adıma geri dönün.
zh: 请先创建一个类别，或返回上一步。

# setupMenuItemsSelectCategoryLabel
source: Select Category*
ar: تحديد الفئة*
de: Kategorie auswählen*
es: Seleccionar Categoría*
fr: Sélectionner la Catégorie*
it: Seleziona Categoria*
ru: Выбрать категорию*
tr: Kategori Seçin*
zh: 选择类别*

# setupMenuItemsSelectCategoryValidator
source: Please select a category.
ar: الرجاء تحديد فئة.
de: Bitte wählen Sie eine Kategorie aus.
es: Por favor, selecciona una categoría.
fr: Veuillez sélectionner une catégorie.
it: Per favore, seleziona una categoria.
ru: Пожалуйста, выберите категорию.
tr: Lütfen bir kategori seçin.
zh: 请选择一个类别。

# setupMenuItemsSelectImageLabel
source: Select Product Image (Optional)
ar: تحديد صورة المنتج (اختياري)
de: Produktbild auswählen (Optional)
es: Seleccionar Imagen de Producto (Opcional)
fr: Sélectionner l'Image du Produit (Facultatif)
it: Seleziona Immagine Prodotto (Opzionale)
ru: Выбрать изображение продукта (Необязательно)
tr: Ürün Görseli Seç (Opsiyonel)
zh: 选择产品图片 (可选)

# setupMenuItemsAddButton
source: Add Product
ar: إضافة منتج
de: Produkt hinzufügen
es: Añadir Producto
fr: Ajouter le Produit
it: Aggiungi Prodotto
ru: Добавить продукт
tr: Ürün Ekle
zh: 添加产品

# setupMenuItemsAddedTitle
source: Added Products
ar: المنتجات المضافة
de: Hinzugefügte Produkte
es: Productos Añadidos
fr: Produits Ajoutés
it: Prodotti Aggiunti
ru: Добавленные продукты
tr: Eklenen Ürünler
zh: 已添加产品

# setupMenuItemsNoCategory
source: Uncategorized
ar: غير مصنف
de: Ohne Kategorie
es: Sin Categoría
fr: Non Catégorisé
it: Non Categorizzato
ru: Без категории
tr: Kategorisiz
zh: 未分类

# setupMenuItemsDeleteTooltip
source: Delete Product
ar: حذف المنتج
de: Produkt löschen
es: Eliminar Producto
fr: Supprimer le Produit
it: Elimina Prodotto
ru: Удалить продукт
tr: Ürünü Sil
zh: 删除产品

# setupVariantsErrorLoadingMenuItems
source: Error loading menu items: {error}
ar: خطأ في تحميل عناصر القائمة: {error}
de: Fehler beim Laden der Menüpunkte: {error}
es: Error al cargar artículos de menú: {error}
fr: Erreur lors du chargement des éléments de menu : {error}
it: Errore caricamento elementi menù: {error}
ru: Ошибка загрузки пунктов меню: {error}
tr: Menü öğeleri yüklenirken hata: {error}
zh: 加载菜单项错误: {error}

# setupVariantsErrorLoadingVariants
source: Error loading variants: {error}
ar: خطأ في تحميل المتغيرات: {error}
de: Fehler beim Laden der Varianten: {error}
es: Error al cargar variantes: {error}
fr: Erreur lors du chargement des variantes : {error}
it: Errore caricamento varianti: {error}
ru: Ошибка загрузки вариантов: {error}
tr: Varyantlar yüklenirken hata: {error}
zh: 加载变体错误: {error}

# setupVariantsErrorSelectMainProductFirst
source: Please select a main product first.
ar: الرجاء تحديد منتج رئيسي أولاً.
de: Bitte wählen Sie zuerst ein Hauptprodukt aus.
es: Por favor, selecciona un producto principal primero.
fr: Veuillez d'abord sélectionner un produit principal.
it: Per favore, seleziona prima un prodotto principale.
ru: Пожалуйста, сначала выберите основной продукт.
tr: Lütfen önce bir ana ürün seçin.
zh: 请先选择一个主要产品。

# setupVariantsSuccessAdded
source: The '{variantName}' variant was successfully added.
ar: تمت إضافة المتغير '{variantName}' بنجاح.
de: Die Variante '{variantName}' wurde erfolgreich hinzugefügt.
es: La variante '{variantName}' fue añadida con éxito.
fr: La variante '{variantName}' a été ajoutée avec succès.
it: La variante '{variantName}' è stata aggiunta con successo.
ru: Вариант «{variantName}» успешно добавлен.
tr: '{variantName}' varyantı başarıyla eklendi.
zh: “{variantName}”变体已成功添加。

# setupVariantsLoadingMainProducts
source: Loading main products...
ar: جاري تحميل المنتجات الرئيسية...
de: Hauptprodukte werden geladen...
es: Cargando productos principales...
fr: Chargement des produits principaux...
it: Caricamento prodotti principali...
ru: Загрузка основных продуктов...
tr: Ana ürünler yükleniyor...
zh: 正在加载主要产品...

# setupVariantsErrorCreateMainProductFirst
source: Please create a main product first (Previous Step).
ar: الرجاء إنشاء منتج رئيسي أولاً (الخطوة السابقة).
de: Bitte erstellen Sie zuerst ein Hauptprodukt (vorheriger Schritt).
es: Por favor, crea un producto principal primero (Paso Anterior).
fr: Veuillez d'abord créer un produit principal (Étape Précédente).
it: Per favore, crea prima un prodotto principale (Passaggio Precedente).
ru: Пожалуйста, сначала создайте основной продукт (Предыдущий шаг).
tr: Lütfen önce bir ana ürün oluşturun (Önceki Adım).
zh: 请先创建一个主要产品 (上一步)。

# setupVariantsLabelSelectMainProduct
source: Main Product to Add Variant to*
ar: المنتج الرئيسي لإضافة المتغير إليه*
de: Hauptprodukt, dem die Variante hinzugefügt werden soll*
es: Producto Principal al que Añadir Variante*
fr: Produit Principal auquel Ajouter la Variante*
it: Prodotto Principale a cui Aggiungere la Variante*
ru: Основной продукт, к которому добавляется вариант*
tr: Varyant Eklenecek Ana Ürün*
zh: 要添加变体的主要产品*

# setupVariantsValidatorSelectMainProduct
source: Please select a main product.
ar: الرجاء تحديد منتج رئيسي.
de: Bitte wählen Sie ein Hauptprodukt aus.
es: Por favor, selecciona un producto principal.
fr: Veuillez sélectionner un produit principal.
it: Per favore, seleziona un prodotto principale.
ru: Пожалуйста, выберите основной продукт.
tr: Lütfen bir ana ürün seçin.
zh: 请选择一个主要产品。

# setupVariantsTitleAddNew
source: Add New Variant: {productName}
ar: إضافة متغير جديد: {productName}
de: Neue Variante hinzufügen: {productName}
es: Añadir Nueva Variante: {productName}
fr: Ajouter une Nouvelle Variante : {productName}
it: Aggiungi Nuova Variante: {productName}
ru: Добавить новый вариант: {productName}
tr: Yeni Varyant Ekle: {productName}
zh: 添加新变体: {productName}

# setupVariantsLabelVariantName
source: Variant Name* (e.g., Large, Spicy)
ar: اسم المتغير* (مثل كبير، حار)
de: Variantenname* (z. B. Groß, Scharf)
es: Nombre de la Variante* (ej. Grande, Picante)
fr: Nom de la Variante* (ex: Grand, Épicé)
it: Nome Variante* (es. Grande, Piccante)
ru: Название варианта* (например, Большой, Острый)
tr: Varyant Adı* (örn: Büyük, Acılı)
zh: 变体名称* (例如: 大份、辣味)

# setupVariantsLabelSelectImage
source: Select Variant Image (Optional)
ar: تحديد صورة المتغير (اختياري)
de: Variantenbild auswählen (Optional)
es: Seleccionar Imagen de Variante (Opcional)
fr: Sélectionner l'Image de Variante (Facultatif)
it: Seleziona Immagine Variante (Opzionale)
ru: Выбрать изображение варианта (Необязательно)
tr: Varyant Görseli Seç (Opsiyonel)
zh: 选择变体图片 (可选)

# setupVariantsTitleAddedFor
source: Variants Added for {productName}
ar: المتغيرات المضافة لـ {productName}
de: Hinzugefügte Varianten für {productName}
es: Variantes Añadidas para {productName}
fr: Variantes Ajoutées pour {productName}
it: Varianti Aggiunte per {productName}
ru: Варианты, добавленные для {productName}
tr: {productName} İçin Eklenen Varyantlar
zh: 已为 {productName} 添加的变体

# setupVariantsLoading
source: Loading variants...
ar: جاري تحميل المتغيرات...
de: Varianten werden geladen...
es: Cargando variantes...
fr: Chargement des variantes...
it: Caricamento varianti...
ru: Загрузка вариантов...
tr: Varyantlar yükleniyor...
zh: 正在加载变体...
