Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# menuItemKdvRateLabel
source: VAT Rate
ar: معدل ضريبة القيمة المضافة
de: Mehrwertsteuersatz
es: Tasa de IVA
fr: Taux de TVA
it: Aliquota IVA
ru: Ставка НДС
tr: KDV Oranı
zh: 增值税率

# kdvRateValidatorRequired
source: Please enter a VAT rate.
ar: الرجاء إدخال معدل ضريبة القيمة المضافة.
de: Bitte geben Sie einen Mehrwertsteuersatz ein.
es: Por favor, introduce una tasa de IVA.
fr: Veuillez saisir un taux de TVA.
it: Per favore, inserisci un'aliquota IVA.
ru: Пожалуйста, введите ставку НДС.
tr: Lütfen bir KDV oranı girin.
zh: 请输入增值税率。

# kdvRateValidatorInvalid
source: Please enter a valid rate between 0 and 100.
ar: الرجاء إدخال معدل صالح بين 0 و 100.
de: Bitte geben Sie einen gültigen Satz zwischen 0 und 100 ein.
es: Por favor, introduce una tasa válida entre 0 y 100.
fr: Veuillez saisir un taux valide entre 0 et 100.
it: Per favore, inserisci un'aliquota valida tra 0 e 100.
ru: Пожалуйста, введите действительную ставку от 0 до 100.
tr: Lütfen 0 ile 100 arasında geçerli bir oran girin.
zh: 请输入 0 到 100 之间的有效税率。

# categoryKdvRateLabel
source: Default VAT Rate (%)
ar: معدل ضريبة القيمة المضافة الافتراضي (%)
de: Standard-Mehrwertsteuersatz (%)
es: Tasa de IVA Predeterminada (%)
fr: Taux de TVA par Défaut (%)
it: Aliquota IVA Predefinita (%)
ru: Ставка НДС по умолчанию (%)
tr: Varsayılan KDV Oranı (%)
zh: 默认增值税率 (%)

# categoryDefaultKdvRateLabel
source: Default VAT Rate (%)
ar: معدل ضريبة القيمة المضافة الافتراضي (%)
de: Standard-Mehrwertsteuersatz (%)
es: Tasa de IVA Predeterminada (%)
fr: Taux de TVA par Défaut (%)
it: Aliquota IVA Predefinita (%)
ru: Ставка НДС по умолчанию (%)
tr: Varsayılan KDV Oranı (%)
zh: 默认增值税率 (%)

# reportsExportToExcelTooltip
source: Export Report to Excel
ar: تصدير التقرير إلى Excel
de: Bericht nach Excel exportieren
es: Exportar Informe a Excel
fr: Exporter le Rapport vers Excel
it: Esporta Report in Excel
ru: Экспортировать отчет в Excel
tr: Raporu Excel'e Aktar
zh: 导出报告到 Excel

# reportsErrorNoDataToExport
source: No data to export.
ar: لا توجد بيانات للتصدير.
de: Keine Daten zum Exportieren vorhanden.
es: No hay datos para exportar.
fr: Aucune donnée à exporter.
it: Nessun dato da esportare.
ru: Нет данных для экспорта.
tr: Dışa aktarılacak veri bulunamadı.
zh: 没有数据可导出。

# reportsErrorExportFailed
source: Error exporting report: {errorDetails}
ar: خطأ في تصدير التقرير: {errorDetails}
de: Fehler beim Exportieren des Berichts: {errorDetails}
es: Error al exportar informe: {errorDetails}
fr: Erreur lors de l'exportation du rapport : {errorDetails}
it: Errore esportazione report: {errorDetails}
ru: Ошибка экспорта отчета: {errorDetails}
tr: Rapor dışa aktarılırken hata oluştu: {errorDetails}
zh: 导出报告错误: {errorDetails}

# setupWizardStepStaffTitle
source: Add Staff
ar: إضافة موظفين
de: Personal hinzufügen
es: Añadir Personal
fr: Ajouter du Personnel
it: Aggiungi Staff
ru: Добавить персонал
tr: Personel Ekle
zh: 添加员工

# errorLoadingData
source: Error loading data: {error}
ar: خطأ في تحميل البيانات: {error}
de: Fehler beim Laden der Daten: {error}
es: Error al cargar datos: {error}
fr: Erreur lors du chargement des données : {error}
it: Errore caricamento dati: {error}
ru: Ошибка загрузки данных: {error}
tr: Veriler yüklenirken hata: {error}
zh: 加载数据错误: {error}

# setupStaffDialogTitle
source: Add New Staff Member
ar: إضافة موظف جديد
de: Neues Personalmitglied hinzufügen
es: Añadir Nuevo Miembro del Personal
fr: Ajouter un Nouveau Membre du Personnel
it: Aggiungi Nuovo Membro Staff
ru: Добавить нового сотрудника
tr: Yeni Personel Ekle
zh: 添加新员工

# roleLabel
source: Role
ar: الدور
de: Rolle
es: Rol
fr: Rôle
it: Ruolo
ru: Роль
tr: Rol
zh: 角色

# roleStaff
source: Waiter (Order Authorized)
ar: نادل (مخول بالطلب)
de: Kellner (Bestellberechtigt)
es: Camarero (Autorizado para Pedidos)
fr: Serveur (Autorisé à Prendre les Commandes)
it: Cameriere (Autorizzato Ordini)
ru: Официант (Разрешение на заказ)
tr: Garson (Sipariş Yetkili)
zh: 服务员 (订单授权)

# roleKitchenStaff
source: Kitchen Staff (KDS Authorized)
ar: موظف مطبخ (مخول بـ KDS)
de: Küchenpersonal (KDS-berechtigt)
es: Personal de Cocina (Autorizado para KDS)
fr: Personnel de Cuisine (Autorisé KDS)
it: Staff Cucina (Autorizzato KDS)
ru: Персонал кухни (Разрешение KDS)
tr: Mutfak Personeli (KDS Yetkili)
zh: 厨房员工 (KDS 授权)

# buttonAdd
source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить
tr: Ekle
zh: 添加

# setupStaffDescription
source: You can now add your staff who will take orders and work in the kitchen. The shifts you assign will ensure that staff can only log in during the specified days and hours.
ar: يمكنك الآن إضافة موظفيك الذين سيتلقون الطلبات ويعملون في المطبخ. ستضمن المناوبات التي تعينها أن الموظفين يمكنهم تسجيل الدخول فقط خلال الأيام والساعات المحددة.
de: Sie können jetzt Ihr Personal hinzufügen, das Bestellungen entgegennehmen und in der Küche arbeiten wird. Die von Ihnen zugewiesenen Schichten stellen sicher, dass sich das Personal nur während der angegebenen Tage und Stunden anmelden kann.
es: Ahora puedes añadir a tu personal que tomará pedidos y trabajará en la cocina. Los turnos que asignes asegurarán que el personal solo pueda iniciar sesión durante los días y horas especificados.
fr: Vous pouvez maintenant ajouter votre personnel qui prendra les commandes et travaillera en cuisine. Les quarts que vous assignez garantiront que le personnel ne peut se connecter que pendant les jours et heures spécifiés.
it: Ora puoi aggiungere il tuo staff che prenderà gli ordini e lavorerà in cucina. I turni che assegni garantiranno che lo staff possa accedere solo durante i giorni e gli orari specificati.
ru: Теперь вы можете добавить сотрудников, которые будут принимать заказы и работать на кухне. Назначенные вами смены гарантируют, что сотрудники смогут входить в систему только в указанные дни и часы.
tr: Sipariş alacak ve mutfakta çalışacak personelinizi şimdi ekleyebilirsiniz. Atadığınız vardiyalar, personelin sisteme yalnızca belirlenen gün ve saatlerde giriş yapabilmesini sağlar.
zh: 您现在可以添加负责接单和在厨房工作的员工。您分配的班次将确保员工只能在指定的日期和时间登录。

# addStaffButtonLabel
source: Add Staff
ar: إضافة موظف
de: Personal hinzufügen
es: Añadir Personal
fr: Ajouter du Personnel
it: Aggiungi Staff
ru: Добавить сотрудника
tr: Personel Ekle
zh: 添加员工

# setupStaffAddedTitle
source: Added Staff Members
ar: الموظفون المضافون
de: Hinzugefügte Personalmitglieder
es: Miembros del Personal Añadidos
fr: Membres du Personnel Ajoutés
it: Membri Staff Aggiunti
ru: Добавленные сотрудники
tr: Eklenen Personeller
zh: 已添加员工

# noStaffAdded
source: No staff members have been added yet.
ar: لم تتم إضافة أي موظفين بعد.
de: Es wurden noch keine Personalmitglieder hinzugefügt.
es: Aún no se han añadido miembros del personal.
fr: Aucun membre du personnel n'a été ajouté pour le moment.
it: Nessun membro staff è stato ancora aggiunto.
ru: Сотрудники еще не добавлены.
tr: Henüz personel eklenmedi.
zh: 尚未添加任何员工。

# setupStaffTotalCreatedWithLimit
source: {count} / {limit} Staff Created
ar: تم إنشاء {count} / {limit} موظف
de: {count} / {limit} Personal erstellt
es: {count} / {limit} Personal Creado
fr: {count} / {limit} Personnel Créé
it: {count} / {limit} Staff Creati
ru: Создано сотрудников: {count} / {limit}
tr: {count} / {limit} Personel Oluşturuldu
zh: 已创建 {count} / {limit} 个员工

# kdsAccessSelectionTitle
source: Accessible Kitchen Screens
ar: شاشات المطبخ التي يمكن الوصول إليها
de: Zugängliche Küchenbildschirme
es: Pantallas de Cocina Accesibles
fr: Écrans de Cuisine Accessibles
it: Schermi Cucina Accessibili
ru: Доступные экраны кухни
tr: Erişebileceği Mutfak Ekranları
zh: 可访问的厨房屏幕

# kdsAccessNoKdsAvailable
source: No active KDS screens available to assign. Please create a KDS screen in the previous step.
ar: لا تتوفر شاشات KDS نشطة لتعيينها. يرجى إنشاء شاشة KDS في الخطوة السابقة.
de: Keine aktiven KDS-Bildschirme zur Zuweisung verfügbar. Bitte erstellen Sie einen KDS-Bildschirm im vorherigen Schritt.
es: No hay pantallas KDS activas disponibles para asignar. Por favor, crea una pantalla KDS en el paso anterior.
fr: Aucun écran KDS actif disponible à assigner. Veuillez créer un écran KDS à l'étape précédente.
it: Nessuno schermo KDS attivo disponibile da assegnare. Per favore, crea uno schermo KDS nel passaggio precedente.
ru: Нет активных экранов KDS для назначения. Пожалуйста, создайте экран KDS на предыдущем шаге.
tr: Atanacak aktif KDS ekranı bulunamadı. Lütfen önceki adımda bir KDS ekranı oluşturun.
zh: 没有可供分配的活跃 KDS 屏幕。请在上一步中创建一个 KDS 屏幕。

# setupStaffShowOtherPermissions
source: Show Other Screen Permissions
ar: عرض أذونات الشاشة الأخرى
de: Andere Bildschirmberechtigungen anzeigen
es: Mostrar Otros Permisos de Pantalla
fr: Afficher les Autres Autorisations d'Écran
it: Mostra Altri Permessi Schermo
ru: Показать другие разрешения экрана
tr: Diğer Ekran İzinlerini Göster
zh: 显示其他屏幕权限

# setupStaffShowOtherNotifications
source: Show Other Notification Permissions
ar: عرض أذونات الإشعارات الأخرى
de: Andere Benachrichtigungsberechtigungen anzeigen
es: Mostrar Otros Permisos de Notificación
fr: Afficher les Autres Autorisations de Notification
it: Mostra Altri Permessi Notifica
ru: Показать другие разрешения уведомлений
tr: Diğer Bildirim İzinlerini Göster
zh: 显示其他通知权限

# setupStaffAssignShiftButton
source: Assign Shift
ar: تعيين مناوبة
de: Schicht zuweisen
es: Asignar Turno
fr: Assigner un Quart
it: Assegna Turno
ru: Назначить смену
tr: Vardiya Ata
zh: 分配班次

# setupStaffErrorAssignShift
source: Please assign at least one shift to all added staff before continuing.
ar: الرجاء تعيين مناوبة واحدة على الأقل لجميع الموظفين المضافين قبل المتابعة.
de: Bitte weisen Sie allen hinzugefügten Mitarbeitern mindestens eine Schicht zu, bevor Sie fortfahren.
es: Por favor, asigna al menos un turno a todo el personal añadido antes de continuar.
fr: Veuillez assigner au moins un quart à tout le personnel ajouté avant de continuer.
it: Per favore, assegna almeno un turno a tutto lo staff aggiunto prima di continuare.
ru: Пожалуйста, назначьте хотя бы одну смену всем добавленным сотрудникам, прежде чем продолжить.
tr: Lütfen devam etmeden önce eklenen tüm personele en az bir vardiya atayın.
zh: 请在继续之前为所有已添加的员工分配至少一个班次。

# setupStaffRedirectingToSchedule
source: Redirecting to shift assignment screen for {staffName}...
ar: جاري التوجيه إلى شاشة تعيين المناوبات لـ {staffName}...
de: Weiterleitung zum Schichtzuweisungsbildschirm für {staffName}...
es: Redirigiendo a la pantalla de asignación de turnos para {staffName}...
fr: Redirection vers l'écran d'assignation de quart pour {staffName}...
it: Reindirizzamento alla schermata di assegnazione turni per {staffName}...
ru: Перенаправление на экран назначения смен для {staffName}...
tr: {staffName} için vardiya atama ekranına yönlendiriliyorsunuz...
zh: 正在重定向到 {staffName} 的班次分配屏幕...

# setupStaffShiftAssigned
source: Shift assigned.
ar: تم تعيين المناوبة.
de: Schicht zugewiesen.
es: Turno asignado.
fr: Quart assigné.
it: Turno assegnato.
ru: Смена назначена.
tr: Vardiya atandı.
zh: 班次已分配。

# setupStaffShiftNotAssigned
source: Shift not assigned! You must assign a shift to continue.
ar: لم يتم تعيين المناوبة! يجب عليك تعيين مناوبة للمتابعة.
de: Schicht nicht zugewiesen! Sie müssen eine Schicht zuweisen, um fortzufahren.
es: ¡Turno no asignado! Debes asignar un turno para continuar.
fr: Quart non assigné ! Vous devez assigner un quart pour continuer.
it: Turno non assegnato! Devi assegnare un turno per continuare.
ru: Смена не назначена! Вы должны назначить смену, чтобы продолжить.
tr: Vardiya atanmadı! Devam etmek için atama yapmalısınız.
zh: 班次未分配！您必须分配一个班次才能继续。

# scheduleSetupWizardPrompt
source: Please assign at least one shift to the new staff member to continue.
ar: الرجاء تعيين مناوبة واحدة على الأقل للموظف الجديد للمتابعة.
de: Bitte weisen Sie dem neuen Personalmitglied mindestens eine Schicht zu, um fortzufahren.
es: Por favor, asigna al menos un turno al nuevo miembro del personal para continuar.
fr: Veuillez assigner au moins un quart au nouveau membre du personnel pour continuer.
it: Per favore, assegna almeno un turno al nuovo membro staff per continuare.
ru: Пожалуйста, назначьте хотя бы одну смену новому сотруднику, чтобы продолжить.
tr: Devam etmek için lütfen yeni personele en az bir vardiya atayın.
zh: 请为新员工分配至少一个班次以继续。

# homeSectionOrderKitchen
source: Order & Kitchen Management
ar: إدارة الطلبات والمطبخ
de: Bestell- & Küchenverwaltung
es: Gestión de Pedidos y Cocina
fr: Gestion des Commandes et de la Cuisine
it: Gestione Ordini e Cucina
ru: Управление заказами и кухней
tr: Sipariş & Mutfak Yönetimi
zh: 订单和厨房管理

# homeSectionMenuStock
source: Menu & Stock Management
ar: إدارة القائمة والمخزون
de: Menü- & Lagerverwaltung
es: Gestión de Menú y Stock
fr: Gestion du Menu et des Stocks
it: Gestione Menù e Magazzino
ru: Управление меню и запасами
tr: Menü & Stok Yönetimi
zh: 菜单和库存管理

# homeSectionBusinessManagement
source: Business Management
ar: إدارة الأعمال
de: Geschäftsverwaltung
es: Gestión del Negocio
fr: Gestion de l'Entreprise
it: Gestione Attività
ru: Управление бизнесом
tr: İşletme Yönetimi
zh: 商家管理

# homeSectionReports
source: Reports & Analytics
ar: التقارير والتحليلات
de: Berichte & Analysen
es: Informes y Análisis
fr: Rapports et Analyses
it: Report e Analisi
ru: Отчеты и аналитика
tr: Raporlar & Analiz
zh: 报告和分析

# homeSectionSettings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Paramètres
it: Impostazioni
ru: Настройки
tr: Ayarlar
zh: 设置

# searchPlaceholder
source: Search Menu...
ar: البحث في القائمة...
de: Menü durchsuchen...
es: Buscar en el Menú...
fr: Rechercher dans le Menu...
it: Cerca nel Menù...
ru: Поиск по меню...
tr: Menüde Ara...
zh: 搜索菜单...

# searchNoResults
source: No search results found.
ar: لم يتم العثور على نتائج بحث.
de: Keine Suchergebnisse gefunden.
es: No se encontraron resultados de búsqueda.
fr: Aucun résultat de recherche trouvé.
it: Nessun risultato di ricerca trovato.
ru: Результаты поиска не найдены.
tr: Arama sonucu bulunamadı.
zh: 未找到搜索结果。

# loginErrorNoShiftScheduled
source: You cannot log in as you do not have a shift scheduled for today.
ar: لا يمكنك تسجيل الدخول لأنه ليس لديك مناوبة مجدولة لهذا اليوم.
de: Sie können sich nicht anmelden, da für heute keine Schicht für Sie geplant ist.
es: No puedes iniciar sesión ya que no tienes un turno programado para hoy.
fr: Vous ne pouvez pas vous connecter car vous n'avez pas de quart prévu pour aujourd'hui.
it: Non puoi accedere in quanto non hai un turno programmato per oggi.
ru: Вы не можете войти, так как у вас нет запланированной смены на сегодня.
tr: Bugün için planlanmış bir vardiyanız bulunmadığından giriş yapamazsınız.
zh: 您没有安排今天的班次，无法登录。

# loginErrorNoActiveShift
source: You do not have an active shift right now. Please try again during your shift hours.
ar: ليس لديك مناوبة نشطة الآن. يرجى المحاولة مرة أخرى خلال ساعات مناوبتك.
de: Sie haben im Moment keine aktive Schicht. Bitte versuchen Sie es während Ihrer Schichtzeiten erneut.
es: No tienes un turno activo en este momento. Por favor, inténtalo de nuevo durante las horas de tu turno.
fr: Vous n'avez pas de quart actif en ce moment. Veuillez réessayer pendant vos heures de quart.
it: Non hai un turno attivo in questo momento. Per favore, riprova durante l'orario del tuo turno.
ru: У вас нет активной смены прямо сейчас. Пожалуйста, попробуйте снова в часы вашей смены.
tr: Şu an aktif bir çalışma vardiyanız bulunmuyor. Lütfen vardiya saatleriniz içinde tekrar deneyin.
zh: 您目前没有活跃班次。请在您的班次时间重试。

# loginErrorNetwork
source: Could not establish an internet connection. Please check your network settings.
ar: تعذر إنشاء اتصال بالإنترنت. يرجى التحقق من إعدادات الشبكة.
de: Es konnte keine Internetverbindung hergestellt werden. Bitte überprüfen Sie Ihre Netzwerkeinstellungen.
es: No se pudo establecer una conexión a internet. Por favor, comprueba tus ajustes de red.
fr: Impossible d'établir une connexion Internet. Veuillez vérifier vos paramètres réseau.
it: Impossibile stabilire una connessione internet. Per favore, controlla le impostazioni di rete.
ru: Не удалось установить интернет-соединение. Пожалуйста, проверьте настройки сети.
tr: İnternet bağlantısı kurulamadı. Lütfen ağ ayarlarınızı kontrol edin.
zh: 无法建立互联网连接。请检查您的网络设置。

# loginErrorGeneric
source: An unexpected error occurred during login. Please try again.
ar: حدث خطأ غير متوقع أثناء تسجيل الدخول. يرجى المحاولة مرة أخرى.
de: Während der Anmeldung ist ein unerwarteter Fehler aufgetreten. Bitte versuchen Sie es erneut.
es: Ocurrió un error inesperado durante el inicio de sesión. Por favor, inténtalo de nuevo.
fr: Une erreur inattendue s'est produite lors de la connexion. Veuillez réessayer.
it: Si è verificato un errore inatteso durante l'accesso. Per favore, riprova.
ru: Произошла непредвиденная ошибка при входе в систему. Пожалуйста, попробуйте снова.
tr: Giriş sırasında beklenmedik bir hata oluştu. Lütfen tekrar deneyin.
zh: 登录时发生意外错误。请重试。

# businessSettingsTimezoneLabel
source: Business Timezone
ar: المنطقة الزمنية للعمل
de: Geschäfts-Zeitzone
es: Zona Horaria del Negocio
fr: Fuseau Horaire de l'Entreprise
it: Fuso Orario Attività
ru: Часовой пояс бизнеса
tr: İşletme Zaman Dilimi
zh: 商家时区

# businessSettingsTimezoneValidator
source: Please select a timezone.
ar: الرجاء تحديد منطقة زمنية.
de: Bitte wählen Sie eine Zeitzone aus.
es: Por favor, selecciona una zona horaria.
fr: Veuillez sélectionner un fuseau horaire.
it: Per favore, seleziona un fuso orario.
ru: Пожалуйста, выберите часовой пояс.
tr: Lütfen bir zaman dilimi seçin.
zh: 请选择一个时区。

# businessSettingsErrorLoading
source: Error loading business information: {error}
ar: خطأ في تحميل معلومات العمل: {error}
de: Fehler beim Laden der Geschäftsinformationen: {error}
es: Error al cargar información del negocio: {error}
fr: Erreur lors du chargement des informations de l'entreprise : {error}
it: Errore caricamento informazioni attività: {error}
ru: Ошибка загрузки информации о бизнесе: {error}
tr: İşletme bilgileri yüklenirken hata oluştu: {error}
zh: 加载商家信息错误: {error}

source: Voice Guide Active
ar: الدليل الصوتي نشط
de: Sprachführung aktiv
es: Guía de Voz Activa
fr: Guide Vocal Actif
it: Guida Vocale Attiva
ru: Голосовое сопровождение активно
tr: Sesli Rehber Aktif
zh: 语音指南已激活

# tooltipUnmute
source: Unmute
ar: إلغاء كتم الصوت
de: Stummschaltung aufheben
es: Activar Sonido
fr: Activer le Son
it: Riattiva Audio
ru: Включить звук
tr: Sesi Aç
zh: 取消静音

# tooltipMute
source: Mute
ar: كتم الصوت
de: Stummschalten
es: Silenciar
fr: Désactiver le Son
it: Silenzia
ru: Выключить звук
tr: Sesi Kapat
zh: 静音

# tooltipReplayGuide
source: Replay Guide
ar: إعادة تشغيل الدليل
de: Anleitung wiederholen
es: Repetir Guía
fr: Rejouer le Guide
it: Ripeti Guida
ru: Повторить сопровождение
tr: Rehberi Tekrar Çal
zh: 重播指南

# languageNameTr
source: Turkish
ar: التركية
de: Türkçe
es: Turco
fr: Turc
it: Turco
ru: Турецкий
tr: Türkçe
zh: Türkçe

# languageNameEn
source: English
ar: الإنجليزية
es: Inglés
fr: Anglais
it: Inglese
ru: Английский

# languageNameDe
source: German
ar: الألمانية
de: Deutsch
es: Alemán
fr: Allemand
it: Tedesco
ru: Немецкий
tr: Deutsch
zh: Deutsch

# languageNameEs
source: Spanish
ar: الإسبانية
de: Español
es: Español
fr: Espagnol
it: Spagnolo
ru: Испанский
tr: Español
zh: Español

# languageNameAr
source: Arabic
ar: العربية
de: العربية
es: Árabe
fr: Arabe
it: Arabo
ru: Арабский
tr: العربية
zh: العربية

# languageNameIt
source: Italian
ar: الإيطالية
de: Italiano
es: Italiano
fr: Italien
it: Italiano
ru: Итальянский
tr: Italiano
zh: Italiano

# languageNameZh
source: Chinese
ar: الصينية
de: 中文
es: Chino
fr: Chinois
it: Cinese
ru: Китайский
tr: 中文
zh: 中文

# languageNameRu
source: Russian
ar: الروسية
de: Русский
es: Ruso
fr: Russe
it: Russo
ru: Русский
tr: Русский
zh: Русский

# languageNameFr
source: French
ar: الفرنسية
de: Français
es: Francés
fr: Français
it: Francese
ru: Французский
tr: Français
zh: Français

# currencyNameTRY
source: Turkish Lira (₺)
ar: الليرة التركية (ل.ت)
de: Türkische Lira (₺)
es: Lira Turca (₺)
fr: Livre Turque (₺)
it: Lira Turca (₺)
ru: Турецкая лира (₺)
tr: Türk Lirası (₺)
zh: 土耳其里拉 (₺)

# currencyNameUSD
source: US Dollar ($)
ar: الدولار الأمريكي ($)
es: Dólar Estadounidense ($)
fr: Dollar Américain ($)
it: Dollaro USA ($)
ru: Доллар США ($)
tr: ABD Doları ($)
zh: 美元 ($)

# currencyNameEUR
source: Euro (€)
ar: اليورو (€)
ru: Евро (€)
zh: 欧元 (€)

# currencyNameGBP
source: British Pound (£)
ar: الجنيه الإسترليني (£)
de: Britisches Pfund (£)
es: Libra Esterlina (£)
fr: Livre Sterling (£)
it: Sterlina Britannica (£)
ru: Британский фунт (£)
tr: İngiliz Sterlini (£)
zh: 英镑 (£)

# timeZoneNameIstanbul
source: (GMT+3) Istanbul
ar: (GMT+3) اسطنبول
de: Istanbul (GMT+3)
es: Estambul (GMT+3)
fr: Istanbul (GMT+3)
ru: (GMT+3) Стамбул
tr: İstanbul (GMT+3)
zh: 伊斯坦布尔 (GMT+3)

# timeZoneNameLondon
source: (GMT+0) London
ar: (GMT+0) لندن
de: London (GMT+0)
es: Londres (GMT+0)
fr: Londres (GMT+0)
it: (GMT+0) Londra
ru: (GMT+0) Лондон
tr: Londra (GMT+0)
zh: 伦敦 (GMT+0)

# timeZoneNameBerlin
source: (GMT+1) Berlin
ar: (GMT+1) برلين
de: Berlin (GMT+1)
es: Berlín (GMT+1)
fr: Berlin (GMT+1)
it: (GMT+1) Berlino
ru: (GMT+1) Берлин
tr: Berlin (GMT+1)
zh: 柏林 (GMT+1)

# timeZoneNameNewYork
source: (GMT-5) New York
ar: (GMT-5) نيويورك
de: New York (GMT-5)
es: Nueva York (GMT-5)
fr: New York (GMT-5)
ru: (GMT-5) Нью-Йорк
tr: New York (GMT-5)
zh: 纽约 (GMT-5)

# timeZoneNameDubai
source: (GMT+4) Dubai
ar: (GMT+4) دبي
de: Dubai (GMT+4)
es: Dubái (GMT+4)
fr: Dubaï (GMT+4)
ru: (GMT+4) Дубай
tr: Dubai (GMT+4)
zh: 迪拜 (GMT+4)

# timeZoneNameTokyo
source: (GMT+9) Tokyo
ar: (GMT+9) طوكيو
de: Tokio (GMT+9)
es: Tokio (GMT+9)
fr: Tokyo (GMT+9)
ru: (GMT+9) Токио
tr: Tokyo (GMT+9)
zh: 东京 (GMT+9)

# setupCategoriesQuickStartTitle
source: Quick Start
ar: البدء السريع
de: Schnellstart
es: Inicio Rápido
fr: Démarrage Rapide
it: Avvio Rapido
ru: Быстрый старт
tr: Hızlı Başlangıç
zh: 快速开始

# setupCategoriesQuickStartDescription
source: Get started quickly by creating categories from ready-made templates!
ar: ابدأ بسرعة عن طريق إنشاء فئات من القوالب الجاهزة!
de: Starten Sie schnell, indem Sie Kategorien aus vorgefertigten Vorlagen erstellen!
es: ¡Empieza rápidamente creando categorías a partir de plantillas predefinidas!
fr: Commencez rapidement en créant des catégories à partir de modèles prêts à l'emploi !
it: Inizia rapidamente creando categorie da modelli pronti all'uso!
ru: Начните быстро, создав категории из готовых шаблонов!
tr: Hazır şablonlardan kategori oluşturarak hızlıca başlayın!
zh: 通过创建现成的模板类别快速入门！

# setupCategoriesSuccessFromTemplate
source: Categories were successfully created from the template!
ar: تم إنشاء الفئات بنجاح من القالب!
de: Kategorien wurden erfolgreich aus der Vorlage erstellt!
es: ¡Las categorías fueron creadas con éxito a partir de la plantilla!
fr: Catégories créées avec succès à partir du modèle !
it: Categorie create con successo dal modello!
ru: Категории успешно созданы из шаблона!
tr: Kategoriler şablondan başarıyla oluşturuldu!
zh: 类别已成功从模板创建！

# setupCategoriesErrorFromTemplate
source: Error creating categories from template: {errorDetails}
ar: خطأ في إنشاء الفئات من القالب: {errorDetails}
de: Fehler beim Erstellen der Kategorien aus der Vorlage: {errorDetails}
es: Error al crear categorías a partir de la plantilla: {errorDetails}
fr: Erreur lors de la création des catégories à partir du modèle : {errorDetails}
it: Errore durante la creazione delle categorie dal modello: {errorDetails}
ru: Ошибка создания категорий из шаблона: {errorDetails}
tr: Şablondan kategori oluşturulurken hata: {errorDetails}
zh: 从模板创建类别错误: {errorDetails}
