Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# passwordResetConfirmCodeValidator
source: Please enter the reset code.
ar: الرجاء إدخال رمز إعادة التعيين.
de: Bitte geben Sie den Rücksetzungscode ein.
es: Por favor, introduce el código de restablecimiento.
fr: Veuillez saisir le code de réinitialisation.
it: Per favore, inserisci il codice di reset.
ru: Пожалуйста, введите код сброса.
tr: Lütfen sıfırlama kodunu girin.
zh: 请输入重置代码。

# passwordResetConfirmCodeLengthValidator
source: The code must be 6 digits long.
ar: يجب أن يتكون الرمز من 6 أرقام.
de: Der Code muss 6 Ziffern lang sein.
es: El código debe tener 6 dígitos.
fr: Le code doit comporter 6 chiffres.
it: Il codice deve essere lungo 6 cifre.
ru: Код должен состоять из 6 цифр.
tr: Kod 6 haneli olmalıdır.
zh: 代码必须是6位数字。

# passwordResetConfirmResetButton
source: Reset Password
ar: إعادة تعيين كلمة المرور
de: Passwort zurücksetzen
es: Restablecer Contraseña
fr: Réinitialiser le mot de passe
it: Reimposta Password
ru: Сбросить пароль
tr: Şifreyi Sıfırla
zh: 重置密码

# createCategoryScreenTitle
source: Create Product Category
ar: إنشاء فئة منتج
de: Produktkategorie erstellen
es: Crear Categoría de Producto
fr: Créer une Catégorie de Produit
it: Crea Categoria Prodotto
ru: Создать категорию продукта
tr: Ürün Kategorisi Oluştur
zh: 创建产品类别

# createCategoryErrorLoadingParents
source: Error loading parent categories: {error}
ar: خطأ في تحميل الفئات الرئيسية: {error}
de: Fehler beim Laden der übergeordneten Kategorien: {error}
es: Error al cargar categorías padre: {error}
fr: Erreur lors du chargement des catégories parentes : {error}
it: Errore caricamento categorie genitore: {error}
ru: Ошибка загрузки родительских категорий: {error}
tr: Üst kategoriler yüklenirken hata: {error}
zh: 加载父类别时出错: {error}

# createCategoryPhotoNotSelected
source: Photo not selected.
ar: لم يتم تحديد صورة.
de: Foto nicht ausgewählt.
es: Foto no seleccionada.
fr: Photo non sélectionnée.
it: Foto non selezionata.
ru: Фото не выбрано.
tr: Fotoğraf seçilmedi.
zh: 未选择照片。

# createCategorySuccess
source: Category created successfully!
ar: تم إنشاء الفئة بنجاح!
de: Kategorie erfolgreich erstellt!
es: ¡Categoría creada con éxito!
fr: Catégorie créée avec succès !
it: Categoria creata con successo!
ru: Категория успешно создана!
tr: Kategori başarıyla oluşturuldu!
zh: 类别创建成功！

# createCategoryError
source: Error creating category: {statusCode} - {details}
ar: خطأ في إنشاء الفئة: {statusCode} - {details}
de: Fehler beim Erstellen der Kategorie: {statusCode} - {details}
es: Error al crear categoría: {statusCode} - {details}
fr: Erreur lors de la création de la catégorie : {statusCode} - {details}
it: Errore creazione categoria: {statusCode} - {details}
ru: Ошибка создания категории: {statusCode} - {details}
tr: Kategori oluşturulurken hata: {statusCode} - {details}
zh: 创建类别时出错: {statusCode} - {details}

# createCategoryButton
source: Create Category
ar: إنشاء فئة
de: Kategorie erstellen
es: Crear Categoría
fr: Créer la Catégorie
it: Crea Categoria
ru: Создать категорию
tr: Kategori Oluştur
zh: 创建类别

# stockHistoryScreenTitle
source: {variantName} - Stock History
ar: {variantName} - سجل المخزون
de: {variantName} - Lagerverlauf
es: {variantName} - Historial de Stock
fr: {variantName} - Historique des Stocks
it: {variantName} - Storico Magazzino
ru: {variantName} - История запасов
tr: {variantName} - Stok Geçmişi
zh: {variantName} - 库存历史记录

# stockHistoryFiltersTitle
source: Filters:
ar: الفلاتر:
de: Filter:
es: Filtros:
fr: Filtres :
it: Filtri:
ru: Фильтры:
tr: Filtreler:
zh: 筛选器:

# stockHistorySelectDateRange
source: Select Date Range
ar: تحديد نطاق التاريخ
de: Datumsbereich auswählen
es: Seleccionar Rango de Fechas
fr: Sélectionner la Plage de Dates
it: Seleziona Intervallo Date
ru: Выбрать диапазон дат
tr: Tarih Aralığı Seç
zh: 选择日期范围

# stockHistoryMovementTypeLabel
source: Movement Type
ar: نوع الحركة
de: Bewegungsart
es: Tipo de Movimiento
fr: Type de Mouvement
it: Tipo di Movimento
ru: Тип движения
tr: Hareket Tipi
zh: 变动类型

# stockHistoryMovementTypeAll
source: All
ar: الكل
de: Alle
es: Todos
fr: Tout
it: Tutti
ru: Все
tr: Tümü
zh: 全部

# stockHistoryMovementTypeInitial
source: Initial Stock
ar: المخزون الأولي
de: Anfangsbestand
es: Stock Inicial
fr: Stock Initial
it: Scorta Iniziale
ru: Начальный запас
tr: Başlangıç Stoku
zh: 初始库存

# stockHistoryMovementTypeSale
source: Sale
ar: بيع
de: Verkauf
es: Venta
fr: Vente
it: Vendita
ru: Продажа
tr: Satış
zh: 销售

# stockHistoryMovementTypeReturn
source: Customer Return
ar: إرجاع من العميل
de: Kundenrückgabe
es: Devolución de Cliente
fr: Retour Client
it: Reso Cliente
ru: Возврат от клиента
tr: Müşteri İadesi
zh: 顾客退货

# stockHistoryMovementTypeAdjIn
source: Count Adjustment (Surplus)
ar: تعديل العد (فائض)
de: Bestandsanpassung (Überschuss)
es: Ajuste de Cuenta (Excedente)
fr: Ajustement de Compte (Excédent)
it: Regolazione Conteggio (Eccedenza)
ru: Корректировка количества (Излишек)
tr: Sayım Düzeltme (Fazla)
zh: 数量调整 (盈余)

# stockHistoryMovementTypeAdjOut
source: Count Adjustment (Deficit)
ar: تعديل العد (عجز)
de: Bestandsanpassung (Defizit)
es: Ajuste de Cuenta (Déficit)
fr: Ajustement de Compte (Déficit)
it: Regolazione Conteggio (Deficit)
ru: Корректировка количества (Дефицит)
tr: Sayım Düzeltme (Eksik)
zh: 数量调整 (亏损)

# stockHistoryMovementTypeWastage
source: Wastage/Loss
ar: هدر/خسارة
de: Ausschuss/Verlust
es: Desperdicio/Pérdida
fr: Déchet/Perte
it: Spreco/Perdita
ru: Расход/Потеря
tr: Zayiat/Fire
zh: 损耗/损失

# stockHistoryMovementTypeManual
source: Manual Adjustment
ar: تعديل يدوي
de: Manuelle Anpassung
es: Ajuste Manual
fr: Ajustement Manuel
it: Regolazione Manuale
ru: Ручная корректировка
tr: Manuel Düzenleme
zh: 手动调整

# stockHistoryNoMovements
source: No stock movements were found.
ar: لم يتم العثور على حركات مخزون.
de: Es wurden keine Lagerbewegungen gefunden.
es: No se encontraron movimientos de stock.
fr: Aucun mouvement de stock n'a été trouvé.
it: Nessun movimento di magazzino trovato.
ru: Движений запасов не найдено.
tr: Stok hareketi bulunamadı.
zh: 未找到库存变动记录。

# stockHistoryQuantityChange
source: Before: {before} → After: {after}
ar: قبل: {before} ← بعد: {after}
de: Vorher: {before} → Nachher: {after}
es: Antes: {before} → Después: {after}
fr: Avant : {before} → Après : {after}
it: Prima: {before} → Dopo: {after}
ru: До: {before} → После: {after}
tr: Önce: {before} → Sonra: {after}
zh: 之前: {before} → 之后: {after}

# stockHistoryDateLabel
source: Date: {date}
ar: التاريخ: {date}
de: Datum: {date}
es: Fecha: {date}
it: Data: {date}
ru: Дата: {date}
tr: Tarih: {date}
zh: 日期: {date}

# stockHistoryUserLabel
source: User: {username}
ar: المستخدم: {username}
de: Benutzer: {username}
es: Usuario: {username}
fr: Utilisateur : {username}
it: Utente: {username}
ru: Пользователь: {username}
tr: Kullanıcı: {username}
zh: 用户: {username}

# stockHistoryDescriptionLabel
source: Description: {description}
ar: الوصف: {description}
de: Beschreibung: {description}
es: Descripción: {description}
it: Descrizione: {description}
ru: Описание: {description}
tr: Açıklama: {description}
zh: 描述: {description}

# stockHistoryRelatedOrderLabel
source: Related Order: #{orderId}
ar: الطلب المرتبط: #{orderId}
de: Zugehörige Bestellung: #{orderId}
es: Pedido Relacionado: #{orderId}
fr: Commande Associée : #{orderId}
it: Ordine Correlato: #{orderId}
ru: Связанный заказ: #{orderId}
tr: İlişkili Sipariş: #{orderId}
zh: 相关订单: #{orderId}

# manageVariantListScreenTitle
source: Menu Item Variants
ar: متغيرات عنصر القائمة
de: Menüpunkt-Varianten
es: Variantes de Artículo de Menú
fr: Variantes d'Élément de Menu
it: Varianti Elemento Menù
ru: Варианты пункта меню
tr: Menü Ürün Varyantları
zh: 菜单项变体

# manageVariantListItemId
source: ID: {id}
ar: المعرف: {id}

# manageVariantListErrorLoading
source: An error occurred while loading menu items.
ar: حدث خطأ أثناء تحميل عناصر القائمة.
de: Beim Laden der Menüpunkte ist ein Fehler aufgetreten.
es: Ocurrió un error al cargar artículos de menú.
fr: Une erreur s'est produite lors du chargement des éléments de menu.
it: Si è verificato un errore durante il caricamento degli elementi del menù.
ru: Произошла ошибка при загрузке пунктов меню.
tr: Menü öğeleri yüklenirken bir hata oluştu.
zh: 加载菜单项时发生错误。

# pagerAssignmentScreenTitle
source: Select Idle Pager
ar: تحديد جهاز نداء خامل
de: Freien Pager auswählen
es: Seleccionar Localizador Inactivo
fr: Sélectionner un Biper Inactif
it: Seleziona Pager Inattivo
ru: Выбрать свободный пейджер
tr: Boşta Çağrı Cihazı Seç
zh: 选择空闲传呼机

# pagerAssignmentTooltipRefresh
source: Refresh List
ar: تحديث القائمة
de: Liste aktualisieren
es: Actualizar Lista
fr: Actualiser la Liste
it: Aggiorna Elenco
ru: Обновить список
tr: Listeyi Yenile
zh: 刷新列表

# pagerAssignmentErrorNoAvailable
source: No suitable idle pagers are currently available.
ar: لا تتوفر حاليًا أجهزة نداء خاملة مناسبة.
de: Derzeit sind keine geeigneten freien Pager verfügbar.
es: No hay localizadores inactivos adecuados disponibles actualmente.
fr: Aucun biper inactif approprié n'est actuellement disponible.
it: Nessun pager inattivo idoneo è attualmente disponibile.
ru: В настоящее время нет подходящих свободных пейджеров.
tr: Şu anda boşta uygun çağrı cihazı bulunmuyor.
zh: 当前没有可用的合适空闲传呼机。

# pagerAssignmentErrorNoRegistered
source: No pagers are registered in the system.
ar: لم يتم تسجيل أجهزة نداء في النظام.
de: Es sind keine Pager im System registriert.
es: No hay localizadores registrados en el sistema.
fr: Aucun biper n'est enregistré dans le système.
it: Nessun pager è registrato nel sistema.
ru: В системе не зарегистрировано пейджеров.
tr: Sisteme kayıtlı çağrı cihazı bulunmuyor.
zh: 系统中未注册传呼机。

# pagerAssignmentErrorFetch
source: Error fetching idle pagers: {error}
ar: خطأ في جلب أجهزة النداء الخاملة: {error}
de: Fehler beim Abrufen der freien Pager: {error}
es: Error al obtener localizadores inactivos: {error}
fr: Erreur lors de la récupération des bipers inactifs : {error}
it: Errore recupero pager inattivi: {error}
ru: Ошибка получения свободных пейджеров: {error}
tr: Boşta çağrı cihazları getirilirken hata: {error}
zh: 获取空闲传呼机错误: {error}

# pagerAssignmentDefaultError
source: No idle pagers are available to assign.
ar: لا تتوفر أجهزة نداء خاملة لتعيينها.
de: Es sind keine freien Pager zur Zuweisung verfügbar.
es: No hay localizadores inactivos disponibles para asignar.
fr: Aucun biper inactif n'est disponible pour l'assignation.
it: Nessun pager inattivo è disponibile per l'assegnazione.
ru: Нет свободных пейджеров для назначения.
tr: Atanabilecek boşta çağrı cihazı bulunmuyor.
zh: 没有可分配的空闲传呼机。

# pagerAssignmentStatusLabel
source: Status: {status}
ar: الحالة: {status}
es: Estado: {status}
fr: Statut : {status}
it: Stato: {status}
ru: Статус: {status}
tr: Durum: {status}
zh: 状态: {status}

# paymentProcessingScreenTitle
source: Payment Process
ar: عملية الدفع
de: Zahlungsvorgang
es: Proceso de Pago
fr: Processus de Paiement
it: Processo di Pagamento
ru: Процесс оплаты
tr: Ödeme İşlemi
zh: 支付流程

# paymentProcessingTableLabel
source: Table: {tableNumber}
ar: الطاولة: {tableNumber}
de: Tisch: {tableNumber}
es: Mesa: {tableNumber}
it: Tavolo: {tableNumber}
ru: Стол: {tableNumber}
tr: Masa: {tableNumber}
zh: 桌位: {tableNumber}

# paymentProcessingSelectTypeLabel
source: Select Payment Type:
ar: تحديد نوع الدفع:
de: Zahlungsart auswählen:
es: Seleccionar Tipo de Pago:
fr: Sélectionner le Type de Paiement :
it: Seleziona Tipo di Pagamento:
ru: Выбрать тип оплаты:
tr: Ödeme Türünü Seçin:
zh: 选择支付类型:

# paymentProcessingSuccess
source: Payment completed successfully!
ar: تم الدفع بنجاح!
de: Zahlung erfolgreich abgeschlossen!
es: ¡Pago completado con éxito!
fr: Paiement effectué avec succès !
it: Pagamento completato con successo!
ru: Оплата успешно завершена!
tr: Ödeme başarıyla tamamlandı!
zh: 支付成功完成！

# paymentProcessingError
source: An error occurred while completing the payment.
ar: حدث خطأ أثناء إكمال الدفع.
de: Beim Abschließen der Zahlung ist ein Fehler aufgetreten.
es: Ocurrió un error al completar el pago.
fr: Une erreur s'est produite lors de la finalisation du paiement.
it: Si è verificato un errore durante il completamento del pagamento.
ru: Произошла ошибка при завершении оплаты.
tr: Ödeme tamamlanırken bir hata oluştu.
zh: 完成支付时发生错误。

# setupCategoriesErrorSelectKds
source: Please select a kitchen screen for the category to be displayed on.
ar: الرجاء تحديد شاشة المطبخ التي ستعرض عليها الفئة.
de: Bitte wählen Sie einen Küchenbildschirm aus, auf dem die Kategorie angezeigt werden soll.
es: Por favor, selecciona una pantalla de cocina en la que se mostrará la categoría.
fr: Veuillez sélectionner un écran de cuisine sur lequel la catégorie doit être affichée.
it: Per favore, seleziona uno schermo cucina su cui verrà visualizzata la categoria.
ru: Пожалуйста, выберите экран кухни, на котором будет отображаться категория.
tr: Lütfen kategorinin görüntüleneceği bir mutfak ekranı seçin.
zh: 请为类别选择一个要在其上显示的厨房屏幕。

# setupCategoriesSuccessAdded
source: Category "{categoryName}" added successfully.
ar: تمت إضافة الفئة "{categoryName}" بنجاح.
de: Kategorie "{categoryName}" erfolgreich hinzugefügt.
es: Categoría "{categoryName}" añadida con éxito.
fr: Catégorie "{categoryName}" ajoutée avec succès.
it: Categoria "{categoryName}" aggiunta con successo.
ru: Категория «{categoryName}» успешно добавлена.
tr: "{categoryName}" kategorisi başarıyla eklendi.
zh: 类别“{categoryName}”添加成功。

# setupCategoriesDeleteDialogContent
source: Are you sure you want to delete the '{categoryName}' category and (if any) all its subcategories? This action will remove the product links from the category.
ar: هل أنت متأكد أنك تريد حذف فئة '{categoryName}' و (إن وجدت) جميع فئاتها الفرعية؟ سيؤدي هذا الإجراء إلى إزالة روابط المنتج من الفئة.
de: Sind Sie sicher, dass Sie die Kategorie '{categoryName}' und (falls vorhanden) alle ihre Unterkategorien löschen möchten? Diese Aktion entfernt die Produktverknüpfungen aus der Kategorie.
es: ¿Estás seguro de que quieres eliminar la categoría '{categoryName}' y (si las hay) todas sus subcategorías? Esta acción eliminará los enlaces de producto de la categoría.
fr: Êtes-vous sûr de vouloir supprimer la catégorie '{categoryName}' et (le cas échéant) toutes ses sous-catégories ? Cette action supprimera les liens des produits de la catégorie.
it: Sei sicuro di voler eliminare la categoria '{categoryName}' e (se presenti) tutte le sue sottocategorie? Questa azione rimuoverà i collegamenti ai prodotti dalla categoria.
ru: Вы уверены, что хотите удалить категорию «{categoryName}» и (если есть) все ее подкатегории? Это действие удалит ссылки на продукты из категории.
tr: '{categoryName}' kategorisini ve (varsa) tüm alt kategorilerini silmek istediğinizden emin misiniz? Bu işlem, ürünlerin kategori bağlantısını kaldıracaktır.
zh: 您确定要删除“{categoryName}”类别及其（如果存在）所有子类别吗？此操作将移除类别中的产品链接。

# setupCategoriesInfoDeleted
source: The '{categoryName}' category was deleted.
ar: تم حذف فئة '{categoryName}'.
de: Die Kategorie '{categoryName}' wurde gelöscht.
es: La categoría '{categoryName}' fue eliminada.
fr: La catégorie '{categoryName}' a été supprimée.
it: La categoria '{categoryName}' è stata eliminata.
ru: Категория «{categoryName}» удалена.
tr: '{categoryName}' kategorisi silindi.
zh: “{categoryName}”类别已删除。

# setupCategoriesErrorDeleting
source: Error deleting category: {error}
ar: خطأ في حذف الفئة: {error}
de: Fehler beim Löschen der Kategorie: {error}
es: Error al eliminar categoría: {error}
fr: Erreur lors de la suppression de la catégorie : {error}
it: Errore eliminazione categoria: {error}
ru: Ошибка удаления категории: {error}
tr: Kategori silinirken hata: {error}
zh: 删除类别错误: {error}

# setupCategoriesDescription
source: Organize your menu by categorizing your orders and products.
ar: نظّم قائمتك عن طريق تصنيف طلباتك ومنتجاتك.
de: Organisieren Sie Ihr Menü, indem Sie Ihre Bestellungen und Produkte kategorisieren.
es: Organiza tu menú categorizando tus pedidos y productos.
fr: Organisez votre menu en catégorisant vos commandes et produits.
it: Organizza il tuo menù categorizzando i tuoi ordini e prodotti.
ru: Организуйте ваше меню, категоризируя ваши заказы и продукты.
tr: Siparişlerinizi ve ürünlerinizi kategorilere ayırarak menünüzü düzenleyin.
zh: 通过对订单和产品进行分类来组织您的菜单。

# setupCategoriesMainCategory
source: Main Category
ar: الفئة الرئيسية
de: Hauptkategorie
es: Categoría Principal
fr: Catégorie Principale
it: Categoria Principale
ru: Основная категория
tr: Ana Kategori
zh: 主类别

# setupCategoriesKdsLoading
source: Loading KDS Screens...
ar: جاري تحميل شاشات KDS...
de: KDS-Bildschirme werden geladen...
es: Cargando Pantallas KDS...
fr: Chargement des Écrans KDS...
it: Caricamento Schermi KDS...
ru: Загрузка экранов KDS...
tr: KDS Ekranları yükleniyor...
zh: 正在加载 KDS 屏幕...

# setupCategoriesErrorDefineKdsFirst
source: First, you must define a screen from Settings > KDS Screens.
ar: أولاً، يجب عليك تعريف شاشة من الإعدادات > شاشات KDS.
de: Zuerst müssen Sie einen Bildschirm unter Einstellungen > KDS-Bildschirme definieren.
es: Primero, debes definir una pantalla desde Ajustes > Pantallas KDS.
fr: Vous devez d'abord définir un écran dans Paramètres > Écrans KDS.
it: Devi prima definire uno schermo in Impostazioni > Schermi KDS.
ru: Сначала вы должны определить экран в Настройках > Экраны KDS.
tr: Önce Ayarlar > KDS Ekranları bölümünden bir ekran tanımlamalısınız.
zh: 首先，您必须在 设置 > KDS 屏幕 中定义一个屏幕。

# setupCategoriesLabelDisplayKds
source: Kitchen Display Screen to Show On
ar: شاشة عرض المطبخ التي ستعرض عليها
de: Küchenanzeigebildschirm, auf dem angezeigt werden soll
es: Pantalla de Visualización de Cocina para Mostrar
fr: Écran d'Affichage de Cuisine sur lequel Afficher
it: Schermo Cucina su cui Mostrare
ru: Экран кухонного дисплея для отображения
tr: Görüntüleneceği Mutfak Ekranı
zh: 要在其上显示的厨房显示屏幕

# setupCategoriesHintSelectKds
source: Select a kitchen screen
ar: حدد شاشة مطبخ
de: Einen Küchenbildschirm auswählen
es: Selecciona una pantalla de cocina
fr: Sélectionner un écran de cuisine
it: Seleziona uno schermo cucina
ru: Выбрать экран кухни
tr: Bir mutfak ekranı seçin
zh: 选择一个厨房屏幕

# setupCategoriesValidatorSelectKds
source: Please select a kitchen screen.
ar: الرجاء تحديد شاشة مطبخ.
de: Bitte wählen Sie einen Küchenbildschirm aus.
es: Por favor, selecciona una pantalla de cocina.
fr: Veuillez sélectionner un écran de cuisine.
it: Per favore, seleziona uno schermo cucina.
ru: Пожалуйста, выберите экран кухни.
tr: Lütfen bir mutfak ekranı seçin.
zh: 请选择一个厨房屏幕。

# setupCategoriesSelectImageLabel
source: Select Category Image (Optional)
ar: تحديد صورة الفئة (اختياري)
de: Kategoriebild auswählen (Optional)
es: Seleccionar Imagen de Categoría (Opcional)
fr: Sélectionner l'Image de Catégorie (Facultatif)
it: Seleziona Immagine Categoria (Opzionale)
ru: Выбрать изображение категории (Необязательно)
tr: Kategori Görseli Seç (Opsiyonel)
zh: 选择类别图片 (可选)

# setupCategoriesAddButton
source: Add Category
ar: إضافة فئة
de: Kategorie hinzufügen
es: Añadir Categoría
fr: Ajouter la Catégorie
it: Aggiungi Categoria
ru: Добавить категорию
tr: Kategoriyi Ekle
zh: 添加类别

# setupCategoriesAddedTitle
source: Added Categories
ar: الفئات المضافة
de: Hinzugefügte Kategorien
es: Categorías Añadidas
fr: Catégories Ajoutées
it: Categorie Aggiunte
ru: Добавленные категории
tr: Eklenen Kategoriler
zh: 已添加类别

# setupCategoriesSubtitleParent
source: (Parent Category: {parentName})
ar: (الفئة الرئيسية: {parentName})
de: (Übergeordnete Kategorie: {parentName})
es: (Categoría Padre: {parentName})
fr: (Catégorie Parente : {parentName})
it: (Categoria Genitore: {parentName})
ru: (Родительская категория: {parentName})
tr: (Üst Kategori: {parentName})
zh: (父类别: {parentName})

# setupCategoriesSubtitleKdsId
source: (KDS ID: {kdsId})
ar: (معرف KDS: {kdsId})
es: (ID de KDS: {kdsId})
fr: (ID KDS : {kdsId})
it: (ID KDS: {kdsId})
ru: (ID KDS: {kdsId})

# setupCategoriesKdsNotAssigned
source: KDS Not Assigned
ar: لم يتم تعيين KDS
de: KDS nicht zugewiesen
es: KDS No Asignado
fr: KDS Non Assigné
it: KDS Non Assegnato
ru: KDS не назначен
tr: KDS Atanmamış
zh: 未分配 KDS

# setupCategoriesDeleteTooltip
source: Delete Category
ar: حذف الفئة
de: Kategorie löschen
es: Eliminar Categoría
fr: Supprimer la Catégorie
it: Elimina Categoria
ru: Удалить категорию
tr: Kategoriyi Sil
zh: 删除类别

# setupCategoriesDeleteFallbackName
source: this category
ar: هذه الفئة
de: diese Kategorie
es: esta categoría
fr: cette catégorie
it: questa categoria
ru: эту категорию
tr: bu kategori
zh: 此类别

# setupStockErrorEnterQuantity
source: Quantity not entered for {itemName} - {variantName}.
ar: لم يتم إدخال كمية لـ {itemName} - {variantName}.
de: Menge für {itemName} - {variantName} nicht eingegeben.
es: Cantidad no introducida para {itemName} - {variantName}.
fr: Quantité non saisie pour {itemName} - {variantName}.
it: Quantità non inserita per {itemName} - {variantName}.
ru: Количество для {itemName} - {variantName} не введено.
tr: {itemName} - {variantName} için miktar girilmedi.
zh: {itemName} - {variantName} 未输入数量。

# setupStockErrorInvalidQuantity
source: Please enter a valid quantity for {itemName} - {variantName}.
ar: الرجاء إدخال كمية صالحة لـ {itemName} - {variantName}.
de: Bitte geben Sie eine gültige Menge für {itemName} - {variantName} ein.
es: Por favor, introduce una cantidad válida para {itemName} - {variantName}.
fr: Veuillez saisir une quantité valide pour {itemName} - {variantName}.
it: Per favore, inserisci una quantità valida per {itemName} - {variantName}.
ru: Пожалуйста, введите действительное количество для {itemName} - {variantName}.
tr: {itemName} - {variantName} için geçerli bir miktar girin.
zh: 请为 {itemName} - {variantName} 输入有效数量。

# setupStockSuccessUpdated
source: Stock for {itemName} - {variantName} updated: {quantity}
ar: تم تحديث مخزون {itemName} - {variantName}: {quantity}
de: Bestand für {itemName} - {variantName} aktualisiert: {quantity}
es: Stock para {itemName} - {variantName} actualizado: {quantity}
fr: Stock pour {itemName} - {variantName} mis à jour : {quantity}
it: Scorte per {itemName} - {variantName} aggiornate: {quantity}
ru: Запас для {itemName} - {variantName} обновлен: {quantity}
tr: {itemName} - {variantName} için stok güncellendi: {quantity}
zh: {itemName} - {variantName} 的库存已更新: {quantity}

# setupStockErrorUpdating
source: Error updating stock for {itemName} - {variantName}: {error}
ar: خطأ في تحديث مخزون {itemName} - {variantName}: {error}
de: Fehler beim Aktualisieren des Bestands für {itemName} - {variantName}: {error}
es: Error al actualizar stock para {itemName} - {variantName}: {error}
fr: Erreur lors de la mise à jour du stock pour {itemName} - {variantName} : {error}
it: Errore aggiornamento scorte per {itemName} - {variantName}: {error}
ru: Ошибка обновления запаса для {itemName} - {variantName}: {error}
tr: {itemName} - {variantName} stoğu güncellenirken hata: {error}
zh: 更新 {itemName} - {variantName} 库存时出错: {error}

# setupStockUnknownProduct
source: Unknown Product
ar: منتج غير معروف
de: Unbekanntes Produkt
es: Producto Desconocido
fr: Produit Inconnu
it: Prodotto Sconosciuto
ru: Неизвестный продукт
tr: Bilinmeyen Ürün
zh: 未知产品

# setupStockErrorNoVariants
source: Please create products and variants in previous steps for stock tracking.
ar: الرجاء إنشاء منتجات ومتغيرات في الخطوات السابقة لتتبع المخزون.
de: Bitte erstellen Sie Produkte und Varianten in den vorherigen Schritten für die Lagerverfolgung.
es: Por favor, crea productos y variantes en los pasos anteriores para el seguimiento de stock.
fr: Veuillez créer des produits et des variantes dans les étapes précédentes pour le suivi des stocks.
it: Per favore, crea prodotti e varianti nei passaggi precedenti per il tracciamento delle scorte.
ru: Пожалуйста, создайте продукты и варианты на предыдущих шагах для отслеживания запасов.
tr: Stok takibi için lütfen önceki adımlarda ürün ve varyant oluşturun.
zh: 请在之前的步骤中创建产品和变体以进行库存跟踪。
