Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# setupVariantsHintSelectProductToView
source: Select a main product to view its variants.
ar: حدد منتجًا رئيسيًا لعرض متغيراته.
de: Wählen Sie ein Hauptprodukt aus, um dessen Varianten anzuzeigen.
es: Selecciona un producto principal para ver sus variantes.
fr: Sélectionnez un produit principal pour visualiser ses variantes.
it: Seleziona un prodotto principale per visualizzare le sue varianti.
ru: Выберите основной продукт для просмотра его вариантов.
tr: Varyantlarını görmek için bir ana ürün seçin.
zh: 选择一个主要产品以查看其变体。

# setupVariantsNoVariantsForProduct
source: No variants have been added for {productName} yet.
ar: لم تتم إضافة أي متغيرات لـ {productName} بعد.
de: Es wurden noch keine Varianten für {productName} hinzugefügt.
es: Aún no se han añadido variantes para {productName}.
fr: Aucune variante n'a été ajoutée pour {productName} pour le moment.
it: Nessuna variante è stata ancora aggiunta per il prodotto {productName}.
ru: Варианты для {productName} еще не добавлены.
tr: {productName} için henüz varyant eklenmedi.
zh: 尚未为 {productName} 添加变体。

# homeMenuStaffSchedule
source: Staff Schedule
ar: جدول الموظفين
de: Dienstplan
es: Horario del Personal
fr: Emploi du Temps du Personnel
it: Pianificazione Staff
ru: Расписание персонала
tr: Personel Vardiyası
zh: 员工排班

# homeMenuKds
source: Kitchen Display System
ar: نظام عرض المطبخ
de: Küchenanzeigesystem
es: Sistema de Visualización de Cocina (KDS)
fr: Système d'Affichage de Cuisine
it: Sistema di Visualizzazione Cucina
ru: Система кухонного дисплея
tr: Mutfak Ekranı
zh: 厨房显示系统

# homeMenuKdsSettings
source: KDS Settings
ar: إعدادات KDS
de: KDS-Einstellungen
es: Ajustes de KDS
fr: Paramètres KDS
it: Impostazioni KDS
ru: Настройки KDS
tr: KDS Ayarları
zh: KDS 设置

# homeMenuGeneralReport
source: General Reports
ar: التقارير العامة
de: Allgemeine Berichte
es: Informes Generales
fr: Rapports Généraux
it: Report Generali
ru: Общие отчеты
tr: Genel Raporlar
zh: 一般报告

# homeMenuStaffPerformance
source: Staff Performance
ar: أداء الموظفين
de: Personal-Leistung
es: Rendimiento del Personal
fr: Performance du Personnel
it: Performance Staff
ru: Производительность персонала
tr: Personel Performansı
zh: 员工绩效

# homeMenuCreditSales
source: Credit Sales
ar: المبيعات الآجلة
de: Kreditverkäufe
es: Ventas a Crédito
fr: Ventes à Crédit
it: Vendite a Credito
ru: Продажи в кредит
tr: Veresiye Satışlar
zh: 赊账销售

# homeMenuStaffManagement
source: Staff Management
ar: إدارة الموظفين
de: Personalverwaltung
es: Gestión de Personal
fr: Gestion du Personnel
it: Gestione Staff
ru: Управление персоналом
tr: Personel Yönetimi
zh: 员工管理

# homeMenuMenuItems
source: Menu Items
ar: عناصر القائمة
de: Menüpunkte
es: Artículos de Menú
fr: Éléments de Menu
it: Elementi Menù
ru: Пункты меню
tr: Menü Öğeleri
zh: 菜单项

# homeMenuProductVariants
source: Product Variants
ar: متغيرات المنتج
de: Produktvarianten
es: Variantes de Producto
fr: Variantes de Produit
it: Varianti Prodotto
ru: Варианты продукта
tr: Ürün Varyantları
zh: 产品变体

# homeMenuStockManagement
source: Stock Management
ar: إدارة المخزون
de: Lagerverwaltung
es: Gestión de Stock
fr: Gestion des Stocks
it: Gestione Magazzino
ru: Управление запасами
tr: Stok Yönetimi
zh: 库存管理

# homeMenuTableManagement
source: Table Management
ar: إدارة الطاولات
de: Tischverwaltung
es: Gestión de Mesas
fr: Gestion des Tables
it: Gestione Tavoli
ru: Управление столами
tr: Masa Yönetimi
zh: 桌位管理

# homeMenuCategoryManagement
source: Category Management
ar: إدارة الفئات
de: Kategorienverwaltung
es: Gestión de Categorías
fr: Gestion des Catégories
it: Gestione Categorie
ru: Управление категориями
tr: Kategori Yönetimi
zh: 类别管理

# homeMenuCampaignManagement
source: Campaign Management
ar: إدارة الحملات
de: Kampagnenverwaltung
es: Gestión de Campañas
fr: Gestion des Campagnes
it: Gestione Campagne
ru: Управление кампаниями
tr: Kampanya Yönetimi
zh: 促销活动管理

# homeMenuPaidOrders
source: Paid Orders
ar: الطلبات المدفوعة
de: Bezahlte Bestellungen
es: Pedidos Pagados
fr: Commandes Payées
it: Ordini Pagati
ru: Оплаченные заказы
tr: Ödenmiş Siparişler
zh: 已支付订单

# homeMenuActiveTableOrders
source: Active Table Orders
ar: طلبات الطاولات النشطة
de: Aktive Tischbestellungen
es: Pedidos de Mesa Activos
fr: Commandes de Table Actives
it: Ordini Tavoli Attivi
ru: Активные заказы со столов
tr: Aktif Masa Siparişleri
zh: 活跃桌位订单

# homeMenuActiveTakeawayOrders
source: Active Takeaway Orders
ar: الطلبات الخارجية النشطة
de: Aktive Außer-Haus-Bestellungen
es: Pedidos para Llevar Activos
fr: Commandes à Emporter Actives
it: Ordini Asporto Attivi
ru: Активные заказы на вынос
tr: Aktif Paket Siparişler
zh: 活跃外卖订单

# homeMenuWaitingCustomers
source: Waiting Customers
ar: العملاء المنتظرون
de: Wartende Kunden
es: Clientes en Espera
fr: Clients en Attente
it: Clienti in Attesa
ru: Ожидающие клиенты
tr: Sıradaki Müşteriler
zh: 等待中的顾客

# homeMenuPagerManagement
source: Pager Management
ar: إدارة أجهزة النداء
de: Pager-Verwaltung
es: Gestión de Localizadores
fr: Gestion des Bipers
it: Gestione Pager
ru: Управление пейджерами
tr: Pager Yönetimi
zh: 传呼机管理

# homeMenuPrinterSettings
source: Printer Settings
ar: إعدادات الطابعة
de: Druckereinstellungen
es: Ajustes de Impresora
fr: Paramètres d'Imprimante
it: Impostazioni Stampante
ru: Настройки принтера
tr: Yazıcı Ayarları
zh: 打印机设置

# homeMenuAccountSettings
source: Account Settings
ar: إعدادات الحساب
de: Kontoeinstellungen
es: Ajustes de Cuenta
fr: Paramètres du Compte
it: Impostazioni Account
ru: Настройки аккаунта
tr: Hesap Ayarları
zh: 帐户设置

# dialogTransferErrorNoEmptyTables
source: No empty tables suitable for transfer were found!
ar: لم يتم العثور على طاولات فارغة مناسبة للتحويل!
de: Es wurden keine leeren Tische gefunden, die für die Übertragung geeignet sind!
es: ¡No se encontraron mesas vacías adecuadas para la transferencia!
fr: Aucune table vide appropriée pour le transfert n'a été trouvée !
it: Nessun tavolo vuoto idoneo per il trasferimento trovato!
ru: Не найдено пустых столов, подходящих для перевода!
tr: Transfer için uygun boş masa bulunamadı!
zh: 未找到适合转移的空闲桌位！

# dialogTransferTitle
source: Table Transfer
ar: تحويل الطاولة
de: Tischübertragung
es: Transferencia de Mesa
fr: Transfert de Table
it: Trasferimento Tavolo
ru: Перевод стола
tr: Masa Transferi
zh: 桌位转移

# dialogTransferContent
source: Transfer the order from table {tableNumber}?
ar: هل تريد تحويل الطلب من الطاولة {tableNumber}؟
de: Bestellung von Tisch {tableNumber} übertragen?
es: ¿Transferir el pedido de la mesa {tableNumber}?
fr: Transférer la commande de la table {tableNumber} ?
it: Trasferire l'ordine dal tavolo {tableNumber}?
ru: Перевести заказ со стола {tableNumber}?
tr: {tableNumber} numaralı masadan siparişi transfer et?
zh: 转移桌位 {tableNumber} 的订单吗？

# dialogTransferDropdownLabel
source: Select New Table
ar: تحديد طاولة جديدة
de: Neuen Tisch auswählen
es: Seleccionar Nueva Mesa
fr: Sélectionner la Nouvelle Table
it: Seleziona Nuovo Tavolo
ru: Выбрать новый стол
tr: Yeni Masa Seçin
zh: 选择新桌位

# dialogTransferButtonTransfer
source: Transfer
ar: تحويل
de: Übertragen
es: Transferir
fr: Transférer
it: Trasferisci
ru: Перевести
tr: Transfer Et
zh: 转移

# takeawayCardErrorItemPickup
source: Could not mark item as picked up (Code: {statusCode})
ar: تعذر وضع علامة تم الاستلام على العنصر (الرمز: {statusCode})
de: Artikel konnte nicht als abgeholt markiert werden (Code: {statusCode})
es: No se pudo marcar el artículo como recogido (Código: {statusCode})
fr: Impossible de marquer l'article comme ramassé (Code : {statusCode})
it: Impossibile segnare l'articolo come ritirato (Codice: {statusCode})
ru: Не удалось отметить товар как забранный (Код: {statusCode})
tr: Ürün teslim alındı olarak işaretlenemedi (Kod: {statusCode})
zh: 无法将产品标记为已取走 (代码: {statusCode})

# takeawayCardErrorItemPickupGeneric
source: An error occurred while picking up the item: {error}
ar: حدث خطأ أثناء استلام العنصر: {error}
de: Ein Fehler ist beim Abholen des Artikels aufgetreten: {error}
es: Ocurrió un error al recoger el artículo: {error}
fr: Une erreur s'est produite lors du ramassage de l'article : {error}
it: Si è verificato un errore durante il ritiro dell'articolo: {error}
ru: Произошла ошибка при получении товара: {error}
tr: Ürün teslim alınırken bir hata oluştu: {error}
zh: 取走产品时发生错误: {error}

# takeawayCardTooltipDelivered
source: Delivered to Customer
ar: تم التسليم للعميل
de: An Kunden ausgeliefert
es: Entregado al Cliente
fr: Livré au Client
it: Consegnato al Cliente
ru: Доставлено клиенту
tr: Müşteriye Teslim Edildi
zh: 已送达顾客

# takeawayCardTooltipMarkAsPickedUp
source: Mark as Picked Up
ar: وضع علامة كـ تم الاستلام
de: Als abgeholt markieren
es: Marcar como Recogido
fr: Marquer comme Ramassé
it: Segna come Ritirato
ru: Отметить как забранный
tr: Teslim Alındı Olarak İşaretle
zh: 标记为已取走

# takeawayCardTooltipDeliverToCustomer
source: Deliver to Customer
ar: التسليم للعميل
de: An Kunden ausliefern
es: Entregar al Cliente
fr: Livrer au Client
it: Consegna al Cliente
ru: Доставить клиенту
tr: Müşteriye Teslim Et
zh: 送达顾客

# kdsStatusWaitingForApproval
source: Waiting for Approval
ar: في انتظار الموافقة
de: Warten auf Genehmigung
es: Esperando Aprobación
fr: En Attente d'Approbation
it: In Attesa di Approvazione
ru: Ожидание одобрения
tr: Onay Bekliyor
zh: 等待批准

# takeawayCardStatusSyncPending
source: Awaiting Synchronization...
ar: في انتظار المزامنة...
de: Warten auf Synchronisierung...
es: Esperando Sincronización...
fr: En Attente de Synchronisation...
it: In Attesa di Sincronizzazione...
ru: Ожидание синхронизации...
tr: Senkronizasyon Bekleniyor...
zh: 等待同步...

# buttonApprove
source: Approve
ar: موافقة
de: Genehmigen
es: Aprobar
fr: Approuver
it: Approva
ru: Одобрить
tr: Onayla
zh: 批准

# buttonReject
source: Reject
ar: رفض
de: Ablehnen
es: Rechazar
fr: Rejeter
it: Rifiuta
ru: Отклонить
tr: Reddet
zh: 拒绝

# takeawayCardTooltipPagerInfo
source: Assigned Pager: {pagerInfo}
ar: جهاز النداء المعيّن: {pagerInfo}
de: Zugewiesener Pager: {pagerInfo}
es: Localizador Asignado: {pagerInfo}
fr: Biper Assigné : {pagerInfo}
it: Pager Assegnato: {pagerInfo}
ru: Назначенный пейджер: {pagerInfo}
tr: Atanmış Pager: {pagerInfo}
zh: 已分配传呼机: {pagerInfo}

# takeawayCardTooltipAssignPager
source: Assign Pager
ar: تعيين جهاز نداء
de: Pager zuweisen
es: Asignar Localizador
fr: Assigner un Biper
it: Assegna Pager
ru: Назначить пейджер
tr: Pager Ata
zh: 分配传呼机

# paymentTypeCredit
source: Credit
ar: آجل
de: Kredit
es: Crédito
fr: Crédit
it: Credito
ru: Кредит
tr: Veresiye
zh: 赊账

# waitingCustomerDialogEditTitle
source: Edit Customer
ar: تعديل العميل
de: Kunden bearbeiten
es: Editar Cliente
fr: Modifier le Client
it: Modifica Cliente
ru: Редактировать клиента
tr: Müşteri Düzenle
zh: 编辑顾客

# waitingCustomerDialogNameLabel
source: Name Surname*
ar: الاسم والكنية*
de: Name Nachname*
es: Nombre Apellido*
fr: Nom Prénom*
it: Nome Cognome*
ru: Имя Фамилия*
tr: İsim Soyisim*
zh: 姓名 姓氏*

# waitingCustomerDialogNameValidator
source: Name cannot be empty
ar: لا يمكن أن يكون الاسم فارغًا
de: Der Name darf nicht leer sein
es: El nombre no puede estar vacío
fr: Le nom ne peut pas être vide
it: Il nome non può essere vuoto
ru: Имя не может быть пустым
tr: İsim boş olamaz
zh: 姓名不能为空

# waitingCustomerDialogPhoneLabel
source: Phone
ar: الهاتف
de: Telefon
es: Teléfono
fr: Téléphone
it: Telefono
ru: Телефон
tr: Telefon
zh: 电话

# waitingCustomerDialogPartySizeLabel
source: Party Size*
ar: عدد الأفراد*
de: Personenzahl*
es: Tamaño del Grupo*
fr: Taille du Groupe*
it: Numero di Persone*
ru: Количество человек*
tr: Kişi Sayısı*
zh: 人数*

# waitingCustomerDialogPartySizeValidatorRequired
source: Party size cannot be empty
ar: لا يمكن أن يكون عدد الأفراد فارغًا
de: Die Personenzahl darf nicht leer sein
es: El tamaño del grupo no puede estar vacío
fr: La taille du groupe ne peut pas être vide
it: Il numero di persone non può essere vuoto
ru: Количество человек не может быть пустым
tr: Kişi sayısı boş olamaz
zh: 人数不能为空

# waitingCustomerDialogPartySizeValidatorPositive
source: Enter a valid positive number
ar: أدخل رقمًا موجبًا صالحًا
de: Geben Sie eine gültige positive Zahl ein
es: Introduce un número positivo válido
fr: Saisir un nombre positif valide
it: Inserisci un numero positivo valido
ru: Введите действительное положительное число
tr: Geçerli pozitif bir sayı girin
zh: 请输入有效的正数

# waitingCustomerDialogNotesLabel
source: Notes (Optional)
ar: ملاحظات (اختياري)
de: Notizen (Optional)
es: Notas (Opcional)
fr: Notes (Facultatif)
it: Note (Opzionale)
ru: Примечания (Необязательно)
tr: Notlar (Opsiyonel)
zh: 备注 (可选)

# waitingCustomerDialogWaitingLabel
source: Waiting
ar: في الانتظار
de: Wartend
es: Esperando
fr: En Attente
it: In Attesa
ru: Ожидание
tr: Bekliyor
zh: 等待中

# waitingCustomerDialogDeleteTitle
source: Delete Customer
ar: حذف العميل
de: Kunden löschen
es: Eliminar Cliente
fr: Supprimer le Client
it: Elimina Cliente
ru: Удалить клиента
tr: Müşteri Sil
zh: 删除顾客

# waitingCustomerDialogDeleteContent
source: Are you sure you want to delete the customer with ID: {customerId}?
ar: هل أنت متأكد أنك تريد حذف العميل بالمعرف: {customerId}؟
de: Sind Sie sicher, dass Sie den Kunden mit der ID: {customerId} löschen möchten?
es: ¿Estás seguro de que quieres eliminar al cliente con ID: {customerId}?
fr: Êtes-vous sûr de vouloir supprimer le client avec l'ID : {customerId} ?
it: Sei sicuro di voler eliminare il cliente con ID: {customerId}?
ru: Вы уверены, что хотите удалить клиента с ID: {customerId}?
tr: ID: {customerId} olan müşteriyi silmek istediğinize emin misiniz?
zh: 您确定要删除 ID 为 {customerId} 的顾客吗？

# addCustomerFormNameLabel
source: Name Surname*
ar: الاسم والكنية*
de: Name Nachname*
es: Nombre Apellido*
fr: Nom Prénom*
it: Nome Cognome*
ru: Имя Фамилия*
tr: İsim Soyisim*
zh: 姓名 姓氏*

# addCustomerFormAddButton
source: Add Customer
ar: إضافة عميل
de: Kunden hinzufügen
es: Añadir Cliente
fr: Ajouter un Client
it: Aggiungi Cliente
ru: Добавить клиента
tr: Müşteri Ekle
zh: 添加顾客

# waitingCustomerTableWaitingTime
source: {minutes} min
ar: {minutes} دقيقة
ru: {minutes} мин
tr: {minutes} dk
zh: {minutes} 分钟

# waitingCustomerTableNoCustomers
source: No waiting customers.
ar: لا يوجد عملاء في الانتظار.
de: Keine wartenden Kunden.
es: No hay clientes en espera.
fr: Aucun client en attente.
it: Nessun cliente in attesa.
ru: Нет ожидающих клиентов.
tr: Bekleyen müşteri yok.
zh: 没有等待中的顾客。

# waitingCustomerTableColOrder
source: Order
ar: الترتيب
de: Reihenfolge
es: Orden
fr: Ordre
it: Ordine
ru: Порядок
tr: Sıra
zh: 序号

# waitingCustomerTableColName
source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ru: Имя
tr: İsim
zh: 姓名

# waitingCustomerTableColPhone
source: Phone
ar: الهاتف
de: Telefon
es: Teléfono
fr: Téléphone
it: Telefono
ru: Телефон
tr: Telefon
zh: 电话

# waitingCustomerTableColWaitingTime
source: Waiting Time
ar: وقت الانتظار
de: Wartezeit
es: Tiempo de Espera
fr: Temps d'Attente
it: Tempo di Attesa
ru: Время ожидания
tr: Bekleme Süresi
zh: 等待 时间

# waitingCustomerTableColActions
source: Actions
ar: الإجراءات
de: Aktionen
es: Acciones
it: Azioni
ru: Действия
tr: İşlemler
zh: 操作

# multiDayShiftDialogTitle
source: Assign for {count} Days
ar: تعيين لـ {count} أيام
de: Für {count} Tage zuweisen
es: Asignar para {count} Días
fr: Assigner pour {count} Jours
it: Assegna per {count} Giorni
ru: Назначить на {count} дней
tr: {count} Gün İçin Atama Yap
zh: 为 {count} 天分配

# multiDayShiftDialogSelectedDatesLabel
source: Selected Dates:
ar: التواريخ المحددة:
de: Ausgewählte Daten:
es: Fechas Seleccionadas:
fr: Dates Sélectionnées :
it: Date Selezionate:
ru: Выбранные даты:
tr: Seçilen Tarihler:
zh: 选定日期:

# multiDayShiftDialogStep1
source: 1. Select Staff:
ar: 1. تحديد الموظف:
de: 1. Personal auswählen:
es: 1. Seleccionar Personal:
fr: 1. Sélectionner le Personnel :
it: 1. Seleziona Staff:
ru: 1. Выберите сотрудника:
tr: 1. Personelleri Seçin:
zh: 1. 选择员工:

# multiDayShiftDialogStep2
source: 2. Select Shift:
ar: 2. تحديد المناوبة:
de: 2. Schicht auswählen:
es: 2. Seleccionar Turno:
fr: 2. Sélectionner le Quart :
it: 2. Seleziona Turno:
ru: 2. Выберите смену:
tr: 2. Vardiyayı Seçin:
zh: 2. 选择班次:

# multiDayShiftDialogHint
source: Select a shift template...
ar: حدد قالب مناوبة...
de: Schichtvorlage auswählen...
es: Selecciona una plantilla de turno...
fr: Sélectionner un modèle de quart...
it: Seleziona un modello di turno...
ru: Выберите шаблон смены...
tr: Vardiya şablonu seçin...
zh: 选择一个班次模板...

# multiDayShiftDialogValidator
source: Please select a shift.
ar: الرجاء تحديد مناوبة.
de: Bitte wählen Sie eine Schicht aus.
es: Por favor, selecciona un turno.
fr: Veuillez sélectionner un quart.
it: Per favore, seleziona un turno.
ru: Пожалуйста, выберите смену.
tr: Lütfen bir vardiya seçin.
zh: 请选择一个班次。

# waitingCustomerButtonLabel
source: Waiting ({count} people)
ar: في الانتظار ({count} أشخاص)
de: Wartend ({count} Personen)
es: En Espera ({count} personas)
fr: En Attente ({count} personnes)
it: In Attesa ({count} persone)
ru: Ожидание ({count} чел.)
tr: Bekleyen ({count} kişi)
zh: 等待中 ({count} 人)

# notificationEventGuestOrderPendingApproval
source: Guest Order Pending Approval
ar: طلب ضيف في انتظار الموافقة
de: Gastbestellung wartet auf Genehmigung
es: Pedido de Invitado Pendiente de Aprobación
fr: Commande Invité en Attente d'Approbation
it: Ordine Ospite in Attesa di Approvazione
ru: Гостевой заказ ожидает одобрения
tr: Misafir Siparişi Onay Bekliyor
zh: 客人订单等待批准

# notificationEventOrderPendingApproval
source: Registered User Order Pending Approval
ar: طلب مستخدم مسجل في انتظار الموافقة
de: Bestellung von registriertem Benutzer wartet auf Genehmigung
es: Pedido de Usuario Registrado Pendiente de Aprobación
fr: Commande Utilisateur Enregistré en Attente d'Approbation
it: Ordine Utente Registrato in Attesa di Approvazione
ru: Заказ зарегистрированного пользователя ожидает одобрения
tr: Kayıtlı Kullanıcı Siparişi Onay Bekliyor
zh: 注册用户订单等待批准

# notificationEventExistingOrderNeedsReapproval
source: Existing Order Needs Reapproval
ar: طلب موجود يحتاج إلى إعادة موافقة
de: Bestehende Bestellung benötigt erneute Genehmigung
es: Pedido Existente Necesita Reaprobación
fr: Commande Existante Nécessite une Nouvelle Approbation
it: Ordine Esistente Richiede Nuova Approvazione
ru: Существующий заказ требует повторного одобрения
tr: Mevcut Sipariş Tekrar Onay Bekliyor
zh: 现有订单需要重新批准

# notificationEventNewApprovedOrder
source: New Approved Order
ar: طلب جديد تمت الموافقة عليه
de: Neue genehmigte Bestellung
es: Nuevo Pedido Aprobado
fr: Nouvelle Commande Approuvée
it: Nuovo Ordine Approvato
ru: Новый одобренный заказ
tr: Yeni Onaylanmış Sipariş
zh: 新的已批准订单

# notificationEventOrderApprovedForKitchen
source: Order Sent to Kitchen
ar: تم إرسال الطلب إلى المطبخ
de: Bestellung an die Küche gesendet
es: Pedido Enviado a Cocina
fr: Commande Envoyée à la Cuisine
it: Ordine Inviato in Cucina
ru: Заказ отправлен на кухню
tr: Sipariş Mutfağa İletildi
zh: 订单已发送至厨房

# notificationEventOrderPreparingUpdate
source: Order is Being Prepared
ar: الطلب قيد التحضير
de: Bestellung wird zubereitet
es: Pedido en Preparación
fr: Commande en Cours de Préparation
it: Ordine in Preparazione
ru: Заказ готовится
tr: Sipariş Hazırlanıyor
zh: 订单正在准备中

# notificationEventOrderReadyForPickupUpdate
source: Order is Ready in the Kitchen
ar: الطلب جاهز في المطبخ
de: Bestellung ist in der Küche bereit
es: Pedido Listo en Cocina
fr: Commande Prête en Cuisine
it: Ordine Pronto in Cucina
ru: Заказ готов на кухне
tr: Sipariş Mutfakta Hazır
zh: 订单在厨房准备就绪

# notificationEventOrderPickedUpByWaiter
source: Order Picked Up by Waiter
ar: تم استلام الطلب من قبل النادل
de: Bestellung vom Kellner abgeholt
es: Pedido Recogido por Camarero
fr: Commande Ramassée par le Serveur
it: Ordine Ritirato dal Cameriere
ru: Заказ забран официантом
tr: Sipariş Garson Tarafından Alındı
zh: 服务员已取走订单

# notificationEventOrderOutForDeliveryUpdate
source: Order Ready for Delivery
ar: الطلب جاهز للتسليم
de: Bestellung bereit zur Auslieferung
es: Pedido Listo para Reparto
fr: Commande Prête pour la Livraison
it: Ordine Pronto per la Consegna
ru: Заказ готов к доставке
tr: Sipariş Teslime Hazır
zh: 订单准备交付

# notificationEventOrderItemDelivered
source: Item Delivered
ar: تم تسليم العنصر
de: Artikel ausgeliefert
es: Artículo Entregado
fr: Article Livré
it: Articolo Consegnato
ru: Товар доставлен
tr: Ürün Teslim Edildi
zh: 产品已交付

# notificationEventOrderFullyDelivered
source: Order Fully Delivered
ar: تم تسليم الطلب بالكامل
de: Bestellung vollständig ausgeliefert
es: Pedido Completamente Entregado
fr: Commande Entièrement Livrée
it: Ordine Completamente Consegnato
ru: Заказ полностью доставлен
tr: Sipariş Tümüyle Teslim Edildi
zh: 订单完全交付

# notificationEventOrderCompletedUpdate
source: Order Completed
ar: اكتمل الطلب
de: Bestellung abgeschlossen
es: Pedido Completado
fr: Commande Terminée
it: Ordine Completato
ru: Заказ завершен
tr: Sipariş Tamamlandı
zh: 订单完成

# notificationEventOrderCancelledUpdate
source: Order Cancelled
ar: تم إلغاء الطلب
de: Bestellung storniert
es: Pedido Cancelado
fr: Commande Annulée
it: Ordine Annullato
ru: Заказ отменен
tr: Sipariş İptal Edildi
zh: 订单取消

# notificationEventOrderRejectedUpdate
source: Order Rejected
ar: تم رفض الطلب
de: Bestellung abgelehnt
es: Pedido Rechazado
fr: Commande Rejetée
it: Ordine Rifiutato
ru: Заказ отклонен
tr: Sipariş Reddedildi
zh: 订单拒绝

# notificationEventOrderUpdated
source: Order Updated
ar: تم تحديث الطلب
de: Bestellung aktualisiert
es: Pedido Actualizado
fr: Commande Mise à Jour
it: Ordine Aggiornato
ru: Заказ обновлен
tr: Sipariş Güncellendi
zh: 订单更新

# notificationEventOrderItemAdded
source: Item Added to Order
ar: تمت إضافة عنصر إلى الطلب
de: Artikel zur Bestellung hinzugefügt
es: Artículo Añadido al Pedido
fr: Article Ajouté à la Commande
it: Articolo Aggiunto all'Ordine
ru: Товар добавлен в заказ
tr: Siparişe Ürün Eklendi
zh: 订单中添加了产品

# notificationEventOrderItemRemoved
source: Item Removed from Order
ar: تمت إزالة عنصر من الطلب
de: Artikel aus der Bestellung entfernt
es: Artículo Eliminado del Pedido
fr: Article Retiré de la Commande
it: Articolo Rimosso dall'Ordine
ru: Товар удален из заказа
tr: Siparişten Ürün Çıkarıldı
zh: 订单中移除了产品

# notificationEventOrderItemUpdated
source: Order Item Updated
ar: تم تحديث عنصر الطلب
de: Bestellposition aktualisiert
es: Artículo del Pedido Actualizado
fr: Article de Commande Mis à Jour
it: Articolo Ordine Aggiornato
ru: Товар заказа обновлен
tr: Sipariş Kalemi Güncellendi
zh: 订单产品更新

# notificationEventOrderTransferred
source: Order Transferred to Another Table
ar: تم تحويل الطلب إلى طاولة أخرى
de: Bestellung an einen anderen Tisch übertragen
es: Pedido Transferido a Otra Mesa
fr: Commande Transférée à une Autre Table
it: Ordine Trasferito a un Altro Tavolo
ru: Заказ переведен к другому столу
tr: Sipariş Başka Masaya Transfer Edildi
zh: 订单转移到另一个桌位

# notificationEventWaitingCustomerAdded
source: New Waiting Customer
ar: عميل جديد في الانتظار
de: Neuer wartender Kunde
es: Nuevo Cliente en Espera
fr: Nouveau Client en Attente
it: Nuovo Cliente in Attesa
ru: Новый ожидающий клиент
tr: Yeni Bekleyen Müşteri
zh: 新的等待中顾客

# notificationEventWaitingCustomerUpdated
source: Waiting Customer Update
ar: تحديث عميل في الانتظار
de: Aktualisierung wartender Kunde
es: Actualización de Cliente en Espera
fr: Mise à Jour Client en Attente
it: Aggiornamento Cliente in Attesa
ru: Обновление ожидающего клиента
tr: Bekleyen Müşteri Güncellemesi
zh: 等待中顾客更新

# notificationEventWaitingCustomerRemoved
source: Waiting Customer Removed
ar: تمت إزالة عميل في الانتظار
de: Wartender Kunde entfernt
es: Cliente en Espera Eliminado
fr: Client en Attente Retiré
it: Cliente in Attesa Rimosso
ru: Ожидающий клиент удален
tr: Bekleyen Müşteri Silindi
zh: 等待中顾客已移除

# notificationEventStockAdjusted
source: Stock Adjusted
ar: تم تعديل المخزون
de: Bestand angepasst
es: Stock Ajustado
fr: Stock Ajusté
it: Scorte Regolate
ru: Запас скорректирован
tr: Stok Güncellemesi
zh: 库存已调整
