Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# scheduleErrorMultiDayAssignment
source: Error during bulk assignment: {error}
ar: خطأ أثناء التعيين الجماعي: {error}
de: Fehler bei der Massenzuweisung: {error}
es: Error durante la asignación masiva: {error}
fr: Erreur lors de l'assignation en masse : {error}
it: Errore durante l'assegnazione in blocco: {error}
ru: Ошибка при массовом назначении: {error}
tr: Toplu atama sırasında hata: {error}
zh: 批量分配时出错: {error}

# scheduleButtonMultiSelect
source: Multi-Select
ar: تحديد متعدد
de: Mehrfachauswahl
es: Selección Múltiple
fr: Multi-Sélection
it: Selezione Multipla
ru: Множественный выбор
tr: Çoklu Seçim
zh: 多选

# scheduleTooltipManageShiftTemplates
source: Manage Shift Templates
ar: إدارة قوالب المناوبات
de: Schichtvorlagen verwalten
es: Gestionar Plantillas de Turno
fr: Gérer les Modèles de Quart
it: Gestisci Modelli di Turno
ru: Управление шаблонами смен
tr: Vardiya Şablonlarını Yönet
zh: 管理班次模板

# scheduleFabManageSelectedDays
source: Manage Selected Days
ar: إدارة الأيام المحددة
de: Ausgewählte Tage verwalten
es: Gestionar Días Seleccionados
fr: Gérer les Jours Sélectionnés
it: Gestisci Giorni Selezionati
ru: Управление выбранными днями
tr: Seçili Günleri Yönet
zh: 管理选定日期

# scheduleFabManageDay
source: Manage Day
ar: إدارة اليوم
de: Tag verwalten
es: Gestionar Día
fr: Gérer la Journée
it: Gestisci Giorno
ru: Управление днем
tr: Günü Yönet
zh: 管理日

# scheduleTooltipAssignToSelectedDays
source: Assign to selected days
ar: تعيين للأيام المحددة
de: Ausgewählten Tagen zuweisen
es: Asignar a los días seleccionados
fr: Assigner aux jours sélectionnés
it: Assegna ai giorni selezionati
ru: Назначить на выбранные дни
tr: Seçili günlere atama yap
zh: 分配给选定日期

# scheduleTooltipAssignRemoveForDay
source: Assign/remove shift for the selected day
ar: تعيين/إزالة مناوبة لليوم المحدد
de: Schicht für den ausgewählten Tag zuweisen/entfernen
es: Asignar/eliminar turno para el día seleccionado
fr: Assigner/retirer un quart pour le jour sélectionné
it: Assegna/rimuovi turno per il giorno selezionato
ru: Назначить/удалить смену на выбранный день
tr: Seçili güne vardiya ata/kaldır
zh: 为选定日期分配/移除班次

# scheduleNoShiftsForDate
source: No shifts for {date}.
ar: لا توجد مناوبات لتاريخ {date}.
de: Keine Schichten für {date}.
es: No hay turnos para {date}.
fr: Aucun quart pour le {date}.
it: Nessun turno per {date}.
ru: Нет смен на {date}.
tr: {date} için vardiya yok.
zh: {date} 无班次。

# stockScreenTitle
source: Stock Management
ar: إدارة المخزون
de: Lagerverwaltung
es: Gestión de Stock
fr: Gestion des Stocks
it: Gestione Magazzino
ru: Управление запасами
tr: Stok Yönetimi
zh: 库存管理

# stockScreenTooltipAddNew
source: Create New Stock Record
ar: إنشاء سجل مخزون جديد
de: Neuen Lagerdatensatz erstellen
es: Crear Nuevo Registro de Stock
fr: Créer un Nouvel Enregistrement de Stock
it: Crea Nuovo Record Magazzino
ru: Создать новую запись о запасах
tr: Yeni Stok Kaydı Oluştur
zh: 创建新库存记录

# stockScreenNoStockItems
source: No products found for stock tracking. Use the '+' button to add a new record.
ar: لم يتم العثور على منتجات لتتبع المخزون. استخدم زر '+' لإضافة سجل جديد.
de: Keine Produkte für die Lagerverfolgung gefunden. Verwenden Sie die Schaltfläche '+' um einen neuen Datensatz hinzuzufügen.
es: No se encontraron productos para seguimiento de stock. Usa el botón '+' para añadir un nuevo registro.
fr: Aucun produit trouvé pour le suivi des stocks. Utilisez le bouton '+' pour ajouter un nouvel enregistrement.
it: Nessun prodotto trovato per il tracciamento del magazzino. Usa il pulsante '+' per aggiungere un nuovo record.
ru: Не найдено продуктов для отслеживания запасов. Используйте кнопку '+' для добавления новой записи.
tr: Stok takibi yapılacak ürün bulunamadı. Yeni kayıt eklemek için '+' butonunu kullanın.
zh: 未找到用于库存跟踪的产品。 使用“+”按钮添加新记录。

# stockMovementAddition
source: Stock Addition (Purchase)
ar: إضافة مخزون (شراء)
de: Lagerzugang (Kauf)
es: Adición de Stock (Compra)
fr: Ajout de Stock (Achat)
it: Aggiunta Scorte (Acquisto)
ru: Добавление запаса (Покупка)
tr: Stok Girişi (Alım)
zh: 库存增加 (采购)

# stockMovementWastage
source: Wastage/Loss
ar: هدر/خسارة
de: Ausschuss/Verlust
es: Desperdicio/Pérdida
fr: Déchet/Perte
it: Spreco/Perdita
ru: Расход/Потеря
tr: Zayiat/Fire
zh: 损耗/损失

# stockMovementAdjustmentIn
source: Count Adjustment (Surplus)
ar: تعديل العد (فائض)
de: Bestandsanpassung (Überschuss)
es: Ajuste de Cuenta (Excedente)
fr: Ajustement de Compte (Excédent)
it: Regolazione Conteggio (Eccedenza)
ru: Корректировка количества (Излишек)
tr: Sayım Düzeltme (Fazla)
zh: 数量调整 (盈余)

# stockMovementAdjustmentOut
source: Count Adjustment (Deficit)
ar: تعديل العد (عجز)
de: Bestandsanpassung (Defizit)
es: Ajuste de Cuenta (Déficit)
fr: Ajustement de Compte (Déficit)
it: Regolazione Conteggio (Deficit)
ru: Корректировка количества (Дефицит)
tr: Sayım Düzeltme (Eksik)
zh: 数量调整 (亏损)

# stockDialogMovementTitle
source: Stock Movement
ar: حركة المخزون
de: Lagerbewegung
es: Movimiento de Stock
fr: Mouvement de Stock
it: Movimento Magazzino
ru: Движение запасов
tr: Stok Hareketi
zh: 库存变动

# stockDialogQuantityLabel
source: Quantity
ar: الكمية
de: Menge
es: Cantidad
fr: Quantité
it: Quantità
ru: Количество
tr: Miktar
zh: 数量

# stockDialogQuantityEntryLabel
source: Entry Quantity
ar: كمية الإدخال
de: Zugangsmenge
es: Cantidad de Entrada
fr: Quantité d'Entrée
it: Quantità di Ingresso
ru: Вводимое количество
tr: Giriş Miktarı
zh: 入库数量

# stockDialogQuantityWastageLabel
source: Wastage Quantity
ar: كمية الهدر
de: Ausschussmenge
es: Cantidad de Desperdicio
fr: Quantité de Déchet
it: Quantità di Spreco
ru: Количество расхода
tr: Zayiat Miktarı
zh: 损耗数量

# stockDialogQuantitySurplusLabel
source: Surplus Quantity
ar: كمية الفائض
de: Überschussmenge
es: Cantidad de Excedente
fr: Quantité Excédentaire
it: Quantità in Eccedenza
ru: Количество излишка
tr: Fazla Miktar
zh: 盈余数量

# stockDialogQuantityDeficitLabel
source: Deficit Quantity
ar: كمية العجز
de: Defizitmenge
es: Cantidad de Déficit
fr: Quantité Déficitaire
it: Quantità in Deficit
ru: Количество дефицита
tr: Eksik Miktar
zh: 亏损数量

# stockDialogErrorEnterQuantity
source: Please enter a quantity.
ar: الرجاء إدخال كمية.
de: Bitte geben Sie eine Menge ein.
es: Por favor, introduce una cantidad.
fr: Veuillez saisir une quantité.
it: Per favore, inserisci una quantità.
ru: Пожалуйста, введите количество.
tr: Lütfen miktar girin.
zh: 请输入数量。

# stockDialogErrorPositiveQuantity
source: Please enter a valid positive quantity.
ar: الرجاء إدخال كمية موجبة صالحة.
de: Bitte geben Sie eine gültige positive Menge ein.
es: Por favor, introduce una cantidad positiva válida.
fr: Veuillez saisir une quantité positive valide.
it: Per favore, inserisci una quantità positiva valida.
ru: Пожалуйста, введите действительное положительное количество.
tr: Geçerli pozitif bir miktar girin.
zh: 请输入有效的正数量。

# stockDialogErrorQuantityExceeds
source: The amount to be withdrawn cannot exceed the current stock ({quantity}).
ar: لا يمكن أن تتجاوز الكمية المراد سحبها المخزون الحالي ({quantity}).
de: Der abzubuchende Betrag darf den aktuellen Bestand ({quantity}) nicht überschreiten.
es: La cantidad a retirar no puede exceder el stock actual ({quantity}).
fr: Le montant à retirer ne peut pas dépasser le stock actuel ({quantity}).
it: L'importo da ritirare non può superare la scorta attuale ({quantity}).
ru: Снимаемая сумма не может превышать текущий запас ({quantity}).
tr: Çıkarılacak miktar mevcut stoktan ({quantity}) fazla olamaz.
zh: 提取数量不能超过当前库存 ({quantity})。

# stockDialogDescriptionLabel
source: Description (Optional)
ar: الوصف (اختياري)
de: Beschreibung (Optional)
es: Descripción (Opcional)
fr: Description (Facultatif)
it: Descrizione (Opzionale)
ru: Описание (Необязательно)
tr: Açıklama (Opsiyonel)
zh: 描述 (可选)

# stockDialogSuccessMessage
source: {movementName} operation successful.
ar: نجحت عملية {movementName}.
de: {movementName}-Vorgang erfolgreich.
es: Operación de {movementName} exitosa.
fr: Opération {movementName} réussie.
it: Operazione {movementName} completata con successo.
ru: Операция '{movementName}' успешна.
tr: {movementName} işlemi başarılı.
zh: {movementName} 操作成功。

# stockDialogErrorMessage
source: Stock movement error: {error}
ar: خطأ في حركة المخزون: {error}
de: Fehler bei der Lagerbewegung: {error}
es: Error de movimiento de stock: {error}
fr: Erreur de mouvement de stock : {error}
it: Errore movimento magazzino: {error}
ru: Ошибка движения запасов: {error}
tr: Stok hareketi hatası: {error}
zh: 库存变动错误: {error}

# stockDialogErrorNoNewVariant
source: No new product variants without a stock record found.
ar: لم يتم العثور على متغيرات منتج جديدة بدون سجل مخزون.
de: Keine neuen Produktvarianten ohne Lagerdatensatz gefunden.
es: No se encontraron nuevas variantes de producto sin un registro de stock.
fr: Aucune nouvelle variante de produit sans enregistrement de stock trouvée.
it: Nessuna nuova variante di prodotto senza un record di magazzino trovata.
ru: Не найдено новых вариантов продуктов без записи о запасах.
tr: Stok kaydı olmayan yeni ürün varyantı bulunamadı.
zh: 未找到没有库存记录的新产品变体。

# stockDialogCreateTitle
source: Create New Stock Record
ar: إنشاء سجل مخزون جديد
de: Neuen Lagerdatensatz erstellen
es: Crear Nuevo Registro de Stock
fr: Créer un Nouvel Enregistrement de Stock
it: Crea Nuovo Record Magazzino
ru: Создать новую запись о запасах
tr: Yeni Stok Kaydı Oluştur
zh: 创建新库存记录

# stockDialogSelectVariantLabel
source: Select Product Variant
ar: تحديد متغير المنتج
de: Produktvariante auswählen
es: Seleccionar Variante de Producto
fr: Sélectionner la Variante de Produit
it: Seleziona Variante Prodotto
ru: Выбрать вариант продукта
tr: Ürün Varyantı Seçin
zh: 选择产品变体

source: Unknown Variant
ar: متغير غير معروف
de: Unbekannte Variante
es: Variante Desconocida
fr: Variante Inconnue
it: Variante Sconosciuta
ru: Неизвестный вариант
tr: Bilinmeyen Varyant
zh: 未知变体

# unknownProduct
source: Product
ar: المنتج
de: Produkt
es: Producto
fr: Produit
it: Prodotto
ru: Продукт
tr: Ürün
zh: 产品

# stockDialogErrorSelectVariant
source: Please select a variant.
ar: الرجاء تحديد متغير.
de: Bitte wählen Sie eine Variante aus.
es: Por favor, selecciona una variante.
fr: Veuillez sélectionner une variante.
it: Per favore, seleziona una variante.
ru: Пожалуйста, выберите вариант.
tr: Lütfen bir varyant seçin.
zh: 请选择一个变体。

# stockDialogInitialQuantityLabel
source: Initial Stock Quantity
ar: كمية المخزون الأولية
de: Anfängliche Lagermenge
es: Cantidad Inicial de Stock
fr: Quantité de Stock Initiale
it: Quantità Iniziale in Magazzino
ru: Начальное количество на складе
tr: Başlangıç Stok Miktarı
zh: 初始库存数量

# stockDialogErrorValidQuantity
source: Please enter a valid quantity.
ar: الرجاء إدخال كمية صالحة.
de: Bitte geben Sie eine gültige Menge ein.
es: Por favor, introduce una cantidad válida.
fr: Veuillez saisir une quantité valide.
it: Per favore, inserisci una quantità valida.
ru: Пожалуйста, введите действительное количество.
tr: Geçerli bir miktar girin.
zh: 请输入一个有效数量。

# stockDialogCreateSuccess
source: New stock record created successfully.
ar: تم إنشاء سجل مخزون جديد بنجاح.
de: Neuer Lagerdatensatz erfolgreich erstellt.
es: Nuevo registro de stock creado con éxito.
fr: Nouvel enregistrement de stock créé avec succès.
it: Nuovo record magazzino creato con successo.
ru: Новая запись о запасах успешно создана.
tr: Yeni stok kaydı başarıyla oluşturuldu.
zh: 新库存记录创建成功。

# stockDialogCreateError
source: New stock record error: {error}
ar: خطأ في سجل المخزون الجديد: {error}
de: Fehler beim Erstellen des neuen Lagerdatensatzes: {error}
es: Error al crear nuevo registro de stock: {error}
fr: Erreur de nouvel enregistrement de stock : {error}
it: Errore creazione nuovo record magazzino: {error}
ru: Ошибка новой записи о запасах: {error}
tr: Yeni stok kaydı hatası: {error}
zh: 新库存记录错误: {error}

# stockCardSettingsSaved
source: Settings saved.
ar: تم حفظ الإعدادات.
de: Einstellungen gespeichert.
es: Ajustes guardados.
fr: Paramètres enregistrés.
it: Impostazioni salvate.
ru: Настройки сохранены.
tr: Ayarlar kaydedildi.
zh: 设置已保存。

# stockCardCurrentStock
source: Stock: {quantity}
ar: المخزون: {quantity}
de: Bestand: {quantity}
it: Scorte: {quantity}
ru: Запас: {quantity}
tr: Stok: {quantity}
zh: 库存: {quantity}

# stockCardEnableTracking
source: Enable Stock Tracking
ar: تمكين تتبع المخزون
de: Lagerverfolgung aktivieren
es: Habilitar Seguimiento de Stock
fr: Activer le Suivi des Stocks
it: Abilita Tracciamento Scorte
ru: Включить отслеживание запасов
tr: Stok Takibini Aktifleştir
zh: 启用库存跟踪

# stockCardAlertThresholdLabel
source: Alert Threshold (Qty)
ar: عتبة التنبيه (الكمية)
de: Alarmgrenze (Menge)
es: Umbral de Alerta (Cant.)
fr: Seuil d'Alerte (Qté)
it: Soglia Avviso (Quantità)
ru: Пороговое значение оповещения (Кол-во)
tr: Uyarı Eşiği (Adet)
zh: 警报阈值 (数量)

# stockCardAlertThresholdHint
source: e.g., 50 (Leave blank to disable alerts)
ar: مثال: 50 (اتركها فارغة لتعطيل التنبيهات)
de: z. B. 50 (Leer lassen, um Alarme zu deaktivieren)
es: ej. 50 (Dejar en blanco para deshabilitar alertas)
fr: ex: 50 (Laisser vide pour désactiver les alertes)
it: es. 50 (Lascia vuoto per disabilitare gli avvisi)
ru: Например, 50 (Оставьте пустым для отключения оповещений)
tr: Örn: 50 (Boş bırakılırsa uyarmaz)
zh: 例如: 50 (留空以禁用警报)

# stockCardSaveSettingsButton
source: Save Settings
ar: حفظ الإعدادات
de: Einstellungen speichern
es: Guardar Ajustes
fr: Enregistrer les Paramètres
it: Salva Impostazioni
ru: Сохранить настройки
tr: Ayarları Kaydet
zh: 保存设置

# stockCardOtherActionsTooltip
source: Other Actions
ar: إجراءات أخرى
de: Andere Aktionen
es: Otras Acciones
fr: Autres Actions
it: Altre Azioni
ru: Другие действия
tr: Diğer İşlemler
zh: 其他操作

# stockCardHistoryButton
source: Stock History
ar: سجل المخزون
de: Lagerverlauf
es: Historial de Stock
fr: Historique des Stocks
it: Storico Magazzino
ru: История запасов
tr: Stok Geçmişi
zh: 库存历史记录

# accountSettingsTitle
source: Account Settings
ar: إعدادات الحساب
de: Kontoeinstellungen
es: Ajustes de Cuenta
fr: Paramètres du Compte
it: Impostazioni Account
ru: Настройки аккаунта
tr: Hesap Ayarları
zh: 帐户设置

# unknownUser
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ru: Неизвестный
tr: Bilinmiyor
zh: 未知

# accountSettingsErrorFetching
source: Error fetching account information: {error}
ar: خطأ في جلب معلومات الحساب: {error}
de: Fehler beim Abrufen der Kontoinformationen: {error}
es: Error al obtener información de la cuenta: {error}
fr: Erreur lors de la récupération des informations du compte : {error}
it: Errore durante il recupero delle informazioni account: {error}
ru: Ошибка получения информации об аккаунте: {error}
tr: Hesap bilgileri alınırken hata: {error}
zh: 获取帐户信息错误: {error}

# photoUploadErrorFirebase
source: Failed to upload photo to Firebase.
ar: فشل تحميل الصورة إلى Firebase.
de: Fehler beim Hochladen des Fotos auf Firebase.
es: Error al subir foto a Firebase.
fr: Échec du téléchargement de la photo vers Firebase.
it: Impossibile caricare la foto su Firebase.
ru: Не удалось загрузить фото в Firebase.
tr: Fotoğraf Firebase'e yüklenemedi.
zh: 无法将照片上传到Firebase。

# accountSettingsSuccessPhotoUpdate
source: Profile photo updated successfully.
ar: تم تحديث صورة الملف الشخصي بنجاح.
de: Profilfoto erfolgreich aktualisiert.
es: Foto de perfil actualizada con éxito.
fr: Photo de profil mise à jour avec succès.
it: Foto profilo aggiornata con successo.
ru: Фото профиля успешно обновлено.
tr: Profil fotoğrafı başarıyla güncellendi.
zh: 个人资料照片更新成功。

# accountSettingsErrorUploadingPhotoGeneric
source: Error uploading photo: {error}
ar: خطأ في تحميل الصورة: {error}
de: Fehler beim Hochladen des Fotos: {error}
es: Error al subir foto: {error}
fr: Erreur de téléchargement de la photo : {error}
it: Errore caricamento foto: {error}
ru: Ошибка загрузки фото: {error}
tr: Fotoğraf yüklenirken hata: {error}
zh: 照片上传错误: {error}

# accountSettingsErrorNewPasswordsMismatch
source: New passwords do not match.
ar: كلمتا المرور الجديدتان غير متطابقتين.
de: Die neuen Passwörter stimmen nicht überein.
es: Las nuevas contraseñas no coinciden.
fr: Les nouveaux mots de passe ne correspondent pas.
it: Le nuove password non corrispondono.
ru: Новые пароли не совпадают.
tr: Yeni parolalar eşleşmiyor.
zh: 新密码不匹配。

# accountSettingsSuccessUpdate
source: Account information updated successfully.
ar: تم تحديث معلومات الحساب بنجاح.
de: Kontoinformationen erfolgreich aktualisiert.
es: Información de la cuenta actualizada con éxito.
fr: Informations du compte mises à jour avec succès.
it: Informazioni account aggiornate con successo.
ru: Информация об аккаунте успешно обновлена.
tr: Hesap bilgileri başarıyla güncellendi.
zh: 帐户信息更新成功。

# accountSettingsSuccessPasswordUpdate
source: Your password has been changed successfully. Please log in again.
ar: تم تغيير كلمة المرور الخاصة بك بنجاح. الرجاء تسجيل الدخول مرة أخرى.
de: Ihr Passwort wurde erfolgreich geändert. Bitte melden Sie sich erneut an.
es: Tu contraseña ha sido cambiada con éxito. Por favor, inicia sesión de nuevo.
fr: Votre mot de passe a été changé avec succès. Veuillez vous reconnecter.
it: La tua password è stata cambiata con successo. Per favore, accedi di nuovo.
ru: Ваш пароль успешно изменен. Пожалуйста, войдите снова.
tr: Parolanız başarıyla değiştirildi. Lütfen tekrar giriş yapın.
zh: 您的密码已成功更改。请重新登录。

# accountSettingsSuccessEmailUpdate
source: Your email address has been updated successfully.
ar: تم تحديث عنوان بريدك الإلكتروني بنجاح.
de: Ihre E-Mail-Adresse wurde erfolgreich aktualisiert.
es: Tu dirección de correo electrónico ha sido actualizada con éxito.
fr: Votre adresse e-mail a été mise à jour avec succès.
it: Il tuo indirizzo email è stato aggiornato con successo.
ru: Ваш адрес электронной почты успешно обновлен.
tr: E-posta adresiniz başarıyla güncellendi.
zh: 您的电子邮件地址已成功更新。

# accountSettingsErrorUpdate
source: Update error: {error}
ar: خطأ في التحديث: {error}
de: Fehler beim Aktualisieren: {error}
es: Error de actualización: {error}
fr: Erreur de mise à jour : {error}
it: Errore aggiornamento: {error}
ru: Ошибка обновления: {error}
tr: Güncelleme hatası: {error}
zh: 更新错误: {error}

# accountSettingsEmailLabel
source: Email
ar: البريد الإلكتروني
es: Correo Electrónico
ru: Электронная почта
tr: E-Posta
zh: 电子邮件

# accountSettingsPasswordChangeSectionTitle
source: Password Change (Optional)
ar: تغيير كلمة المرور (اختياري)
de: Passwort ändern (Optional)
es: Cambio de Contraseña (Opcional)
fr: Changement de Mot de Passe (Facultatif)
it: Cambio Password (Opzionale)
ru: Смена пароля (Необязательно)
tr: Parola Değişikliği (İsteğe Bağlı)
zh: 更改密码 (可选)

# accountSettingsCurrentPasswordLabel
source: Current Password
ar: كلمة المرور الحالية
de: Aktuelles Passwort
es: Contraseña Actual
fr: Mot de passe Actuel
it: Password Attuale
ru: Текущий пароль
tr: Mevcut Parola
zh: 当前密码

# accountSettingsValidatorEnterCurrentPassword
source: Enter your current password to change it.
ar: أدخل كلمة المرور الحالية لتغييرها.
de: Geben Sie Ihr aktuelles Passwort ein, um es zu ändern.
es: Introduce tu contraseña actual para cambiarla.
fr: Saisissez votre mot de passe actuel pour le changer.
it: Inserisci la tua password attuale per cambiarla.
ru: Введите ваш текущий пароль для его изменения.
tr: Parola değiştirmek için mevcut parolanızı girin.
zh: 输入您当前的密码以更改它。

# accountSettingsNewPasswordLabel
source: New Password
ar: كلمة المرور الجديدة
de: Neues Passwort
es: Nueva Contraseña
fr: Nouveau Mot de passe
it: Nuova Password
ru: Новый пароль
tr: Yeni Parola
zh: 新密码

# accountSettingsValidatorEnterNewPassword
source: Enter your new password to change it.
ar: أدخل كلمة المرور الجديدة لتغييرها.
de: Geben Sie Ihr neues Passwort ein, um es zu ändern.
es: Introduce tu nueva contraseña para cambiarla.
fr: Saisissez votre nouveau mot de passe pour le changer.
it: Inserisci la tua nuova password per cambiarla.
ru: Введите ваш новый пароль для его изменения.
tr: Parola değiştirmek için yeni parolanızı girin.
zh: 输入您的新密码以更改它。

# accountSettingsConfirmNewPasswordLabel
source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
de: Neues Passwort bestätigen
es: Confirmar Nueva Contraseña
fr: Confirmer le Nouveau Mot de passe
it: Conferma Nuova Password
ru: Подтвердите новый пароль
tr: Yeni Parola Tekrar
zh: 确认新密码

# accountSettingsValidatorConfirmNewPassword
source: Please re-enter your new password.
ar: الرجاء إعادة إدخال كلمة المرور الجديدة.
de: Bitte geben Sie Ihr neues Passwort erneut ein.
es: Por favor, reintroduce tu nueva contraseña.
fr: Veuillez ressaisir votre nouveau mot de passe.
it: Per favore, reinserisci la tua nuova password.
ru: Пожалуйста, повторно введите ваш новый пароль.
tr: Lütfen yeni parolanızı tekrar girin.
zh: 请重新输入您的新密码。

# accountSettingsErrorPasswordsMismatch
source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.
de: Passwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne correspondent pas.
it: Le password non corrispondono.
ru: Пароли не совпадают.
tr: Parolalar eşleşmiyor.
zh: 密码不匹配。

# accountSettingsSaveChangesButton
source: Save Changes
ar: حفظ التغييرات
de: Änderungen speichern
es: Guardar Cambios
fr: Enregistrer les Changements
it: Salva Modifiche
ru: Сохранить изменения
tr: Değişiklikleri Kaydet
zh: 保存更改

# reportsScreenTitle
source: Advanced Report - {filterName}
ar: تقرير متقدم - {filterName}
de: Erweiterter Bericht - {filterName}
es: Informe Avanzado - {filterName}
fr: Rapport Avancé - {filterName}
it: Report Avanzato - {filterName}
ru: Расширенный отчет - {filterName}
tr: Gelişmiş Rapor - {filterName}
zh: 高级报告 - {filterName}

# reportsFilterToday
source: Today
ar: اليوم
de: Heute
es: Hoy
fr: Aujourd'hui
it: Oggi
ru: Сегодня
tr: Bugün
zh: 今天

# reportsFilterThisWeek
source: This Week
ar: هذا الأسبوع
de: Diese Woche
es: Esta Semana
fr: Cette Semaine
it: Questa Settimana
ru: На этой неделе
tr: Bu Hafta
zh: 本周

# reportsFilterThisMonth
source: This Month
ar: هذا الشهر
de: Diesen Monat
es: Este Mes
fr: Ce Mois-ci
it: Questo Mese
ru: В этом месяце
tr: Bu Ay
zh: 本月

# reportsFilterThisYear
source: This Year
ar: هذا العام
de: Dieses Jahr
es: Este Año
fr: Cette Année
it: Quest'Anno
ru: В этом году
tr: Bu Yıl
zh: 今年

# reportsFilterCustom
source: Custom Date Range
ar: نطاق تاريخ مخصص
de: Benutzerdefinierter Datumsbereich
es: Rango de Fechas Personalizado
fr: Plage de Dates Personnalisée
it: Intervallo Date Personalizzato
ru: Пользовательский диапазон дат
tr: Özel Tarih Aralığı
zh: 自定义日期范围

# reportsErrorSelectDateRange
source: Please select a custom date range.
ar: الرجاء تحديد نطاق تاريخ مخصص.
de: Bitte wählen Sie einen benutzerdefinierten Datumsbereich.
es: Por favor, selecciona un rango de fechas personalizado.
fr: Veuillez sélectionner une plage de dates personnalisée.
it: Per favore, seleziona un intervallo di date personalizzato.
ru: Пожалуйста, выберите пользовательский диапазон дат.
tr: Lütfen özel bir tarih aralığı seçin.
zh: 请选择一个自定义日期范围。

# reportsErrorFetching
source: An error occurred while fetching the report: {statusCode}
ar: حدث خطأ أثناء جلب التقرير: {statusCode}
de: Ein Fehler ist beim Abrufen des Berichts aufgetreten: {statusCode}
es: Ocurrió un error al obtener el informe: {statusCode}
fr: Une erreur s'est produite lors de la récupération du rapport : {statusCode}
it: Si è verificato un errore durante il recupero del report: {statusCode}
ru: Произошла ошибка при получении отчета: {statusCode}
tr: Rapor alınırken hata oluştu: {statusCode}
zh: 获取报告时发生错误: {statusCode}

# reportsChartTitleHourly
source: Hourly Turnover Distribution ({date})
ar: توزيع الإيرادات بالساعة ({date})
de: Stündliche Umsatzverteilung ({date})
es: Distribución de Facturación por Hora ({date})
fr: Répartition du Chiffre d'Affaires Horaires ({date})
it: Distribuzione Fatturato Orario ({date})
ru: Распределение почасового оборота ({date})
tr: Saatlik Ciro Dağılımı ({date})
zh: 每小时营业额分布 ({date})
