Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# websiteSettingsToggleAllowReservations
source: Allow Online Reservations
ar: السماح بالحجوزات عبر الإنترنت
de: Online-Reservierungen zulassen
es: Permitir Reservas en Línea
fr: Autoriser les Réservations en Ligne
it: Consenti Prenotazioni Online
ru: Разрешить онлайн-бронирование
tr: Online Rezervasyona İzin Ver
zh: 允许在线预订

# websiteSettingsToggleAllowOnlineOrdering
source: Allow Online Ordering
ar: السماح بالطلب عبر الإنترنت
de: Online-Bestellungen zulassen
es: Permitir Pedidos en Línea
fr: Autoriser la Commande en Ligne
it: Consenti Ordini Online
ru: Разрешить онлайн-заказ
tr: Online Siparişe İzin Ver
zh: 允许在线订购

# websiteSettingsThemeSystem
source: System Default
ar: النظام الافتراضي
de: Systemstandard
es: Predeterminado del Sistema
fr: Par Défaut du Système
it: Predefinito di Sistema
ru: Системный по умолчанию
tr: Sistem Varsayılanı
zh: 系统默认

# websiteSettingsThemeLight
source: Light Mode
ar: الوضع الفاتح
de: Heller Modus
es: Modo Claro
fr: Mode Clair
it: Modalità Chiara
ru: Светлый режим
tr: Aydınlık Mod
zh: 浅色模式

# websiteSettingsThemeDark
source: Dark Mode
ar: الوضع الداكن
de: Dunkler Modus
es: Modo Oscuro
fr: Mode Sombre
it: Modalità Scura
ru: Темный режим
tr: Karanlık Mod
zh: 深色模式

# websiteSettingsLabelTheme
source: Website Theme
ar: نسق الموقع الإلكتروني
de: Website-Thema
es: Tema del Sitio Web
fr: Thème du Site Web
it: Tema Sito Web
ru: Тема веб-сайта
tr: Web Sitesi Teması
zh: 网站主题

# websiteSettingsButtonUploadImage
source: Upload Image
ar: تحميل صورة
de: Bild hochladen
es: Subir Imagen
fr: Télécharger l'Image
it: Carica Immagine
ru: Загрузить изображение
tr: Görsel Yükle
zh: 上传图片

# mapPickerAppBarTitle
source: Select Location from Map
ar: تحديد الموقع من الخريطة
de: Standort von der Karte auswählen
es: Seleccionar Ubicación del Mapa
fr: Sélectionner l'Emplacement sur la Carte
it: Seleziona Posizione dalla Mappa
ru: Выбрать местоположение на карте
tr: Haritadan Konum Seç
zh: 从地图选择位置

# mapPickerMarkerTitle
source: Selected Location
ar: الموقع المحدد
de: Ausgewählter Standort
es: Ubicación Seleccionada
fr: Emplacement Sélectionné
it: Posizione Selezionata
ru: Выбранное местоположение
tr: Seçilen Konum
zh: 所选位置

# mapPickerMarkerSnippet
source: Is this your business location?
ar: هل هذا هو موقع عملك؟
de: Ist dies Ihr Geschäftsstandort?
es: ¿Es esta la ubicación de tu negocio?
fr: Est-ce l'emplacement de votre entreprise ?
it: Questa è la posizione della tua attività?
ru: Это местоположение вашего бизнеса?
tr: İşletmenizin konumu burası mı?
zh: 这是您的商家位置吗？

# mapPickerSearchHint
source: Search for a restaurant or address...
ar: البحث عن مطعم أو عنوان...
de: Nach einem Restaurant oder einer Adresse suchen...
es: Buscar un restaurante o dirección...
fr: Rechercher un restaurant ou une adresse...
it: Cerca un ristorante o un indirizzo...
ru: Поиск ресторана или адреса...
tr: Restoran veya adres arayın...
zh: 搜索餐厅或地址...

# mapPickerConfirmButton
source: Confirm This Location
ar: تأكيد هذا الموقع
de: Diesen Standort bestätigen
es: Confirmar Esta Ubicación
fr: Confirmer Cet Emplacement
it: Conferma Questa Posizione
ru: Подтвердить это местоположение
tr: Bu Konumu Onayla
zh: 确认此位置

# mapPickerUnknownPlace
source: Unknown Place
ar: مكان غير معروف
de: Unbekannter Ort
es: Lugar Desconocido
fr: Lieu Inconnu
it: Luogo Sconosciuto
ru: Неизвестное место
tr: Bilinmeyen Yer
zh: 未知地点

# mapPickerErrorApiKey
source: Google Maps API key error. Please contact your administrator.
ar: خطأ في مفتاح API لخرائط Google. يرجى الاتصال بالمسؤول.
de: Google Maps API-Schlüsselfehler. Bitte wenden Sie sich an Ihren Administrator.
es: Error de clave de API de Google Maps. Por favor, contacta con tu administrador.
fr: Erreur de clé API Google Maps. Veuillez contacter votre administrateur.
it: Errore chiave API Google Maps. Per favore, contatta il tuo amministratore.
ru: Ошибка ключа API Google Maps. Пожалуйста, свяжитесь с вашим администратором.
tr: Google Maps API anahtarı hatası. Lütfen yöneticinize başvurun.
zh: Google 地图 API 密钥错误。请联系您的管理员。

# mapPickerErrorSearch
source: An error occurred while searching: {statusCode}
ar: حدث خطأ أثناء البحث: {statusCode}
de: Beim Suchen ist ein Fehler aufgetreten: {statusCode}
es: Ocurrió un error al buscar: {statusCode}
fr: Une erreur s'est produite lors de la recherche : {statusCode}
it: Si è verificato un errore durante la ricerca: {statusCode}
ru: Произошла ошибка при поиске: {statusCode}
tr: Arama yapılırken hata oluştu: {statusCode}
zh: 搜索时发生错误: {statusCode}

# mapPickerErrorConnection
source: Connection error. Please check your internet connection.
ar: خطأ في الاتصال. يرجى التحقق من اتصالك بالإنترنت.
de: Verbindungsfehler. Bitte überprüfen Sie Ihre Internetverbindung.
es: Error de conexión. Por favor, comprueba tu conexión a internet.
fr: Erreur de connexion. Veuillez vérifier votre connexion Internet.
it: Errore di connessione. Per favore, controlla la tua connessione internet.
ru: Ошибка подключения. Пожалуйста, проверьте интернет-соединение.
tr: Bağlantı hatası. İnternet bağlantınızı kontrol edin.
zh: 连接错误。请检查您的互联网连接。

# mapPickerErrorLocationDetails
source: An error occurred while fetching location details.
ar: حدث خطأ أثناء جلب تفاصيل الموقع.
de: Beim Abrufen der Standortdetails ist ein Fehler aufgetreten.
es: Ocurrió un error al obtener detalles de la ubicación.
fr: Une erreur s'est produite lors de la récupération des détails de l'emplacement.
it: Si è verificato un errore durante il recupero dei dettagli della posizione.
ru: Произошла ошибка при получении деталей местоположения.
tr: Konum detayları alınırken hata oluştu.
zh: 获取位置详情时发生错误。

# notificationOrderItemRemoved
source: Order #{orderId} updated: '{productName}' was removed.
ar: تم تحديث الطلب #{orderId}: تمت إزالة '{productName}'.
de: Bestellung #{orderId} aktualisiert: '{productName}' wurde entfernt.
es: Pedido #{orderId} actualizado: '{productName}' fue eliminado.
fr: Commande #{orderId} mise à jour : '{productName}' a été retiré.
it: Ordine #{orderId} aggiornato: '{productName}' è stato rimosso.
ru: Заказ #{orderId} обновлен: «{productName}» удален.
tr: Sipariş #{orderId} güncellendi: '{productName}' silindi.
zh: 订单 #{orderId} 已更新: “{productName}”已被移除。

# notificationOrderCancelledAllItemsRemoved
source: Order #{orderId} was cancelled because all its items were removed.
ar: تم إلغاء الطلب #{orderId} لأنه تمت إزالة جميع عناصره.
de: Bestellung #{orderId} wurde storniert, da alle Artikel entfernt wurden.
es: El Pedido #{orderId} fue cancelado porque se eliminaron todos sus artículos.
fr: La commande #{orderId} a été annulée car tous ses articles ont été retirés.
it: Ordine #{orderId} è stato annullato perché tutti i suoi articoli sono stati rimossi.
ru: Заказ #{orderId} отменен, так как все его товары были удалены.
tr: Sipariş #{orderId} (tüm kalemleri silindiği için) iptal edildi.
zh: 订单 #{orderId} 已被取消，因为其所有产品均已被移除。

# notificationOrderItemUpdated
source: Order #{orderId} updated: Item '{productName}' status/quantity was changed.
ar: تم تحديث الطلب #{orderId}: تم تغيير حالة/كمية العنصر '{productName}'.
de: Bestellung #{orderId} aktualisiert: Status/Menge des Artikels '{productName}' wurde geändert.
es: Pedido #{orderId} actualizado: El estado/cantidad del artículo '{productName}' fue cambiado.
fr: Commande #{orderId} mise à jour : Le statut/la quantité de l'article '{productName}' a été modifié(e).
it: Ordine #{orderId} aggiornato: Stato/quantità articolo '{productName}' è stato modificato.
ru: Заказ #{orderId} обновлен: статус/количество товара «{productName}» изменено.
tr: Sipariş #{orderId} güncellendi: '{productName}' kalemi durumu/miktarı değiştirildi.
zh: 订单 #{orderId} 已更新: 产品“{productName}”的状态/数量已更改。

# socketStatusWaitingForConnection
source: Waiting for connection...
ar: في انتظار الاتصال...
de: Warten auf Verbindung...
es: Esperando conexión...
fr: En attente de connexion...
it: In attesa di connessione...
ru: Ожидание подключения...
tr: Bağlantı bekleniyor...
zh: 正在等待连接...

# socketStatusCooldownMode
source: Too many connection errors - cooldown mode
ar: الكثير من أخطاء الاتصال - وضع التهدئة
de: Zu viele Verbindungsfehler - Cooldown-Modus
es: Demasiados errores de conexión - modo de enfriamiento
fr: Trop d'erreurs de connexion - mode de temporisation
it: Troppi errori di connessione - modalità cooldown
ru: Слишком много ошибок подключения - режим ожидания
tr: Çok fazla bağlantı hatası - dinlenme modu
zh: 连接错误过多 - 冷却模式

# socketStatusTokenRequired
source: Token required for connection.
ar: الرمز المميز مطلوب للاتصال.
de: Token für die Verbindung erforderlich.
es: Token requerido para la conexión.
fr: Jeton requis pour la connexion.
it: Token richiesto per la connessione.
ru: Требуется токен для подключения.
tr: Bağlantı için token gerekli.
zh: 连接需要令牌。

# socketStatusTokenRefreshFailed
source: Could not refresh token.
ar: تعذر تحديث الرمز المميز.
de: Token konnte nicht aktualisiert werden.
es: No se pudo actualizar el token.
fr: Impossible d'actualiser le jeton.
it: Impossibile aggiornare il token.
ru: Не удалось обновить токен.
tr: Token yenilenemedi.
zh: 无法刷新令牌。

# socketStatusNetworkOffline
source: No network connection
ar: لا يوجد اتصال بالشبكة
de: Keine Netzwerkverbindung
es: Sin conexión a la red
fr: Aucune connexion réseau
it: Nessuna connessione di rete
ru: Нет сетевого подключения
tr: Network bağlantısı yok
zh: 无网络连接

# socketStatusWaitingForServer
source: Waiting for server confirmation...
ar: في انتظار تأكيد الخادم...
de: Warten auf Serverbestätigung...
es: Esperando confirmación del servidor...
fr: En attente de la confirmation du serveur...
it: In attesa di conferma server...
ru: Ожидание подтверждения сервера...
tr: Sunucu onayı bekleniyor...
zh: 正在等待服务器确认...

# socketStatusConnected
source: Connected
ar: متصل
de: Verbunden
es: Conectado
fr: Connecté
it: Connesso
ru: Подключено
tr: Bağlandı
zh: 已连接

# socketStatusDisconnected
source: Disconnected. Retrying...
ar: غير متصل. جاري إعادة المحاولة...
de: Getrennt. Erneuter Versuch...
es: Desconectado. Reintentando...
fr: Déconnecté. Nouvelle tentative...
it: Disconnesso. Riprovo...
ru: Отключено. Повторная попытка...
tr: Bağlantı koptu. Tekrar deneniyor...
zh: 已断开连接。正在重试...

# socketStatusConnectionError
source: Connection error - retrying...
ar: خطأ في الاتصال - جاري إعادة المحاولة...
de: Verbindungsfehler - erneuter Versuch...
es: Error de conexión - reintentando...
fr: Erreur de connexion - nouvelle tentative...
it: Errore di connessione - riprovo...
ru: Ошибка подключения - повторная попытка...
tr: Bağlantı hatası - yeniden deneniyor...
zh: 连接错误 - 正在重试...

# socketStatusTerminated
source: Connection terminated
ar: تم إنهاء الاتصال
de: Verbindung beendet
es: Conexión terminada
fr: Connexion terminée
it: Connessione terminata
ru: Соединение разорвано
tr: Bağlantı kesildi
zh: 连接已终止

# socketNotificationConnectionSuccess
source: Connection successful.
ar: نجح الاتصال.
de: Verbindung erfolgreich.
es: Conexión exitosa.
fr: Connexion réussie.
it: Connessione riuscita.
ru: Подключение успешно.
tr: Bağlantı başarılı.
zh: 连接成功。

# socketNotificationDisconnected
source: Connection lost.
ar: فقد الاتصال.
de: Verbindung unterbrochen.
es: Conexión perdida.
fr: Connexion perdue.
it: Connessione persa.
ru: Соединение потеряно.
tr: Bağlantı koptu.
zh: 连接丢失。

# socketNotificationConnectionError
source: Connection error.
ar: خطأ في الاتصال.
de: Verbindungsfehler.
es: Error de conexión.
fr: Erreur de connexion.
it: Errore di connessione.
ru: Ошибка подключения.
tr: Bağlantı hatası.
zh: 连接错误。

# socketNotificationSystemError
source: System error.
ar: خطأ في النظام.
de: Systemfehler.
es: Error del sistema.
fr: Erreur système.
it: Errore di sistema.
ru: Системная ошибка.
tr: Sistem hatası.
zh: 系统错误。

# socketNotificationWaitingListUpdated
source: Waiting list updated.
ar: تم تحديث قائمة الانتظار.
de: Warteliste aktualisiert.
es: Lista de espera actualizada.
fr: Liste d'attente mise à jour.
it: Lista d'attesa aggiornata.
ru: Список ожидания обновлен.
tr: Bekleme listesi güncellendi.
zh: 等待列表已更新。

# socketNotificationPagerUpdated
source: Pager status updated.
ar: تم تحديث حالة جهاز النداء.
de: Pager-Status aktualisiert.
es: Estado de localizador actualizado.
fr: Statut du biper mis à jour.
it: Stato pager aggiornato.
ru: Статус пейджера обновлен.
tr: Pager durumu güncellendi.
zh: 传呼机状态已更新。

# socketNotificationStockUpdated
source: Stock status updated.
ar: تم تحديث حالة المخزون.
de: Bestandsstatus aktualisiert.
es: Estado de stock actualizado.
fr: Statut du stock mis à jour.
it: Stato magazzino aggiornato.
ru: Статус запасов обновлен.
tr: Stok durumu güncellendi.
zh: 库存状态已更新。

# socketNotificationGenericUpdate
source: Update
ar: تحديث
de: Aktualisierung
es: Actualización
fr: Mise à jour
it: Aggiornamento
ru: Обновление
tr: Güncelleme İstemiyorum
zh: 更新

# kdsScreenValidator
source: Please select a KDS screen
ar: الرجاء تحديد شاشة KDS
de: Bitte wählen Sie einen KDS-Bildschirm aus
es: Por favor, selecciona una pantalla KDS
fr: Veuillez sélectionner un écran KDS
it: Per favore, seleziona uno schermo KDS
ru: Пожалуйста, выберите экран KDS
tr: Lütfen bir KDS ekranı seçin
zh: 请选择一个 KDS 屏幕

source: KDS Screen Not Selected
ar: لم يتم تحديد شاشة KDS
de: KDS-Bildschirm nicht ausgewählt
es: Pantalla KDS No Seleccionada
fr: Écran KDS Non Sélectionné
it: Schermo KDS Non Selezionato
ru: Экран KDS не выбран
tr: KDS Ekranı Seçilmedi
zh: 未选择 KDS 屏幕

# setupMenuItemsAddFromTemplateButton
source: Add from Templates
ar: إضافة من القوالب
de: Aus Vorlagen hinzufügen
es: Añadir desde Plantillas
fr: Ajouter à partir des Modèles
it: Aggiungi da Modelli
ru: Добавить из шаблонов
tr: Şablonlardan Ekle
zh: 从模板添加

# setupMenuItemsErrorCategoryNotFound
source: Category name not found.
ar: لم يتم العثور على اسم الفئة.
de: Kategoriename nicht gefunden.
es: Nombre de categoría no encontrado.
fr: Nom de catégorie non trouvé.
it: Nome categoria non trovato.
ru: Название категории не найдено.
tr: Kategori adı bulunamadı.
zh: 未找到类别名称。

# setupMenuItemsErrorNoTemplatesForCategory
source: No suitable product templates found for this category.
ar: لم يتم العثور على قوالب منتجات مناسبة لهذه الفئة.
de: Keine geeigneten Produktvorlagen für diese Kategorie gefunden.
es: No se encontraron plantillas de producto adecuadas para esta categoría.
fr: Aucun modèle de produit approprié trouvé pour cette catégorie.
it: Nessun modello di prodotto adatto trovato per questa categoria.
ru: Не найдено подходящих шаблонов продуктов для этой категории.
tr: Bu kategori için uygun ürün şablonu bulunamadı.
zh: 未找到此类别合适的品模板。

# setupMenuItemsSuccessAddedFromTemplate
source: Successfully added {count} products from templates!
ar: تمت إضافة {count} منتج من القوالب بنجاح!
de: Erfolgreich {count} Produkte aus Vorlagen hinzugefügt!
es: ¡Se añadieron {count} productos desde plantillas con éxito!
fr: {count} produits ajoutés avec succès à partir des modèles !
it: Aggiunti {count} prodotti da modelli con successo!
ru: Успешно добавлено {count} продукт(а/ов) из шаблонов!
tr: Şablonlardan {count} ürün başarıyla eklendi!
zh: 已成功从模板添加 {count} 个产品！

# setupMenuItemsErrorLoadingTemplates
source: Error loading templates: {error}
ar: خطأ في تحميل القوالب: {error}
de: Fehler beim Laden der Vorlagen: {error}
es: Error al cargar plantillas: {error}
fr: Erreur lors du chargement des modèles : {error}
it: Errore caricamento modelli: {error}
ru: Ошибка загрузки шаблонов: {error}
tr: Şablonlar yüklenirken hata: {error}
zh: 加载模板错误: {error}

# setupMenuItemsTemplateDialogTitle
source: Select Product Templates
ar: تحديد قوالب المنتج
de: Produktvorlagen auswählen
es: Seleccionar Plantillas de Producto
fr: Sélectionner les Modèles de Produit
it: Seleziona Modelli Prodotto
ru: Выбрать шаблоны продуктов
tr: Ürün Şablonları Seç
zh: 选择产品模板

# setupMenuItemsTemplateSearchLabel
source: Search product...
ar: البحث عن منتج...
de: Produkt suchen...
es: Buscar producto...
fr: Rechercher un produit...
it: Cerca prodotto...
ru: Поиск продукта...
tr: Ürün ara...
zh: 搜索产品...

# setupMenuItemsTemplateSearchHint
source: Enter product name
ar: أدخل اسم المنتج
de: Produktnamen eingeben
es: Introduce el nombre del producto
fr: Saisir le nom du produit
it: Inserisci nome prodotto
ru: Введите название продукта
tr: Ürün adını yazın
zh: 输入产品名称

# setupMenuItemsTemplateSelectAll
source: Select All
ar: تحديد الكل
de: Alle auswählen
es: Seleccionar Todo
fr: Tout Sélectionner
it: Seleziona Tutto
ru: Выбрать все
tr: Tümünü Seç
zh: 全选

# setupMenuItemsTemplateDeselectAll
source: Deselect All
ar: إلغاء تحديد الكل
de: Alle abwählen
es: Deseleccionar Todo
fr: Tout Désélectionner
it: Deseleziona Tutto
ru: Снять выбор со всех
tr: Tümünü Bırak
zh: 取消全选

# setupMenuItemsTemplateItemsShowing
source: {count} items showing
ar: عرض {count} عنصر
de: {count} Artikel werden angezeigt
es: {count} artículos mostrándose
fr: {count} articles affichés
it: {count} articoli visualizzati
ru: Показано {count} товар(а/ов)
tr: {count} ürün gösteriliyor
zh: 正在显示 {count} 个产品

# setupMenuItemsTemplateNoTemplatesFound
source: No suitable templates found.
ar: لم يتم العثور على قوالب مناسبة.
de: Keine geeigneten Vorlagen gefunden.
es: No se encontraron plantillas adecuadas.
fr: Aucun modèle approprié trouvé.
it: Nessun modello adatto trovato.
ru: Не найдено подходящих шаблонов.
tr: Uygun şablon bulunamadı.
zh: 未找到合适的模板。

# setupMenuItemsTemplateNoSearchResults
source: No products matching your search criteria were found.
ar: لم يتم العثور على منتجات تطابق معايير البحث الخاصة بك.
de: Keine Produkte gefunden, die Ihren Suchkriterien entsprechen.
es: No se encontraron productos que coincidan con tus criterios de búsqueda.
fr: Aucun produit correspondant à vos critères de recherche n'a été trouvé.
it: Nessun prodotto corrispondente ai criteri di ricerca è stato trovato.
ru: Не найдено продуктов, соответствующих вашему поиску.
tr: Arama kriterinize uygun ürün bulunamadı.
zh: 未找到匹配您搜索条件的产品。

# setupMenuItemsTemplateUnnamedTemplate
source: Unnamed Template
ar: قالب غير مسمى
de: Unbenannte Vorlage
es: Plantilla sin Nombre
fr: Modèle sans Nom
it: Modello Senza Nome
ru: Безымянный шаблон
tr: İsimsiz Şablon
zh: 未命名模板

# setupMenuItemsTemplateAddSelectedButton
source: Add Selected ({count})
ar: إضافة المحدد ({count})
de: Ausgewählte hinzufügen ({count})
es: Añadir Seleccionados ({count})
fr: Ajouter la Sélection ({count})
it: Aggiungi Selezionati ({count})
ru: Добавить выбранное ({count})
tr: Seçilenleri Ekle ({count})
zh: 添加已选 ({count})

# setupMenuItemsTemplateLimitInfo
source: Current: {current}, Selected: {selected}, Limit: {limit}
ar: الحالي: {current}، المحدد: {selected}، الحد الأقصى: {limit}
de: Aktuell: {current}, Ausgewählt: {selected}, Limit: {limit}
es: Actual: {current}, Seleccionado: {selected}, Límite: {limit}
fr: Actuel : {current}, Sélectionné : {selected}, Limite : {limit}
it: Attuali: {current}, Selezionati: {selected}, Limite: {limit}
ru: Текущий: {current}, Выбрано: {selected}, Лимит: {limit}
tr: Mevcut: {current}, Seçilen: {selected}, Limit: {limit}
zh: 当前: {current}, 已选择: {selected}, 限制: {limit}

# setupMenuItemsTemplateLimitExceeded
source: Limit will be exceeded
ar: سيتم تجاوز الحد الأقصى
de: Limit wird überschritten
es: Se excederá el límite
fr: La limite sera dépassée
it: Limite superato
ru: Лимит будет превышен
tr: Limit aşılacak
zh: 将超出限制

# notificationDefault
source: You have a new notification!
ar: لديك إشعار جديد!
de: Sie haben eine neue Benachrichtigung!
es: ¡Tienes una nueva notificación!
fr: Vous avez une nouvelle notification !
it: Hai una nuova notifica!
ru: У вас новое уведомление!
tr: Yeni bir bildiriminiz var!
zh: 您有新的通知！

# notificationTableInfo
source: (Table {tableNumber})
ar: (طاولة {tableNumber})
de: (Tisch {tableNumber})
es: (Mesa {tableNumber})
it: (Tavolo {tableNumber})
ru: (Стол {tableNumber})
tr: (Masa {tableNumber})
zh: (桌位 {tableNumber})

# notificationOrderApprovedForKitchen
source: 🍳 New Order #{orderId}{tableInfo} sent to kitchen!
ar: 🍳 طلب جديد رقم #{orderId}{tableInfo} تم إرساله إلى المطبخ!
de: 🍳 Neue Bestellung #{orderId}{tableInfo} an die Küche gesendet!
es: 🍳 Nuevo Pedido #{orderId}{tableInfo} enviado a cocina!
fr: 🍳 Nouvelle Commande #{orderId}{tableInfo} envoyée en cuisine !
it: 🍳 Nuovo Ordine #{orderId}{tableInfo} inviato in cucina!
ru: 🍳 Новый заказ #{orderId}{tableInfo} отправлен на кухню!
tr: 🍳 Yeni Sipariş #{orderId}{tableInfo} mutfağa gönderildi!
zh: 🍳 新订单 #{orderId}{tableInfo} 已发送至厨房！

# notificationOrderPreparing
source: ⏳ Order #{orderId} is being prepared...
ar: ⏳ الطلب رقم #{orderId} قيد التحضير...
de: ⏳ Bestellung #{orderId} wird zubereitet...
es: ⏳ Pedido #{orderId} en preparación...
fr: ⏳ Commande #{orderId} en cours de préparation...
it: ⏳ Ordine #{orderId} in preparazione...
ru: ⏳ Заказ #{orderId} готовится...
tr: ⏳ Sipariş #{orderId} hazırlanıyor...
zh: ⏳ 订单 #{orderId} 正在准备中...

# notificationOrderReadyForPickup
source: 🔔 Order #{orderId} is ready - awaiting waiter!
ar: 🔔 الطلب رقم #{orderId} جاهز - في انتظار النادل!
de: 🔔 Bestellung #{orderId} ist fertig - wartet auf den Kellner!
es: 🔔 Pedido #{orderId} listo - ¡esperando camarero!
fr: 🔔 Commande #{orderId} est prête - en attente du serveur !
it: 🔔 Ordine #{orderId} è pronto - in attesa del cameriere!
ru: 🔔 Заказ #{orderId} готов - ожидает официанта!
tr: 🔔 Sipariş #{orderId} hazır - garson bekleniyor!
zh: 🔔 订单 #{orderId} 已准备就绪 - 等待服务员！

# notificationOrderItemAdded
source: ➕ New item added to order #{orderId}!
ar: ➕ تمت إضافة عنصر جديد إلى الطلب #{orderId}!
de: ➕ Neuer Artikel zu Bestellung #{orderId} hinzugefügt!
es: ➕ Nuevo artículo añadido al pedido #{orderId}!
fr: ➕ Nouvel article ajouté à la commande #{orderId} !
it: ➕ Nuovo articolo aggiunto all'ordine #{orderId}!
ru: ➕ Новый товар добавлен в заказ #{orderId}!
tr: ➕ Sipariş #{orderId}'e yeni ürün eklendi!
zh: ➕ 订单 #{orderId} 中添加了新产品！

# notificationGuestOrderPending
source: ⏰ Guest order pending approval: #{orderId}
ar: ⏰ طلب ضيف في انتظار الموافقة: #{orderId}
de: ⏰ Gastbestellung wartet auf Genehmigung: #{orderId}
es: ⏰ Pedido de invitado pendiente de aprobación: #{orderId}
fr: ⏰ Commande invité en attente d'approbation : #{orderId}
it: ⏰ Ordine ospite in attesa di approvazione: #{orderId}
ru: ⏰ Гостевой заказ ожидает одобрения: #{orderId}
tr: ⏰ Misafir siparişi onay bekliyor: #{orderId}
zh: ⏰ 客人订单等待批准: #{orderId}

# notificationOrderNeedsReapproval
source: 🔄 Order #{orderId} needs re-approval!
ar: 🔄 الطلب رقم #{orderId} يحتاج إلى إعادة موافقة!
de: 🔄 Bestellung #{orderId} benötigt erneute Genehmigung!
es: 🔄 Pedido #{orderId} necesita reaprobación!
fr: 🔄 Commande #{orderId} nécessite une nouvelle approbation !
it: 🔄 Ordine #{orderId} richiede nuova approvazione!
ru: 🔄 Заказ #{orderId} требует повторного одобрения!
tr: 🔄 Sipariş #{orderId} yeniden onay bekliyor!
zh: 🔄 订单 #{orderId} 需要重新批准！

# notificationNewOrder
source: 🆕 New order received: #{orderId}{tableInfo}
ar: 🆕 تم استلام طلب جديد: #{orderId}{tableInfo}
de: 🆕 Neue Bestellung eingegangen: #{orderId}{tableInfo}
es: 🆕 Nuevo pedido recibido: #{orderId}{tableInfo}
fr: 🆕 Nouvelle commande reçue : #{orderId}{tableInfo}
it: 🆕 Nuovo ordine ricevuto: #{orderId}{tableInfo}
ru: 🆕 Получен новый заказ: #{orderId}{tableInfo}
tr: 🆕 Yeni sipariş geldi: #{orderId}{tableInfo}
zh: 🆕 收到新订单: #{orderId}{tableInfo}

# ingredientManagementTitle
source: Ingredient Stock Management
ar: إدارة مخزون المكونات
de: Zutaten-Lagerverwaltung
es: Gestión de Stock de Ingredientes
fr: Gestion des Stocks d'Ingrédients
it: Gestione Scorte Ingredienti
ru: Управление запасами ингредиентов
tr: Malzeme Stok Yönetimi
zh: 原料库存管理

# ingredientAddTitle
source: Add New Ingredient
ar: إضافة مكون جديد
de: Neue Zutat hinzufügen
es: Añadir Nuevo Ingrediente
fr: Ajouter un Nouvel Ingrédient
it: Aggiungi Nuovo Ingrediente
ru: Добавить новый ингредиент
tr: Yeni Malzeme Ekle
zh: 添加新原料
