Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# loginPageTitle
source: Log In
ar: تسجيل الدخول
de: Anmelden
es: Iniciar Sesión
fr: Se connecter
it: Accesso
ru: Вход в систему
tr: Giriş Yap
zh: 登录

# usernameLabel
source: Username
ar: اسم المستخدم
de: Benutzername
es: Nombre de Usuario
fr: Nom d'utilisateur
it: Nome Utente
ru: Имя пользователя
tr: Kullanıcı Adı
zh: 用户名

# passwordLabel
source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
ru: Пароль
tr: Şifre
zh: 密码

# usernameHint
source: Please enter your username.
ar: الرجاء إدخال اسم المستخدم الخاص بك.
de: Bitte geben Sie Ihren Benutzernamen ein.
es: Por favor, introduce tu nombre de usuario.
fr: Veuillez saisir votre nom d'utilisateur.
it: Per favore, inserisci il tuo nome utente.
ru: Пожалуйста, введите ваше имя пользователя.
tr: Lütfen kullanıcı adınızı girin.
zh: 请输入您的用户名。

# passwordHint
source: Please enter your password.
ar: الرجاء إدخال كلمة المرور الخاصة بك.
de: Bitte geben Sie Ihr Passwort ein.
es: Por favor, introduce tu contraseña.
fr: Veuillez saisir votre mot de passe.
it: Per favore, inserisci la tua password.
ru: Пожалуйста, введите ваш пароль.
tr: Lütfen şifrenizi girin.
zh: 请输入您的密码。

# loginButtonText
source: Log In
ar: تسجيل الدخول
de: Anmelden
es: Iniciar Sesión
fr: Se connecter
it: Accedi
ru: Войти
tr: Giriş Yap
zh: 登录

# forgotPasswordButtonText
source: Forgot Password?
ar: هل نسيت كلمة المرور؟
de: Passwort vergessen?
es: ¿Olvidaste la Contraseña?
fr: Mot de passe oublié ?
it: Password Dimenticata?
ru: Забыли пароль?
tr: Şifremi Unuttum?
zh: 忘记密码？

# registerPromptText
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ سجل الآن
de: Sie haben noch kein Konto? Registrieren
es: ¿No tienes una cuenta? Regístrate
fr: Vous n'avez pas de compte ? S'inscrire
it: Non hai un account? Registrati
ru: Нет аккаунта? Зарегистрироваться
tr: Hesabın yok mu? Kayıt Ol
zh: 还没有帐户？注册

# loginErrorInvalidCredentials
source: Invalid username or password.
ar: اسم المستخدم أو كلمة المرور غير صالحين.
de: Ungültiger Benutzername oder ungültiges Passwort.
es: Nombre de usuario o contraseña no válidos.
fr: Nom d'utilisateur ou mot de passe invalide.
it: Nome utente o password non validi.
ru: Неверное имя пользователя или пароль.
tr: Kullanıcı adı veya şifre hatalı.
zh: 用户名或密码无效。

# loginErrorAccountInactive
source: Your account is inactive. Please contact the administrator.
ar: حسابك غير نشط. يرجى الاتصال بالمسؤول.
de: Ihr Konto ist inaktiv. Bitte wenden Sie sich an den Administrator.
es: Tu cuenta está inactiva. Por favor, contacta con el administrador.
fr: Votre compte est inactif. Veuillez contacter l'administrateur.
it: Il tuo account è inattivo. Si prega di contattare l'amministratore.
ru: Ваш аккаунт неактивен. Пожалуйста, свяжитесь с администратором.
tr: Hesabınız pasif durumdadır. Lütfen yönetici ile iletişime geçin.
zh: 您的帐户已禁用。请联系管理员。

# loginErrorAccountNotApproved
source: Your account has not yet been approved by the administrator.
ar: لم تتم الموافقة على حسابك بعد من قبل المسؤول.
de: Ihr Konto wurde noch nicht vom Administrator genehmigt.
es: Tu cuenta aún no ha sido aprobada por el administrador.
fr: Votre compte n'a pas encore été approuvé par l'administrateur.
it: Il tuo account non è ancora stato approvato dall'amministratore.
ru: Ваш аккаунт еще не одобрен администратором.
tr: Hesabınız henüz yönetici tarafından onaylanmamıştır.
zh: 您的帐户尚未获得管理员批准。

# registerPageTitle
source: Business Owner Registration
ar: تسجيل مالك العمل
de: Geschäftsinhaber-Registrierung
es: Registro de Propietario de Negocio
fr: Inscription Propriétaire d'Entreprise
it: Registrazione Titolare Attività
ru: Регистрация владельца бизнеса
tr: İşletme Sahibi Kaydı
zh: 商家注册

# emailLabel
source: Email Address
ar: عنوان البريد الإلكتروني
de: E-Mail-Adresse
es: Dirección de Correo Electrónico
fr: Adresse e-mail
it: Indirizzo Email
ru: Адрес электронной почты
tr: E-posta Adresi
zh: 电子邮件地址

# usernameHintRequired
source: Please enter a username
ar: الرجاء إدخال اسم مستخدم
de: Bitte geben Sie einen Benutzernamen ein
es: Por favor, introduce un nombre de usuario
fr: Veuillez saisir un nom d'utilisateur
it: Per favore, inserisci un nome utente
ru: Пожалуйста, введите имя пользователя
tr: Lütfen kullanıcı adı girin
zh: 请输入用户名

# usernameHintMinLength
source: Username must be at least 4 characters long.
ar: يجب أن يتكون اسم المستخدم من 4 أحرف على الأقل.
de: Der Benutzername muss mindestens 4 Zeichen lang sein.
es: El nombre de usuario debe tener al menos 4 caracteres.
fr: Le nom d'utilisateur doit contenir au moins 4 caractères.
it: Il nome utente deve contenere almeno 4 caratteri.
ru: Имя пользователя должно содержать не менее 4 символов.
tr: Kullanıcı adı en az 4 karakter olmalıdır.
zh: 用户名长度必须至少为4个字符。

# emailHintRequired
source: Please enter an email address
ar: الرجاء إدخال عنوان بريد إلكتروني
de: Bitte geben Sie eine E-Mail-Adresse ein
es: Por favor, introduce una dirección de correo electrónico
fr: Veuillez saisir une adresse e-mail
it: Per favore, inserisci un indirizzo email
ru: Пожалуйста, введите адрес электронной почты
tr: Lütfen e-posta adresi girin
zh: 请输入电子邮件地址

# emailHintInvalid
source: Please enter a valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صالح
de: Bitte geben Sie eine gültige E-Mail-Adresse ein
es: Por favor, introduce una dirección de correo electrónico válida
fr: Veuillez saisir une adresse e-mail valide
it: Per favore, inserisci un indirizzo email valido
ru: Пожалуйста, введите действительный адрес электронной почты
tr: Geçerli bir e-posta adresi girin
zh: 请输入有效的电子邮件地址

# passwordHintRequired
source: Please enter a password
ar: الرجاء إدخال كلمة مرور
de: Bitte geben Sie ein Passwort ein
es: Por favor, introduce una contraseña
fr: Veuillez saisir un mot de passe
it: Per favore, inserisci una password
ru: Пожалуйста, введите пароль
tr: Lütfen şifre girin
zh: 请输入密码

# passwordHintMinLength
source: Password must be at least 6 characters long.
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل.
de: Das Passwort muss mindestens 6 Zeichen lang sein.
es: La contraseña debe tener al menos 6 caracteres.
fr: Le mot de passe doit contenir au moins 6 caractères.
it: La password deve contenere almeno 6 caratteri.
ru: Пароль должен содержать не менее 6 символов.
tr: Şifre en az 6 karakter olmalıdır.
zh: 密码长度必须至少为6个字符。

# registerTypeLabel
source: Registration Type
ar: نوع التسجيل
de: Registrierungsart
es: Tipo de Registro
fr: Type d'inscription
it: Tipo di Registrazione
ru: Тип регистрации
tr: Kayıt Türü
zh: 注册类型

# registerTypeBusinessOwner
source: Business Owner
ar: مالك العمل
de: Geschäftsinhaber
es: Propietario de Negocio
fr: Propriétaire d'Entreprise
it: Titolare Attività
ru: Владелец бизнеса
tr: İşletme Sahibi
zh: 商家

# registerButtonText
source: Sign Up
ar: تسجيل
de: Registrieren
es: Registrarse
fr: S'inscrire
it: Registrati
ru: Зарегистрироваться
tr: Kayıt Ol
zh: 注册

# registerSuccessMessage
source: Registration successful! 🎉 You can use the app for free during the trial period.
ar: تم التسجيل بنجاح! 🎉 يمكنك استخدام التطبيق مجانًا خلال الفترة التجريبية.
de: Registrierung erfolgreich! 🎉 Sie können die App während der Testphase kostenlos nutzen.
es: ¡Registro exitoso! 🎉 Puedes usar la aplicación gratis durante el periodo de prueba.
fr: Inscription réussie ! 🎉 Vous pouvez utiliser l'application gratuitement pendant la période d'essai.
it: Registrazione completata! 🎉 Puoi usare l'app gratuitamente durante il periodo di prova.
ru: Регистрация прошла успешно! 🎉 Вы можете бесплатно использовать приложение в течение пробного периода.
tr: Kayıt başarılı! 🎉 Uygulamayı test süresi boyunca ücretsiz olarak kullanabilirsiniz.
zh: 注册成功！🎉 试用期间您可以免费使用本应用。

# registerErrorUsernameExists
source: This username already exists.
ar: اسم المستخدم هذا موجود بالفعل.
de: Dieser Benutzername existiert bereits.
es: Este nombre de usuario ya existe.
fr: Ce nom d'utilisateur existe déjà.
it: Questo nome utente esiste già.
ru: Это имя пользователя уже существует.
tr: Bu kullanıcı adı zaten mevcut.
zh: 此用户名已存在。

# registerErrorEmailExists
source: This email address is already registered.
ar: عنوان البريد الإلكتروني هذا مسجل بالفعل.
de: Diese E-Mail-Adresse ist bereits registriert.
es: Esta dirección de correo electrónico ya está registrada.
fr: Cette adresse e-mail est déjà enregistrée.
it: Questo indirizzo email è già registrato.
ru: Этот адрес электронной почты уже зарегистрирован.
tr: Bu e-posta adresi zaten kayıtlı.
zh: 此电子邮件地址已被注册。

# registerErrorPasswordCommon
source: Password is too common, please choose a stronger password.
ar: كلمة المرور شائعة جدًا، يرجى اختيار كلمة مرور أقوى.
de: Das Passwort ist zu einfach. Bitte wählen Sie ein stärkeres Passwort.
es: La contraseña es demasiado común, por favor, elige una contraseña más segura.
fr: Le mot de passe est trop courant, veuillez choisir un mot de passe plus fort.
it: La password è troppo comune, per favore scegli una password più sicura.
ru: Пароль слишком простой, выберите более надежный пароль.
tr: Şifre çok yaygın, lütfen daha güçlü bir şifre seçin.
zh: 密码过于简单，请选择一个更强的密码。

# addStaffTitle
source: Add New Staff Member
ar: إضافة موظف جديد
de: Neues Personalmitglied hinzufügen
es: Añadir Nuevo Miembro del Personal
fr: Ajouter un Nouveau Membre du Personnel
it: Aggiungi Nuovo Membro Staff
ru: Добавить нового сотрудника
tr: Yeni Personel Ekle
zh: 添加新员工

# editStaffTitle
source: Edit Staff Member
ar: تعديل بيانات الموظف
de: Personalmitglied bearbeiten
es: Editar Miembro del Personal
fr: Modifier le Membre du Personnel
it: Modifica Membro Staff
ru: Редактировать сотрудника
tr: Personel Düzenle
zh: 编辑员工

# addKitchenStaffTitle
source: Add New Kitchen Staff
ar: إضافة موظف مطبخ جديد
de: Neues Küchenpersonal hinzufügen
es: Añadir Nuevo Personal de Cocina
fr: Ajouter un Nouveau Personnel de Cuisine
it: Aggiungi Nuovo Staff Cucina
ru: Добавить нового сотрудника кухни
tr: Yeni Mutfak Personeli Ekle
zh: 添加新的厨房员工

# editKitchenStaffTitle
source: Edit Kitchen Staff
ar: تعديل موظف المطبخ
de: Küchenpersonal bearbeiten
es: Editar Personal de Cocina
fr: Modifier le Personnel de Cuisine
it: Modifica Staff Cucina
ru: Редактировать сотрудника кухни
tr: Mutfak Personeli Düzenle
zh: 编辑厨房员工

# positionLabel
source: Position
ar: المنصب
es: Puesto
fr: Poste
it: Posizione
ru: Должность
tr: Pozisyon
zh: 职位

# positionSalonStaff
source: Front of House Staff
ar: موظف صالة
de: Servicepersonal
es: Personal de Sala
fr: Personnel de Salle
it: Personale di Sala
ru: Обслуживающий персонал
tr: Salon Personeli
zh: 前厅服务员

# positionKitchenStaff
source: Kitchen Staff
ar: موظف مطبخ
de: Küchenpersonal
es: Personal de Cocina
fr: Personnel de Cuisine
it: Personale di Cucina
ru: Персонал кухни
tr: Mutfak Personeli
zh: 厨房员工

# firstNameLabel
source: First Name*
ar: الاسم الأول*
de: Vorname*
es: Nombre*
fr: Prénom*
it: Nome*
ru: Имя*
tr: Adı*
zh: 名字*

# lastNameLabel
source: Last Name*
ar: اسم العائلة*
de: Nachname*
es: Apellido*
fr: Nom*
it: Cognome*
ru: Фамилия*
tr: Soyadı*
zh: 姓氏*

# firstNameRequired
source: Staff first name is required
ar: اسم الموظف الأول مطلوب
de: Der Vorname des Personals ist erforderlich
es: El nombre del personal es obligatorio
fr: Le prénom du personnel est requis
it: Il nome del membro staff è obbligatorio
ru: Требуется имя сотрудника
tr: Personel adı gerekli
zh: 员工名字为必填项

# lastNameRequired
source: Staff last name is required
ar: اسم الموظف الأخير مطلوب
de: Der Nachname des Personals ist erforderlich
es: El apellido del personal es obligatorio
fr: Le nom du personnel est requis
it: Il cognome del membro staff è obbligatorio
ru: Требуется фамилия сотрудника
tr: Personel soyadı gerekli
zh: 员工姓氏为必填项

# passwordNewLabel
source: New Password (Leave empty if no change)
ar: كلمة المرور الجديدة (اتركها فارغة إذا لم يكن هناك تغيير)
de: Neues Passwort (Leer lassen, wenn keine Änderung)
es: Nueva Contraseña (Dejar vacío si no hay cambios)
fr: Nouveau mot de passe (Laisser vide si pas de changement)
it: Nuova Password (Lascia vuoto se non vuoi cambiare)
ru: Новый пароль (Оставьте пустым, если без изменений)
tr: Yeni Şifre (Değişiklik yoksa boş bırakın)
zh: 新密码 (如不更改请留空)

# passwordRequiredLabel
source: Password*
ar: كلمة المرور*
de: Passwort*
es: Contraseña*
fr: Mot de passe*
ru: Пароль*
tr: Şifre*
zh: 密码*

# passwordRequiredHintForNewStaff
source: Password is required for new staff
ar: كلمة المرور مطلوبة للموظفين الجدد
de: Passwort ist für neues Personal erforderlich
es: La contraseña es obligatoria para el nuevo personal
fr: Le mot de passe est requis pour le nouveau personnel
it: La password è obbligatoria per il nuovo staff
ru: Пароль обязателен для нового сотрудника
tr: Yeni personel için şifre gerekli
zh: 新员工需要设置密码

# activeUserLabel
source: Active User
ar: مستخدم نشط
de: Aktiver Benutzer
es: Usuario Activo
fr: Utilisateur Actif
it: Utente Attivo
ru: Активный пользователь
tr: Aktif Kullanıcı
zh: 活跃用户

# permissionPresetLabel
source: Select Permission Preset (Optional)
ar: تحديد إعداد مسبق للأذونات (اختياري)
de: Berechtigungs-Voreinstellung auswählen (Optional)
es: Seleccionar Preajuste de Permisos (Opcional)
fr: Sélectionner un Préréglage d'Autorisation (Facultatif)
it: Seleziona Predefinito Permessi (Opzionale)
ru: Выбрать набор разрешений (Необязательно)
tr: Hazır İzin Seti Seç (Opsiyonel)
zh: 选择权限预设 (可选)

# screenPermissionsLabel
source: Screen Permissions:
ar: أذونات الشاشة:
de: Bildschirm-Berechtigungen:
es: Permisos de Pantalla:
fr: Autorisations d'Écran :
it: Permessi Schermata:
ru: Разрешения экрана:
tr: Ekran İzinleri:
zh: 屏幕权限:

# notificationPermissionsLabel
source: Notification Permissions:
ar: أذونات الإشعارات:
de: Benachrichtigungs-Berechtigungen:
es: Permisos de Notificación:
fr: Autorisations de Notification :
it: Permessi Notifiche:
ru: Разрешения уведомлений:
tr: Alınacak Bildirim İzinleri:
zh: 通知权限:

# accessibleKdsScreensLabel
source: Accessible KDS Screens:
ar: شاشات KDS التي يمكن الوصول إليها:
de: Zugängliche KDS-Bildschirme:
es: Pantallas KDS Accesibles:
fr: Écrans KDS Accessibles :
it: Schermi KDS Accessibili:
ru: Доступные экраны KDS:
tr: Erişilebilir KDS Ekranları:
zh: 可访问的KDS屏幕:

# noKdsAvailable
source: No KDS screen is defined for this business.
ar: لم يتم تعريف شاشة KDS لهذا العمل.
de: Für dieses Unternehmen ist kein KDS-Bildschirm definiert.
es: No hay pantallas KDS definidas para este negocio.
fr: Aucun écran KDS n'est défini pour cette entreprise.
it: Nessuno schermo KDS è definito per questa attività.
ru: Для этого бизнеса не определен экран KDS.
tr: Bu işletme için tanımlı KDS ekranı bulunmuyor.
zh: 此商家未定义KDS屏幕。

# kdsLoadingError
source: Failed to load KDS screens: {error}
ar: فشل في تحميل شاشات KDS: {error}
de: Laden der KDS-Bildschirme fehlgeschlagen: {error}
es: Error al cargar pantallas KDS: {error}
fr: Échec du chargement des écrans KDS : {error}
it: Impossibile caricare gli schermi KDS: {error}
ru: Не удалось загрузить экраны KDS: {error}
tr: KDS ekranları yüklenemedi: {error}
zh: 加载KDS屏幕失败: {error}

# updateButton
source: Update
ar: تحديث
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
it: Aggiorna
ru: Обновить
tr: Güncelle
zh: 更新

# createButton
source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
it: Crea
ru: Создать
tr: Oluştur
zh: 创建

# staffUpdateSuccess
source: Staff member updated successfully.
ar: تم تحديث بيانات الموظف بنجاح.
de: Personalmitglied erfolgreich aktualisiert.
es: Miembro del personal actualizado con éxito.
fr: Membre du personnel mis à jour avec succès.
it: Membro staff aggiornato con successo.
ru: Сотрудник успешно обновлен.
tr: Personel başarıyla güncellendi.
zh: 员工更新成功。

# staffCreateSuccess
source: Staff member created successfully.
ar: تم إنشاء الموظف بنجاح.
de: Personalmitglied erfolgreich erstellt.
es: Miembro del personal creado con éxito.
fr: Membre du personnel créé avec succès.
it: Membro staff creato con successo.
ru: Сотрудник успешно создан.
tr: Personel başarıyla oluşturuldu.
zh: 员工创建成功。

# setupWizardTitle
source: Business Setup ({currentPage}/{totalPages})
ar: إعداد العمل ({currentPage}/{totalPages})
de: Geschäftseinrichtung ({currentPage}/{totalPages})
es: Configuración del Negocio ({currentPage}/{totalPages})
fr: Configuration de l'Entreprise ({currentPage}/{totalPages})
it: Configurazione Attività ({currentPage}/{totalPages})
ru: Настройка бизнеса ({currentPage}/{totalPages})
tr: İşletme Kurulumu ({currentPage}/{totalPages})
zh: 商家设置 ({currentPage}/{totalPages})

# setupWizardStep1Title
source: 1. Create Table Information
ar: 1. إنشاء معلومات الطاولات
de: 1. Tischinformationen erstellen
es: 1. Crear Información de Mesas
fr: 1. Créer les Informations de Table
it: 1. Crea Informazioni Tavoli
ru: 1. Создайте информацию о столах
tr: 1. Masa Bilgilerini Oluşturun
zh: 1. 创建桌位信息

# setupWizardStep2Title
source: 2. Define Kitchen Screens
ar: 2. تعريف شاشات المطبخ
de: 2. Küchenbildschirme definieren
es: 2. Definir Pantallas de Cocina
fr: 2. Définir les Écrans de Cuisine
it: 2. Definisci Schermi Cucina
ru: 2. Определите экраны кухни
tr: 2. Mutfak Ekranlarını Tanımlayın
zh: 2. 定义厨房屏幕

# setupWizardStep3Title
source: 3. Create Your Product Categories
ar: 3. إنشاء فئات منتجاتك
de: 3. Ihre Produktkategorien erstellen
es: 3. Crear Tus Categorías de Productos
fr: 3. Créer Vos Catégories de Produits
it: 3. Crea le Tue Categorie Prodotto
ru: 3. Создайте категории продуктов
tr: 3. Ürün Kategorilerinizi Oluşturun
zh: 3. 创建您的产品类别

# setupWizardStep4Title
source: 4. Create Main Product Information
ar: 4. إنشاء معلومات المنتج الرئيسية
de: 4. Hauptproduktinformationen erstellen
es: 4. Crear Información del Producto Principal
fr: 4. Créer les Informations sur les Produits Principaux
it: 4. Crea Informazioni Prodotto Principale
ru: 4. Создайте основную информацию о продуктах
tr: 4. Ana Ürün Bilgilerini Oluşturun
zh: 4. 创建主要产品信息

# setupWizardStep5Title
source: 5. Create Product Variants and Prices
ar: 5. إنشاء متغيرات المنتج والأسعار
de: 5. Produktvarianten und Preise erstellen
es: 5. Crear Variantes de Producto y Precios
fr: 5. Créer les Variantes et Prix des Produits
it: 5. Crea Varianti Prodotto e Prezzi
ru: 5. Создайте варианты продуктов и цены
tr: 5. Ürün Varyant ve Fiyat Bilgilerini Oluşturun
zh: 5. 创建产品变体和价格

# setupWizardStep6Title
source: 6. Enter Stock Count (Optional)
ar: 6. إدخال عدد المخزون (اختياري)
de: 6. Lagerbestand eingeben (Optional)
es: 6. Introducir Cantidad de Stock (Opcional)
fr: 6. Saisir le Compte de Stock (Facultatif)
it: 6. Inserisci Conteggio Scorte (Opzionale)
ru: 6. Введите количество на складе (Необязательно)
tr: 6. Stok Sayısını Girin (Opsiyonel)
zh: 6. 输入库存数量 (可选)

# setupWizardSuccessMessage
source: Business setup completed successfully! 🎉
ar: اكتمل إعداد العمل بنجاح! 🎉
de: Geschäftseinrichtung erfolgreich abgeschlossen! 🎉
es: ¡Configuración del negocio completada con éxito! 🎉
fr: Configuration de l'entreprise terminée avec succès ! 🎉
it: Configurazione attività completata con successo! 🎉
ru: Настройка бизнеса успешно завершена! 🎉
tr: İşletme kurulumu başarıyla tamamlandı! 🎉
zh: 商家设置成功完成！🎉

# setupWizardErrorMessage
source: Error while completing setup: {error}
ar: حدث خطأ أثناء إكمال الإعداد: {error}
de: Fehler beim Abschließen der Einrichtung: {error}
es: Error al completar la configuración: {error}
fr: Erreur lors de la finalisation de la configuration : {error}
it: Errore durante il completamento della configurazione: {error}
ru: Ошибка при завершении настройки: {error}
tr: Kurulum tamamlanırken hata: {error}
zh: 完成设置时出错: {error}

# setupWizardBackButton
source: Back
ar: رجوع
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ru: Назад
tr: Geri
zh: 返回

# setupWizardSkipButton
source: Skip This Step
ar: تخطي هذه الخطوة
de: Diesen Schritt überspringen
es: Saltar Este Paso
fr: Passer cette étape
it: Salta Questo Passaggio
ru: Пропустить этот шаг
tr: Bu Adımı Atla
zh: 跳过此步骤

# setupWizardFinishButton
source: Finish and Save
ar: إنهاء وحفظ
de: Abschließen und Speichern
es: Finalizar y Guardar
fr: Terminer et Enregistrer
it: Completa e Salva
ru: Завершить и сохранить
tr: Bitir ve Kaydet
zh: 完成并保存

# setupWizardNextButton
source: Next
ar: التالي
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ru: Далее
tr: İleri
zh: 下一步

# takeawayOrderTitle
source: Takeaway Order - {customerName}
ar: طلب سفري - {customerName}
de: Außer-Haus-Bestellung - {customerName}
es: Pedido para Llevar - {customerName}
fr: Commande à Emporter - {customerName}
it: Ordine da Asporto - {customerName}
ru: Заказ на вынос - {customerName}
tr: Paket Sipariş - {customerName}
zh: 外卖订单 - {customerName}

# guestCustomerName
source: Guest
ar: ضيف
de: Gast
es: Invitado
fr: Client
it: Ospite
ru: Гость
tr: Misafir
zh: 客人

# orderStatusPaid
source: (Paid)
ar: (مدفوع)
de: (Bezahlt)
es: (Pagado)
fr: (Payée)
it: (Pagato)
ru: (Оплачено)
tr: (Ödendi)
zh: (已支付)

# orderStatusCancelled
source: Cancelled
ar: ملغى
de: Storniert
es: Cancelado
fr: Annulée
it: Annullato
ru: Отменено
tr: İptal Edildi
zh: 已取消

# orderStatusRejected
source: Rejected
ar: مرفوض
de: Abgelehnt
es: Rechazado
fr: Rejetée
it: Rifiutato
ru: Отклонено
tr: Reddedildi
zh: 已拒绝

# tooltipPrintReceipt
source: Print Receipt
ar: طباعة الإيصال
de: Beleg drucken
es: Imprimir Recibo
fr: Imprimer le Reçu
it: Stampa Ricevuta
ru: Распечатать чек
tr: Fiş Yazdır
zh: 打印收据

# tooltipShowQr
source: Show Customer QR Code
ar: عرض رمز QR للعميل
de: Kunden-QR-Code anzeigen
es: Mostrar Código QR del Cliente
fr: Afficher le Code QR Client
it: Mostra Codice QR Cliente
ru: Показать QR-код клиента
tr: Müşteri QR Kodu Göster
zh: 显示顾客二维码

# tooltipCancelOrder
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# errorNoQrLink
source: No QR link found for this order.
ar: لم يتم العثور على رابط QR لهذا الطلب.
de: Kein QR-Link für diese Bestellung gefunden.
es: No se encontró enlace QR para este pedido.
fr: Aucun lien QR trouvé pour cette commande.
it: Nessun link QR trovato per questo ordine.
ru: Не найдена QR-ссылка для этого заказа.
tr: Bu sipariş için QR linki bulunmuyor.
zh: 此订单未找到二维码链接。

# infoLinkCopied
source: Link copied to clipboard.
ar: تم نسخ الرابط إلى الحافظة.
de: Link in die Zwischenablage kopiert.
es: Enlace copiado al portapapeles.
fr: Lien copié dans le presse-papiers.
it: Link copiato negli appunti.
ru: Ссылка скопирована в буфер обмена.
tr: Link panoya kopyalandı.
zh: 链接已复制到剪贴板。

# errorNoPrinters
source: No registered printers found. Please add one from Printer Settings.
ar: لم يتم العثور على طابعات مسجلة. الرجاء إضافة واحدة من إعدادات الطابعة.
de: Keine registrierten Drucker gefunden. Bitte fügen Sie einen unter 'Druckereinstellungen' hinzu.
es: No se encontraron impresoras registradas. Por favor, añade una desde Ajustes de Impresora.
fr: Aucune imprimante enregistrée trouvée. Veuillez en ajouter une dans les Paramètres d'Imprimante.
it: Nessuna stampante registrata trovata. Per favore aggiungine una dalle Impostazioni Stampante.
ru: Не найдено зарегистрированных принтеров. Пожалуйста, добавьте один в Настройках принтера.
tr: Kayıtlı yazıcı bulunamadı. Lütfen Yazıcı Ayarları'ndan ekleyin.
zh: 未找到已注册的打印机。请从打印机设置中添加。

# infoPrintingCustomerReceipt
source: Printing customer receipt...
ar: جاري طباعة إيصال العميل...
de: Kundenbeleg wird gedruckt...
es: Imprimiendo recibo del cliente...
fr: Impression du reçu client en cours...
it: Stampa ricevuta cliente...
ru: Печать чека клиента...
tr: Müşteri fişi yazdırılıyor...
zh: 正在打印顾客收据...

# errorPrintingReceipt
source: Receipt printing error: {error}
ar: خطأ في طباعة الإيصال: {error}
de: Fehler beim Drucken des Belegs: {error}
es: Error de impresión del recibo: {error}
fr: Erreur d'impression du reçu : {error}
it: Errore stampa ricevuta: {error}
ru: Ошибка печати чека: {error}
tr: Fiş yazdırma hatası: {error}
zh: 收据打印错误: {error}
