Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# reportsChartTitleDailyRange
source: Daily Turnover ({startDate} - {endDate})
ar: الإيرادات اليومية ({startDate} - {endDate})
de: Täglicher Umsatz ({startDate} - {endDate})
es: Facturación Diaria ({startDate} - {endDate})
fr: Chiffre d'Affaires Journalier ({startDate} - {endDate})
it: Fatturato Giornaliero ({startDate} - {endDate})
ru: Ежедневный оборот ({startDate} - {endDate})
tr: Günlük Ciro ({startDate} - {endDate})
zh: 每日营业额 ({startDate} - {endDate})

# reportsChartTitleDailyThisWeek
source: Daily Turnover Distribution (This Week)
ar: توزيع الإيرادات اليومية (هذا الأسبوع)
de: Tägliche Umsatzverteilung (Diese Woche)
es: Distribución de Facturación Diaria (Esta Semana)
fr: Répartition du Chiffre d'Affaires Journalier (Cette Semaine)
it: Distribuzione Fatturato Giornaliero (Questa Settimana)
ru: Распределение ежедневного оборота (На этой неделе)
tr: Günlük Ciro Dağılımı (Bu Hafta)
zh: 每日营业额分布 (本周)

# reportsChartTitleMonthlyRange
source: Monthly Turnover ({startDate} - {endDate})
ar: الإيرادات الشهرية ({startDate} - {endDate})
de: Monatlicher Umsatz ({startDate} - {endDate})
es: Facturación Mensual ({startDate} - {endDate})
fr: Chiffre d'Affaires Mensuel ({startDate} - {endDate})
it: Fatturato Mensile ({startDate} - {endDate})
ru: Ежемесячный оборот ({startDate} - {endDate})
tr: Aylık Ciro ({startDate} - {endDate})
zh: 每月营业额 ({startDate} - {endDate})

# reportsChartTitleMonthlyThisMonth
source: Monthly Turnover ({month} {year})
ar: الإيرادات الشهرية ({month} {year})
de: Monatlicher Umsatz ({month} {year})
es: Facturación Mensual ({month} {year})
fr: Chiffre d'Affaires Mensuel ({month} {year})
it: Fatturato Mensile ({month} {year})
ru: Ежемесячный оборот ({month} {year})
tr: Aylık Ciro ({month} {year})
zh: 每月营业额 ({month} {year})

# reportsChartTitleMonthlyThisYear
source: Monthly Turnover ({year})
ar: الإيرادات الشهرية ({year})
de: Monatlicher Umsatz ({year})
es: Facturación Mensual ({year})
fr: Chiffre d'Affaires Mensuel ({year})
it: Fatturato Mensile ({year})
ru: Ежемесячный оборот ({year})
tr: Aylık Ciro ({year})
zh: 每月营业额 ({year})

# reportsChartTitleMonthlyDefault
source: Monthly Turnover Distribution
ar: توزيع الإيرادات الشهرية
de: Monatliche Umsatzverteilung
es: Distribución de Facturación Mensual
fr: Répartition du Chiffre d'Affaires Mensuel
it: Distribuzione Fatturato Mensile
ru: Распределение ежемесячного оборота
tr: Aylık Ciro Dağılımı
zh: 每月营业额分布

# reportsChartTitleNoData
source: Turnover Chart (No Data)
ar: مخطط الإيرادات (لا توجد بيانات)
de: Umsatz-Diagramm (Keine Daten)
es: Gráfico de Facturación (Sin Datos)
fr: Graphique du Chiffre d'Affaires (Aucune Donnée)
it: Grafico Fatturato (Nessun Dato)
ru: График оборота (Нет данных)
tr: Ciro Grafiği (Veri Yok)
zh: 营业额图表 (无数据)

# reportsSummaryHeaderProperty
source: Property
ar: الخاصية
de: Eigenschaft
es: Propiedad
fr: Propriété
it: Proprietà
ru: Свойство
tr: Özellik
zh: 属性

# reportsSummaryHeaderValue
source: Value
ar: القيمة
de: Wert
es: Valor
fr: Valeur
it: Valore
ru: Значение
tr: Değer
zh: 值

# reportsSummaryTotalTurnover
source: Total Turnover
ar: إجمالي الإيرادات
de: Gesamtumsatz
es: Facturación Total
fr: Chiffre d'Affaires Total
it: Fatturato Totale
ru: Общий оборот
tr: Toplam Ciro
zh: 总营业额

# reportsSummaryTotalOrders
source: Total Orders
ar: إجمالي الطلبات
de: Gesamtbestellungen
es: Pedidos Totales
fr: Commandes Totales
it: Ordini Totali
ru: Общее количество заказов
tr: Toplam Sipariş
zh: 总订单数

# reportsSummaryBestSelling
source: Best Selling
ar: الأكثر مبيعًا
de: Meistverkauft
es: Más Vendido
fr: Meilleures Ventes
it: Più Venduto
ru: Самый продаваемый
tr: En Çok Satan
zh: 最畅销

# reportsSummaryLeastSelling
source: Least Selling
ar: الأقل مبيعًا
de: Am wenigsten verkauft
es: Menos Vendido
fr: Moins Bonnes Ventes
it: Meno Venduto
ru: Наименее продаваемый
tr: En Az Satan
zh: 最不畅销

# reportsSummaryItemCount
source: {count} pieces
ar: {count} قطعة
de: {count} Stück
es: {count} unidades
fr: {count} unités
it: {count} pezzi
ru: {count} шт.
tr: {count} adet
zh: {count} 件

# reportsPickDateTooltip
source: Select Date Range
ar: تحديد نطاق التاريخ
de: Datumsbereich auswählen
es: Seleccionar Rango de Fechas
fr: Sélectionner la Plage de Dates
it: Seleziona Intervallo Date
ru: Выбрать диапазон дат
tr: Tarih Aralığı Seç
zh: 选择日期范围

# reportsSelectedDateRange
source: Selected Date: {startDate} - {endDate}
ar: التاريخ المحدد: {startDate} - {endDate}
de: Ausgewähltes Datum: {startDate} - {endDate}
es: Fecha Seleccionada: {startDate} - {endDate}
fr: Date Sélectionnée : {startDate} - {endDate}
it: Data Selezionata: {startDate} - {endDate}
ru: Выбранная дата: {startDate} - {endDate}
tr: Seçili Tarih: {startDate} - {endDate}
zh: 选定日期: {startDate} - {endDate}

# pagerManagementTitle
source: Pager Management
ar: إدارة أجهزة النداء
de: Pager-Verwaltung
es: Gestión de Localizadores
fr: Gestion des Bipers
it: Gestione Pager
ru: Управление пейджерами
tr: Çağrı Cihazı Yönetimi
zh: 传呼机管理

# pagerTooltipAdd
source: Add/Save New Pager
ar: إضافة/حفظ جهاز نداء جديد
de: Neuen Pager hinzufügen/speichern
es: Añadir/Guardar Nuevo Localizador
fr: Ajouter/Enregistrer un Nouveau Biper
it: Aggiungi/Salva Nuovo Pager
ru: Добавить/Сохранить новый пейджер
tr: Yeni Cihaz Ekle/Kaydet
zh: 添加/保存新传呼机

# pagerTooltipScanBle
source: Scan Bluetooth Devices
ar: مسح أجهزة البلوتوث
de: Bluetooth-Geräte scannen
es: Escanear Dispositivos Bluetooth
fr: Scanner les Appareils Bluetooth
it: Scansiona Dispositivi Bluetooth
ru: Сканировать устройства Bluetooth
tr: Bluetooth Cihazlarını Tara
zh: 扫描蓝牙设备

# pagerTooltipRefreshList
source: Refresh List
ar: تحديث القائمة
de: Liste aktualisieren
es: Actualizar Lista
fr: Actualiser la Liste
it: Aggiorna Elenco
ru: Обновить список
tr: Listeyi Yenile
zh: 刷新列表

# pagerStatusBle
source: BT Status: {status}
ar: حالة البلوتوث: {status}
es: Estado BT: {status}
fr: Statut BT : {status}
it: Stato BT: {status}
ru: Статус BT: {status}
tr: BT Durumu: {status}
zh: BT 状态: {status}

# pagerStatusBleWaiting
source: Awaiting Bluetooth status...
ar: في انتظار حالة البلوتوث...
de: Warten auf Bluetooth-Status...
es: Esperando estado de Bluetooth...
fr: En attente du statut Bluetooth...
it: In attesa di stato Bluetooth...
ru: Ожидание статуса Bluetooth...
tr: Bluetooth durumu bekleniyor...
zh: 正在等待蓝牙状态...

# pagerNoDevicesFound
source: No pagers are registered in the system. You can add one with the '+' button or by scanning.
ar: لم يتم تسجيل أي أجهزة نداء في النظام. يمكنك إضافة واحد باستخدام زر '+' أو عن طريق المسح الضوئي.
de: Es sind keine Pager im System registriert. Sie können einen mit der Schaltfläche '+' oder durch Scannen hinzufügen.
es: No hay localizadores registrados en el sistema. Puedes añadir uno con el botón '+' o escaneando.
fr: Aucun biper n'est enregistré dans le système. Vous pouvez en ajouter un avec le bouton '+' ou en scannant.
it: Nessun pager è registrato nel sistema. Puoi aggiungerne uno con il pulsante '+' o tramite scansione.
ru: В системе не зарегистрировано пейджеров. Вы можете добавить их с помощью кнопки '+' или путем сканирования.
tr: Sisteme kayıtlı çağrı cihazı bulunmuyor. '+' butonu ile veya tarayarak ekleyebilirsiniz.
zh: 系统中未注册传呼机。 您可以使用“+”按钮或通过扫描添加。

# pagerHeaderInUse
source: In-Use Pagers
ar: أجهزة النداء قيد الاستخدام
de: In Gebrauch befindliche Pager
es: Localizadores en Uso
fr: Bipers en Cours d'Utilisation
it: Pager in Uso
ru: Используемые пейджеры
tr: Kullanımda Olan Cihazlar
zh: 使用中传呼机

# pagerHeaderAvailable
source: Available Pagers
ar: أجهزة النداء المتاحة
de: Verfügbare Pager
es: Localizadores Disponibles
fr: Bipers Disponibles
it: Pager Disponibili
ru: Доступные пейджеры
tr: Boşta Olan Cihazlar
zh: 可用传呼机

# pagerHeaderOtherStatus
source: Pagers with Other Status
ar: أجهزة النداء بحالة أخرى
de: Pager mit anderem Status
es: Localizadores con Otro Estado
fr: Bipers avec Autre Statut
it: Pager con Altro Stato
ru: Пейджеры с другим статусом
tr: Diğer Durumdaki Cihazlar
zh: 其他状态的传呼机

# pagerCardDeviceId
source: Device ID: {id}
ar: معرف الجهاز: {id}
de: Geräte-ID: {id}
es: ID de Dispositivo: {id}
fr: ID de l'Appareil : {id}
it: ID Dispositivo: {id}
ru: ID устройства: {id}
tr: Cihaz ID: {id}
zh: 设备 ID: {id}

# pagerCardStatus
source: Status: {status}
ar: الحالة: {status}
es: Estado: {status}
fr: Statut : {status}
it: Stato: {status}
ru: Статус: {status}
tr: Durum: {status}
zh: 状态: {status}

# pagerCardOrderId
source: Order ID: #{id}
ar: معرف الطلب: #{id}
de: Bestell-ID: #{id}
es: ID de Pedido: #{id}
fr: ID de la Commande : #{id}
it: ID Ordine: #{id}
ru: ID заказа: #{id}
tr: Sipariş ID: #{id}
zh: 订单 ID: #{id}

# pagerCardNotes
source: Notes: {notes}
ar: ملاحظات: {notes}
de: Notizen: {notes}
es: Notas: {notes}
it: Note: {notes}
ru: Примечания: {notes}
tr: Not: {notes}
zh: 备注: {notes}

# pagerMenuSendTestNotification
source: Send Test Notification
ar: إرسال إشعار تجريبي
de: Testbenachrichtigung senden
es: Enviar Notificación de Prueba
fr: Envoyer une Notification de Test
it: Invia Notifica di Test
ru: Отправить тестовое уведомление
tr: Test Bildirimi Gönder
zh: 发送测试通知

# pagerMenuMarkAsAvailable
source: Mark as Available
ar: وضع كـ متاح
de: Als verfügbar markieren
es: Marcar como Disponible
fr: Marquer comme Disponible
it: Segna come Disponibile
ru: Отметить как доступный
tr: Boşta Olarak İşaretle
zh: 标记为可用

# pagerMenuMarkAsCharging
source: Mark as Charging
ar: وضع كـ جاري الشحن
de: Als wird geladen markieren
es: Marcar como Cargando
fr: Marquer comme en Charge
it: Segna come In Carica
ru: Отметить как заряжающийся
tr: Şarjda Olarak İşaretle
zh: 标记为充电中

# pagerMenuMarkAsOutOfService
source: Mark as Out of Service
ar: وضع كـ خارج الخدمة
de: Als außer Betrieb markieren
es: Marcar como Fuera de Servicio
fr: Marquer comme Hors Service
it: Segna come Fuori Servizio
ru: Отметить как неисправный
tr: Servis Dışı Bırak
zh: 标记为停止服务

# pagerMenuDeleteFromSystem
source: Delete from System
ar: حذف من النظام
de: Aus dem System löschen
es: Eliminar del Sistema
fr: Supprimer du Système
it: Elimina dal Sistema
ru: Удалить из системы
tr: Sistemden Sil
zh: 从系统中删除

# pagerDialogDeleteTitle
source: Delete Pager
ar: حذف جهاز النداء
de: Pager löschen
es: Eliminar Localizador
fr: Supprimer le Biper
it: Elimina Pager
ru: Удалить пейджер
tr: Cihazı Sil
zh: 删除传呼机

# pagerInfoDeviceDeleted
source: Pager deleted.
ar: تم حذف جهاز النداء.
de: Pager gelöscht.
es: Localizador eliminado.
fr: Biper supprimé.
it: Pager eliminato.
ru: Пейджер удален.
tr: Cihaz silindi.
zh: 传呼机已删除。

# pagerErrorDeleting
source: Deletion error: {error}
ar: خطأ في الحذف: {error}
de: Fehler beim Löschen: {error}
es: Error de eliminación: {error}
fr: Erreur de suppression : {error}
it: Errore di eliminazione: {error}
ru: Ошибка удаления: {error}
tr: Silme hatası: {error}
zh: 删除错误: {error}

# pagerTestNotificationSuccess
source: Test notification ({pagerName}) sent.
ar: تم إرسال الإشعار التجريبي ({pagerName}).
de: Testbenachrichtigung ({pagerName}) gesendet.
es: Notificación de prueba ({pagerName}) enviada.
fr: Notification de test ({pagerName}) envoyée.
it: Notifica di test ({pagerName}) inviata.
ru: Тестовое уведомление ({pagerName}) отправлено.
tr: Test bildirimi ({pagerName}) gönderildi.
zh: 测试通知 ({pagerName}) 已发送。

# pagerTestNotificationFailure
source: Failed to send notification.
ar: فشل في إرسال الإشعار.
de: Senden der Benachrichtigung fehlgeschlagen.
es: Error al enviar notificación.
fr: Échec de l'envoi de la notification.
it: Impossibile inviare la notifica.
ru: Не удалось отправить уведомление.
tr: Bildirim gönderilemedi.
zh: 发送通知失败。

# pagerDefaultDeviceName
source: Device
ar: الجهاز
de: Gerät
es: Dispositivo
fr: Appareil
it: Dispositivo
ru: Устройство
tr: Cihaz
zh: 设备

# pagerDialogUpdateStatusTitle
source: Update Status
ar: تحديث الحالة
de: Status aktualisieren
es: Actualizar Estado
fr: Mettre à Jour le Statut
it: Aggiorna Stato
ru: Обновить статус
tr: Durum Güncelleme
zh: 更新状态

# pagerDialogUpdateStatusContent
source: Are you sure you want to change the status of '{pagerName}' to '{status}'?
ar: هل أنت متأكد أنك تريد تغيير حالة '{pagerName}' إلى '{status}'؟
de: Sind Sie sicher, dass Sie den Status von '{pagerName}' auf '{status}' ändern möchten?
es: ¿Estás seguro de que quieres cambiar el estado de '{pagerName}' a '{status}'?
fr: Êtes-vous sûr de vouloir changer le statut de '{pagerName}' à '{status}' ?
it: Sei sicuro di voler cambiare lo stato di '{pagerName}' a '{status}'?
ru: Вы уверены, что хотите изменить статус '{pagerName}' на '{status}'?
tr: '{pagerName}' cihazının durumunu '{status}' olarak değiştirmek istediğinize emin misiniz?
zh: 您确定要将“{pagerName}”的状态更改为“{status}”吗？

# pagerButtonConfirmChange
source: Yes, Change
ar: نعم، تغيير
de: Ja, ändern
es: Sí, Cambiar
fr: Oui, Changer
it: Sì, Cambia
ru: Да, изменить
tr: Evet, Değiştir
zh: 是，更改

# pagerInfoStatusUpdated
source: Pager status updated.
ar: تم تحديث حالة جهاز النداء.
de: Pager-Status aktualisiert.
es: Estado del localizador actualizado.
fr: Statut du biper mis à jour.
it: Stato pager aggiornato.
ru: Статус пейджера обновлен.
tr: Çağrı cihazı durumu güncellendi.
zh: 传呼机状态已更新。

# pagerErrorStatusUpdate
source: Error while updating status: {error}
ar: خطأ أثناء تحديث الحالة: {error}
de: Fehler beim Aktualisieren des Status: {error}
es: Error al actualizar estado: {error}
fr: Erreur lors de la mise à jour du statut : {error}
it: Errore durante l'aggiornamento dello stato: {error}
ru: Ошибка при обновлении статуса: {error}
tr: Durum güncellenirken hata: {error}
zh: 更新状态时出错: {error}

# pagerDialogAddTitle
source: Add/Save New Pager
ar: إضافة/حفظ جهاز نداء جديد
de: Neuen Pager hinzufügen/speichern
es: Añadir/Guardar Nuevo Localizador
fr: Ajouter/Enregistrer un Nouveau Biper
it: Aggiungi/Salva Nuovo Pager
ru: Добавить/Сохранить новый пейджер
tr: Yeni Çağrı Cihazı Ekle/Kaydet
zh: 添加/保存新传呼机

# pagerButtonScanning
source: Scanning...
ar: جاري المسح...
de: Wird gescannt...
es: Escaneando...
fr: Scan en cours...
it: Scansione in corso...
ru: Сканирование...
tr: Taranıyor...
zh: 正在扫描...

# pagerButtonScanAndSelect
source: Scan and Select Bluetooth Devices
ar: مسح واختيار أجهزة البلوتوث
de: Bluetooth-Geräte scannen und auswählen
es: Escanear y Seleccionar Dispositivos Bluetooth
fr: Scanner et Sélectionner les Appareils Bluetooth
it: Scansiona e Seleziona Dispositivi Bluetooth
ru: Сканировать и выбрать устройства Bluetooth
tr: Bluetooth Cihazlarını Tara ve Seç
zh: 扫描并选择蓝牙设备

# pagerDiscoveredDevicesTitle
source: Discovered Bluetooth Devices
ar: أجهزة البلوتوث المكتشفة
de: Gefundene Bluetooth-Geräte
es: Dispositivos Bluetooth Descubiertos
fr: Appareils Bluetooth Découverts
it: Dispositivi Bluetooth Scoperti
ru: Обнаруженные устройства Bluetooth
tr: Bulunan Bluetooth Cihazları
zh: 发现的蓝牙设备

# pagerUnknownDevice
source: Unknown Device
ar: جهاز غير معروف
de: Unbekanntes Gerät
es: Dispositivo Desconocido
fr: Appareil Inconnu
it: Dispositivo Sconosciuto
ru: Неизвестное устройство
tr: Bilinmeyen Cihaz
zh: 未知设备

# pagerInfoNoBleDevicesFound
source: No Bluetooth devices found nearby.
ar: لم يتم العثور على أجهزة بلوتوث قريبة.
de: Keine Bluetooth-Geräte in der Nähe gefunden.
es: No se encontraron dispositivos Bluetooth cercanos.
fr: Aucun appareil Bluetooth trouvé à proximité.
it: Nessun dispositivo Bluetooth trovato nelle vicinanze.
ru: Поблизости не найдено устройств Bluetooth.
tr: Çevrede Bluetooth cihazı bulunamadı.
zh: 附近未找到蓝牙设备。

# pagerLabelDeviceIdRequired
source: Device ID (MAC Address)*
ar: معرف الجهاز (عنوان MAC)*
de: Geräte-ID (MAC-Adresse)*
es: ID de Dispositivo (Dirección MAC)*
fr: ID de l'Appareil (Adresse MAC)*
it: ID Dispositivo (Indirizzo MAC)*
ru: ID устройства (MAC-адрес)*
tr: Cihaz ID (MAC Adresi)*
zh: 设备 ID (MAC 地址)*

# pagerValidatorDeviceIdRequired
source: Device ID is required.
ar: معرف الجهاز مطلوب.
de: Geräte-ID ist erforderlich.
es: El ID de dispositivo es obligatorio.
fr: L'ID de l'appareil est requis.
it: L'ID Dispositivo è obbligatorio.
ru: Требуется ID устройства.
tr: Cihaz ID gerekli.
zh: 设备 ID 为必填项。

# pagerLabelDeviceNameOptional
source: Device Name (Optional)
ar: اسم الجهاز (اختياري)
de: Gerätename (Optional)
es: Nombre del Dispositivo (Opcional)
fr: Nom de l'Appareil (Facultatif)
it: Nome Dispositivo (Opzionale)
ru: Имя устройства (Необязательно)
tr: Cihaz Adı (Opsiyonel)
zh: 设备名称 (可选)

# pagerLabelNotesOptional
source: Notes (Optional)
ar: ملاحظات (اختياري)
de: Notizen (Optional)
es: Notas (Opcional)
fr: Notes (Facultatif)
it: Note (Opzionale)
ru: Примечания (Необязательно)
tr: Notlar (Opsiyonel)
zh: 备注 (可选)

# pagerButtonAdd
source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить
tr: Ekle
zh: 添加

# pagerStatusAvailable
source: Available
ar: متاح
de: Verfügbar
es: Disponible
fr: Disponible
it: Disponibile
ru: Доступен
tr: Boşta
zh: 可用

# pagerStatusInUse
source: In Use
ar: قيد الاستخدام
de: In Gebrauch
es: En Uso
fr: En Utilisation
it: In Uso
ru: Используется
tr: Kullanımda
zh: 使用中

# pagerStatusCharging
source: Charging
ar: جاري الشحن
de: Wird geladen
es: Cargando
fr: En Charge
it: In Carica
ru: Заряжается
tr: Şarj Oluyor
zh: 充电中

# pagerStatusLowBattery
source: Low Battery
ar: بطارية منخفضة
de: Niedriger Akku
es: Batería Baja
fr: Batterie Faible
it: Batteria Scarica
ru: Низкий заряд батареи
tr: Düşük Batarya
zh: 低电量

# pagerStatusOutOfService
source: Out of Service
ar: خارج الخدمة
de: Außer Betrieb
es: Fuera de Servicio
fr: Hors Service
it: Fuori Servizio
ru: Неисправен
tr: Servis Dışı
zh: 停止服务

# createOrderErrorCannotTransfer
source: This order cannot be transferred: {status}
ar: لا يمكن تحويل هذا الطلب: {status}
de: Diese Bestellung kann nicht übertragen werden: {status}
es: Este pedido no puede ser transferido: {status}
fr: Cette commande ne peut pas être transférée : {status}
it: Questo ordine non può essere trasferito: {status}
ru: Этот заказ не может быть передан: {status}
tr: Bu sipariş transfer edilemez: {status}
zh: 此订单无法转移: {status}

# createOrderErrorAlreadyProcessed
source: This order has already been processed, canceled, or completed.
ar: تمت معالجة هذا الطلب أو إلغاؤه أو إكماله بالفعل.
de: Diese Bestellung wurde bereits bearbeitet, storniert oder abgeschlossen.
es: Este pedido ya ha sido procesado, cancelado o completado.
fr: Cette commande a déjà été traitée, annulée ou complétée.
it: Questo ordine è già stato elaborato, annullato o completato.
ru: Этот заказ уже был обработан, отменен или завершен.
tr: Bu sipariş zaten işlem görmüş, iptal edilmiş veya tamamlanmış.
zh: 此订单已被处理、取消或完成。

# createOrderTooltipGoHome
source: Home
ar: الرئيسية
de: Startseite
es: Inicio
fr: Accueil
ru: Главная
tr: Ana Sayfa
zh: 首页

# createOrderButtonRetry
source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ru: Повторить
tr: Tekrar Dene
zh: 重试

# manageTablesTitle
source: Table Management
ar: إدارة الطاولات
de: Tischverwaltung
es: Gestión de Mesas
fr: Gestion des Tables
it: Gestione Tavoli
ru: Управление столами
tr: Masa Yönetimi
zh: 桌位管理

# manageTablesErrorLoading
source: An error occurred while fetching table information: {statusCode}
ar: حدث خطأ أثناء جلب معلومات الطاولة: {statusCode}
de: Beim Abrufen der Tischinformationen ist ein Fehler aufgetreten: {statusCode}
es: Ocurrió un error al obtener la información de la mesa: {statusCode}
fr: Une erreur s'est produite lors de la récupération des informations de table : {statusCode}
it: Si è verificato un errore durante il recupero delle informazioni sui tavoli: {statusCode}
ru: Произошла ошибка при получении информации о столах: {statusCode}
tr: Masa bilgileri alınırken hata oluştu: {statusCode}
zh: 获取桌位信息时发生错误: {statusCode}

# manageTablesDialogAddTitle
source: Create New Table
ar: إنشاء طاولة جديدة
de: Neuen Tisch erstellen
es: Crear Nueva Mesa
fr: Créer une Nouvelle Table
it: Crea Nuovo Tavolo
ru: Создать новый стол
tr: Yeni Masa Oluştur
zh: 创建新桌位

# manageTablesDialogEditTitle
source: Edit Table
ar: تعديل الطاولة
de: Tisch bearbeiten
es: Editar Mesa
fr: Modifier la Table
it: Modifica Tavolo
ru: Редактировать стол
tr: Masayı Düzenle
zh: 编辑桌位

# manageTablesLabelTableNumber
source: Table Number
ar: رقم الطاولة
de: Tischnummer
es: Número de Mesa
fr: Numéro de Table
it: Numero Tavolo
ru: Номер стола
tr: Masa Numarası
zh: 桌位号

# manageTablesValidatorEnterNumber
source: Please enter a table number
ar: الرجاء إدخال رقم الطاولة
de: Bitte geben Sie eine Tischnummer ein
es: Por favor, introduce un número de mesa
fr: Veuillez saisir un numéro de table
it: Per favore, inserisci un numero di tavolo
ru: Пожалуйста, введите номер стола
tr: Lütfen masa numarası girin
zh: 请输入桌位号

# manageTablesValidatorInvalidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صالح
de: Bitte geben Sie eine gültige Nummer ein
es: Por favor, introduce un número válido
fr: Veuillez saisir un numéro valide
it: Per favore, inserisci un numero valido
ru: Пожалуйста, введите действительный номер
tr: Geçerli bir sayı girin
zh: 请输入有效的号码

# manageTablesInfoCreated
source: Table created successfully!
ar: تم إنشاء الطاولة بنجاح!
de: Tisch erfolgreich erstellt!
es: ¡Mesa creada con éxito!
fr: Table créée avec succès !
it: Tavolo creato con successo!
ru: Стол успешно создан!
tr: Masa başarıyla oluşturuldu!
zh: 桌位创建成功！

# manageTablesInfoUpdated
source: Table updated successfully!
ar: تم تحديث الطاولة بنجاح!
de: Tisch erfolgreich aktualisiert!
es: ¡Mesa actualizada con éxito!
fr: Table mise à jour avec succès !
it: Tavolo aggiornato con successo!
ru: Стол успешно обновлен!
tr: Masa başarıyla güncellendi!
zh: 桌位更新成功！

# manageTablesErrorGeneric
source: An error occurred during the operation: {error}
ar: حدث خطأ أثناء العملية: {error}
de: Während des Vorgangs ist ein Fehler aufgetreten: {error}
es: Ocurrió un error durante la operación: {error}
fr: Une erreur s'est produite pendant l'opération : {error}
it: Si è verificato un errore durante l'operazione: {error}
ru: Произошла ошибка во время операции: {error}
tr: İşlem sırasında bir hata oluştu: {error}
zh: 操作期间发生错误: {error}

# manageTablesButtonCreate
source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
it: Crea
ru: Создать
tr: Oluştur
zh: 创建

# manageTablesDialogDeleteTitle
source: Delete Table
ar: حذف الطاولة
de: Tisch löschen
es: Eliminar Mesa
fr: Supprimer la Table
it: Elimina Tavolo
ru: Удалить стол
tr: Masayı Sil
zh: 删除桌位

# manageTablesDialogDeleteContent
source: Are you sure you want to delete this table? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه الطاولة؟ لا يمكن التراجع عن هذا الإجراء.
de: Sind Sie sicher, dass Sie diesen Tisch löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar esta mesa? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cette table ? Cette action est irréversible.
it: Sei sicuro di voler eliminare questo tavolo? Questa azione non può essere annullata.
ru: Вы уверены, что хотите удалить этот стол? Это действие необратимо.
tr: Bu masayı silmek istediğinize emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除此桌位吗？此操作无法撤销。

# manageTablesInfoDeleted
source: Table deleted successfully.
ar: تم حذف الطاولة بنجاح.
de: Tisch erfolgreich gelöscht.
es: Mesa eliminada con éxito.
fr: Table supprimée avec succès.
it: Tavolo eliminato con successo.
ru: Стол успешно удален.
tr: Masa başarıyla silindi.
zh: 桌位删除成功。

# manageTablesErrorDeleting
source: Error while deleting table: {error}
ar: خطأ أثناء حذف الطاولة: {error}
de: Fehler beim Löschen des Tisches: {error}
es: Error al eliminar mesa: {error}
fr: Erreur lors de la suppression de la table : {error}
it: Errore durante l'eliminazione del tavolo: {error}
ru: Ошибка при удалении стола: {error}
tr: Masa silinirken hata: {error}
zh: 删除桌位时出错: {error}
