Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# menuItemIsFromRecipeSubtitleNo
source: No, it is a directly sold product (e.g., Canned Coke).
ar: لا، إنه منتج يُباع مباشرة (مثل علبة كولا).
de: Nein, es ist ein direkt verkauftes Produkt (z. B. Dosen-Cola).
es: No, es un producto vendido directamente (ej. Coca-Cola enlatada).
fr: Non, c'est un produit vendu directement (ex: Coca en boîte).
it: No, è un prodotto venduto direttamente (es. Coca in Lattina).
ru: Нет, это продукт, продаваемый напрямую (например, Банка Колы).
tr: Hayır, doğrudan satılan bir ürün (örn: Kutu Kola).
zh: 否，它是直接销售的产品 (例如: 罐装可乐)。

# menuItemPriceLabel
source: Sales Price
ar: سعر البيع
de: Verkaufspreis
es: Precio de Venta
fr: Prix de Vente
it: Prezzo di Vendita
ru: Цена продажи
tr: Satış Fiyatı
zh: 销售价格

# homeMenuManageWebsite
source: Manage My Website
ar: إدارة موقعي الإلكتروني
de: Meine Website verwalten
es: Gestionar Mi Sitio Web
fr: Gérer Mon Site Web
it: Gestisci il Mio Sito Web
ru: Управление моим сайтом
tr: Web Sitemi Yönet
zh: 管理我的网站

# homeMenuCompletedOrders
source: Completed Orders
ar: الطلبات المكتملة
de: Abgeschlossene Bestellungen
es: Pedidos Completados
fr: Commandes Terminées
it: Ordini Completati
ru: Завершенные заказы
tr: Tamamlanan Siparişler
zh: 已完成订单

# homeMenuReports
source: Reports
ar: التقارير
de: Berichte
es: Informes
fr: Rapports
it: Report
ru: Отчеты
tr: Raporlar
zh: 报告

# homeMenuShiftSchedule
source: Shift Assignments
ar: جداول المناوبة
de: Schichtzuweisungen
es: Asignaciones de Turnos
fr: Assignations de Quart
it: Assegnazioni Turni
ru: Назначения смен
tr: Vardiya Atamaları
zh: 班次安排

# homeMenuShiftTemplates
source: Shift Templates
ar: قوالب المناوبة
de: Schichtvorlagen
es: Plantillas de Turnos
fr: Modèles de Quart
it: Modelli di Turno
ru: Шаблоны смен
tr: Vardiya Şablonları
zh: 班次模板

# homeMenuManageTables
source: Table Management
ar: إدارة الطاولات
de: Tischverwaltung
es: Gestión de Mesas
fr: Gestion des Tables
it: Gestione Tavoli
ru: Управление столами
tr: Masa Yönetimi
zh: 桌位管理

# websiteSettingsSuccessSave
source: Website settings saved successfully.
ar: تم حفظ إعدادات الموقع بنجاح.
de: Website-Einstellungen erfolgreich gespeichert.
es: Ajustes del sitio web guardados con éxito.
fr: Paramètres du site web enregistrés avec succès.
it: Impostazioni sito web salvate con successo.
ru: Настройки веб-сайта успешно сохранены.
tr: Web sitesi ayarları başarıyla kaydedildi.
zh: 网站设置保存成功。

# websiteSettingsErrorSave
source: An error occurred while saving website settings: {details}
ar: حدث خطأ أثناء حفظ إعدادات الموقع: {details}
de: Beim Speichern der Website-Einstellungen ist ein Fehler aufgetreten: {details}
es: Ocurrió un error al guardar los ajustes del sitio web: {details}
fr: Une erreur s'est produite lors de l'enregistrement des paramètres du site web : {details}
it: Si è verificato un errore durante il salvataggio delle impostazioni del sito web: {details}
ru: Произошла ошибка при сохранении настроек веб-сайта: {details}
tr: Web sitesi ayarları kaydedilirken hata oluştu: {details}
zh: 保存网站设置时发生错误: {details}

# websiteSettingsPickColor
source: Pick Color
ar: اختيار اللون
de: Farbe auswählen
es: Elegir Color
fr: Choisir la Couleur
it: Scegli Colore
ru: Выбрать цвет
tr: Renk Seçin
zh: 选择颜色

# dialogButtonDone
source: Done
ar: تم
de: Fertig
es: Hecho
fr: Terminé
it: Fatto
ru: Готово
tr: Tamam
zh: 完成

# homeMenuWebsiteSettings
source: Website Settings
ar: إعدادات الموقع الإلكتروني
de: Website-Einstellungen
es: Ajustes del Sitio Web
fr: Paramètres du Site Web
it: Impostazioni Sito Web
ru: Настройки веб-сайта
tr: Web Sitesi Ayarları
zh: 网站设置

# websiteSettingsSectionAbout
source: About Section
ar: قسم حول
de: Über uns
es: Sección Acerca de
fr: Section À Propos
it: Sezione Chi Siamo
ru: Раздел «О нас»
tr: Hakkımızda Bölümü
zh: 关于部分

# websiteSettingsLabelAboutTitle
source: About Title
ar: عنوان حول
de: Titel 'Über uns'
es: Título Acerca de
fr: Titre À Propos
it: Titolo Chi Siamo
ru: Заголовок «О нас»
tr: Hakkımızda Başlığı
zh: 关于标题

# websiteSettingsLabelAboutDesc
source: About Description
ar: وصف حول
de: Beschreibung 'Über uns'
es: Descripción Acerca de
fr: Description À Propos
it: Descrizione Chi Siamo
ru: Описание «О нас»
tr: Hakkımızda Açıklaması
zh: 关于描述

# websiteSettingsLabelAboutImage
source: About Image
ar: صورة حول
de: Bild 'Über uns'
es: Imagen Acerca de
fr: Image À Propos
it: Immagine Chi Siamo
ru: Изображение «О нас»
tr: Hakkımızda Görseli
zh: 关于图片

# websiteSettingsSectionContact
source: Contact Information
ar: معلومات الاتصال
de: Kontaktinformationen
es: Información de Contacto
fr: Informations de Contact
it: Informazioni di Contatto
ru: Контактная информация
tr: İletişim Bilgileri
zh: 联系信息

# websiteSettingsLabelPhone
source: Contact Phone
ar: هاتف الاتصال
de: Kontakt-Telefon
es: Teléfono de Contacto
fr: Téléphone de Contact
it: Telefono Contatto
ru: Контактный телефон
tr: İletişim Telefonu
zh: 联系电话

# websiteSettingsLabelEmail
source: Contact Email
ar: بريد الاتصال الإلكتروني
de: Kontakt-E-Mail
es: Correo Electrónico de Contacto
fr: E-mail de Contact
it: Email Contatto
ru: Контактный email
tr: İletişim E-postası
zh: 联系邮箱

# websiteSettingsLabelAddress
source: Contact Address
ar: عنوان الاتصال
de: Kontakt-Adresse
es: Dirección de Contacto
fr: Adresse de Contact
it: Indirizzo Contatto
ru: Контактный адрес
tr: İletişim Adresi
zh: 联系地址

# websiteSettingsLabelWorkingHours
source: Working Hours
ar: ساعات العمل
de: Arbeitszeiten
es: Horario de Trabajo
fr: Heures de Travail
it: Orari di Apertura
ru: Рабочие часы
tr: Çalışma Saatleri
zh: 工作时间

# websiteSettingsSectionAppearance
source: Appearance and Theme
ar: المظهر والنسق
de: Erscheinungsbild und Thema
es: Apariencia y Tema
fr: Apparence et Thème
it: Aspetto e Tema
ru: Внешний вид и тема
tr: Görünüm ve Tema
zh: 外观和主题

# websiteSettingsLabelPrimaryColor
source: Primary Color
ar: اللون الأساسي
de: Primärfarbe
es: Color Primario
fr: Couleur Primaire
it: Colore Primario
ru: Основной цвет
tr: Ana Renk
zh: 主色

# websiteSettingsLabelSecondaryColor
source: Secondary Color
ar: اللون الثانوي
de: Sekundärfarbe
es: Color Secundario
fr: Couleur Secondaire
it: Colore Secondario
ru: Вторичный цвет
tr: İkincil Renk
zh: 辅色

# websiteSettingsSectionSocial
source: Social Media
ar: وسائل التواصل الاجتماعي
de: Soziale Medien
es: Redes Sociales
fr: Médias Sociaux
ru: Социальные сети
tr: Sosyal Medya
zh: 社交媒体

# websiteSettingsSectionVisibility
source: Visibility Settings
ar: إعدادات الرؤية
de: Sichtbarkeitseinstellungen
es: Ajustes de Visibilidad
fr: Paramètres de Visibilité
it: Impostazioni Visibilità
ru: Настройки видимости
tr: Görünürlük Ayarları
zh: 可见性设置

# websiteSettingsToggleShowMenu
source: Show Menu
ar: عرض القائمة
de: Menü anzeigen
es: Mostrar Menú
fr: Afficher le Menu
it: Mostra Menù
ru: Показать меню
tr: Menüyü Göster
zh: 显示菜单

# websiteSettingsToggleShowContact
source: Show Contact Info
ar: عرض معلومات الاتصال
de: Kontaktinfo anzeigen
es: Mostrar Información de Contacto
fr: Afficher les Infos de Contact
it: Mostra Info Contatto
ru: Показать контактную информацию
tr: İletişim Bilgilerini Göster
zh: 显示联系信息

# websiteSettingsToggleShowMap
source: Show Map
ar: عرض الخريطة
de: Karte anzeigen
es: Mostrar Mapa
fr: Afficher la Carte
it: Mostra Mappa
ru: Показать карту
tr: Haritayı Göster
zh: 显示地图

# buttonSaveChanges
source: Save Changes
ar: حفظ التغييرات
de: Änderungen speichern
es: Guardar Cambios
fr: Enregistrer les Changements
it: Salva Modifiche
ru: Сохранить изменения
tr: Değişiklikleri Kaydet
zh: 保存更改

# homeMenuShiftAssignment
source: Shift Assignment
ar: تعيين المناوبات
de: Schichtzuweisung
es: Asignación de Turnos
fr: Assignation de Quart
it: Assegnazione Turni
ru: Назначение смен
tr: Vardiya Atama
zh: 班次分配

# homeMenuReservations
source: Reservations
ar: الحجوزات
de: Reservierungen
es: Reservas
fr: Réservations
it: Prenotazioni
ru: Бронирование
tr: Rezervasyonlar
zh: 预订

# reservationsTitle
source: Reservation Management
ar: إدارة الحجوزات
de: Reservierungsverwaltung
es: Gestión de Reservas
fr: Gestion des Réservations
it: Gestione Prenotazioni
ru: Управление бронированием
tr: Rezervasyon Yönetimi
zh: 预订管理

# reservationsTabPending
source: Pending
ar: معلق
de: Ausstehend
es: Pendientes
fr: En Attente
it: In Sospeso
ru: Ожидающие
tr: Bekleyen
zh: 待处理

# reservationsTabConfirmed
source: Confirmed
ar: مؤكد
de: Bestätigt
es: Confirmadas
fr: Confirmées
it: Confermate
ru: Подтвержденные
tr: Onaylı
zh: 已确认

# reservationsTabPast
source: Past
ar: سابق
de: Vergangen
es: Pasadas
fr: Passées
it: Passate
ru: Прошедшие
tr: Geçmiş
zh: 历史

# reservationsNoReservations
source: No reservations to display.
ar: لا توجد حجوزات لعرضها.
de: Keine Reservierungen zum Anzeigen.
es: No hay reservas para mostrar.
fr: Aucune réservation à afficher.
it: Nessuna prenotazione da visualizzare.
ru: Нет бронирований для отображения.
tr: Gösterilecek rezervasyon bulunamadı.
zh: 没有可显示的预订。

# reservationsNoReservationsInThisCategory
source: No reservations in this category.
ar: لا توجد حجوزات في هذه الفئة.
de: Keine Reservierungen in dieser Kategorie.
es: No hay reservas en esta categoría.
fr: Aucune réservation dans cette catégorie.
it: Nessuna prenotazione in questa categoria.
ru: В этой категории нет бронирований.
tr: Bu kategoride rezervasyon yok.
zh: 此类别中没有预订。

# manageTablesInfoCreatingQrPdf
source: Creating PDF file with QR codes...
ar: جاري إنشاء ملف PDF برموز QR...
de: PDF-Datei mit QR-Codes wird erstellt...
es: Creando archivo PDF con códigos QR...
fr: Création du fichier PDF avec les codes QR...
it: Creazione file PDF con codici QR in corso...
ru: Создание PDF-файла с QR-кодами...
tr: QR kodları içeren PDF dosyası oluşturuluyor...
zh: 正在创建包含二维码的 PDF 文件...

# manageTablesSuccessQrPdfSaved
source: PDF file successfully saved to '{filePath}'.
ar: تم حفظ ملف PDF بنجاح في '{filePath}'.
de: PDF-Datei erfolgreich unter '{filePath}' gespeichert.
es: Archivo PDF guardado con éxito en '{filePath}'.
fr: Fichier PDF enregistré avec succès dans '{filePath}'.
it: File PDF salvato con successo in '{filePath}'.
ru: PDF-файл успешно сохранен в «{filePath}».
tr: PDF dosyası başarıyla '{filePath}' konumuna kaydedildi.
zh: PDF 文件已成功保存到“{filePath}”。

# dialogButtonOpen
source: OPEN
ar: فتح
de: ÖFFNEN
es: ABRIR
fr: OUVRIR
it: APRI
ru: ОТКРЫТЬ
tr: AÇ
zh: 打开

# manageTablesErrorCreatingQrPdf
source: An error occurred while exporting QR codes to PDF: {error}
ar: حدث خطأ أثناء تصدير رموز QR إلى PDF: {error}
de: Beim Exportieren von QR-Codes als PDF ist ein Fehler aufgetreten: {error}
es: Ocurrió un error al exportar códigos QR a PDF: {error}
fr: Une erreur s'est produite lors de l'exportation des codes QR au format PDF : {error}
it: Si è verificato un errore durante l'esportazione dei codici QR in PDF: {error}
ru: Произошла ошибка при экспорте QR-кодов в PDF: {error}
tr: QR kodları PDF'e aktarılırken bir hata oluştu: {error}
zh: 导出二维码到 PDF 时发生错误: {error}

# manageTablesTooltipExportQr
source: Download QR Codes for All Tables
ar: تنزيل رموز QR لجميع الطاولات
de: QR-Codes für alle Tische herunterladen
es: Descargar Códigos QR para Todas las Mesas
fr: Télécharger les Codes QR pour Toutes les Tables
it: Scarica Codici QR per Tutti i Tavoli
ru: Скачать QR-коды для всех столов
tr: Tüm Masaların QR Kodlarını İndir
zh: 下载所有桌位的二维码

# manageTablesButtonDownloadQr
source: Download QR Code
ar: تنزيل رمز QR
de: QR-Code herunterladen
es: Descargar Código QR
fr: Télécharger le Code QR
it: Scarica Codice QR
ru: Скачать QR-код
tr: QR Kodunu İndir
zh: 下载二维码

# manageTablesSuccessQrDownloaded
source: QR code downloaded successfully.
ar: تم تنزيل رمز QR بنجاح.
de: QR-Code erfolgreich heruntergeladen.
es: Código QR descargado con éxito.
fr: Code QR téléchargé avec succès.
it: Codice QR scaricato con successo.
ru: QR-код успешно скачан.
tr: QR kod başarıyla indirildi.
zh: 二维码下载成功。

# manageTablesErrorQrDownload
source: Could not download QR code: {error}
ar: تعذر تنزيل رمز QR: {error}
de: QR-Code konnte nicht heruntergeladen werden: {error}
es: No se pudo descargar el código QR: {error}
fr: Impossible de télécharger le code QR : {error}
it: Impossibile scaricare il codice QR: {error}
ru: Не удалось скачать QR-код: {error}
tr: QR kod indirilemedi: {error}
zh: 无法下载二维码: {error}

# reservationsTabOthers
source: Others
ar: أخرى
de: Sonstige
es: Otros
fr: Autres
it: Altre
ru: Другие
tr: Diğer
zh: 其他

# reservationsErrorLoading
source: An error occurred while loading reservations: {error}
ar: حدث خطأ أثناء تحميل الحجوزات: {error}
de: Beim Laden der Reservierungen ist ein Fehler aufgetreten: {error}
es: Ocurrió un error al cargar las reservas: {error}
fr: Une erreur s'est produite lors du chargement des réservations : {error}
it: Si è verificato un errore durante il caricamento delle prenotazioni: {error}
ru: Произошла ошибка при загрузке бронирований: {error}
tr: Rezervasyonlar yüklenirken bir hata oluştu: {error}
zh: 加载预订时发生错误: {error}

# reservationsNoReservationsFound
source: No reservations to display.
ar: لا توجد حجوزات لعرضها.
de: Keine Reservierungen zum Anzeigen gefunden.
es: No hay reservas para mostrar.
fr: Aucune réservation à afficher.
it: Nessuna prenotazione da visualizzare.
ru: Бронирования не найдены.
tr: Gösterilecek rezervasyon bulunamadı.
zh: 未找到预订。

# reservationsPartySizeTooltip
source: {count} People
ar: {count} أشخاص
de: {count} Personen
es: {count} Personas
fr: {count} Personnes
it: {count} Persone
ru: {count} Человек
tr: {count} Kişi
zh: {count} 人

# tableLabel
source: Table
ar: طاولة
de: Tisch
es: Mesa
it: Tavolo
ru: Стол
tr: Masa
zh: 桌位

# reservationsConfirmTooltip
source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fr: Confirmer
it: Conferma
ru: Подтвердить
tr: Onayla
zh: 确认

# reservationsCancelTooltip
source: Cancel
ar: إلغاء
de: Stornieren
es: Cancelar
fr: Annuler
it: Annulla
ru: Отменить
tr: İptal Et
zh: 取消

# reservationsMarkSeatedTooltip
source: Mark as seated
ar: وضع علامة كـ جالس
de: Als platziert markieren
es: Marcar como sentado
fr: Marquer comme assis
it: Segna come seduto
ru: Отметить как сидящего
tr: Müşteri geldi, oturdu olarak işaretle
zh: 标记为已入座

# reservationsMarkSeatedButton
source: Seated
ar: جالس
de: Platziert
es: Sentado
fr: Assis
it: Seduto
ru: Сидит
tr: Oturdu
zh: 已入座

# homeMenuBusinessCard
source: Business Card Design
ar: تصميم بطاقة العمل
de: Visitenkarten-Design
es: Diseño de Tarjeta de Presentación
fr: Conception de Carte de Visite
it: Design Biglietto da Visita
ru: Дизайн визитки
tr: Kartvizit Tasarımı
zh: 名片设计

# tableLayoutScreenTitle
source: Table Layout Planner
ar: مخطط تخطيط الطاولة
de: Tischplan-Planer
es: Planificador de Diseño de Mesas
fr: Planificateur d'Aménagement des Tables
it: Pianificatore Layout Tavoli
ru: Планировщик расположения столов
tr: Masa Düzeni Planlayıcısı
zh: 桌位布局规划器

# tableLayoutSuccessSave
source: Table layout saved successfully.
ar: تم حفظ تخطيط الطاولة بنجاح.
de: Tischplan erfolgreich gespeichert.
es: Diseño de mesas guardado con éxito.
fr: Aménagement des tables enregistré avec succès.
it: Layout tavoli salvato con successo.
ru: Расположение столов успешно сохранено.
tr: Masa düzeni başarıyla kaydedildi.
zh: 桌位布局保存成功。

# tableLayoutErrorSave
source: An error occurred while saving table layout.
ar: حدث خطأ أثناء حفظ تخطيط الطاولة.
de: Beim Speichern des Tischplans ist ein Fehler aufgetreten.
es: Ocurrió un error al guardar el diseño de mesas.
fr: Une erreur s'est produite lors de l'enregistrement de l'aménagement des tables.
it: Si è verificato un errore durante il salvataggio del layout tavoli.
ru: Произошла ошибка при сохранении расположения столов.
tr: Masa düzeni kaydedilirken hata oluştu.
zh: 保存桌位布局时发生错误。

# manageTablesTooltipLayoutPlanner
source: Plan Table Layout
ar: تخطيط تخطيط الطاولة
de: Tischplan planen
es: Planificar Diseño de Mesas
fr: Planifier l'Aménagement des Tables
it: Pianifica Layout Tavoli
ru: Планировать расположение столов
tr: Masa Düzenini Planla
zh: 规划桌位布局

# tableLayoutPaletteAddElements
source: Add Elements
ar: إضافة عناصر
de: Elemente hinzufügen
es: Añadir Elementos
fr: Ajouter des Éléments
it: Aggiungi Elementi
ru: Добавить элементы
tr: Eleman Ekle
zh: 添加元素

# tableLayoutPaletteAddText
source: Add Text
ar: إضافة نص
de: Text hinzufügen
es: Añadir Texto
fr: Ajouter du Texte
it: Aggiungi Testo
ru: Добавить текст
tr: Metin Ekle
zh: 添加文本

# tableLayoutPaletteDefaultText
source: New Text
ar: نص جديد
de: Neuer Text
es: Nuevo Texto
fr: Nouveau Texte
it: Nuovo Testo
ru: Новый текст
tr: Yeni Metin
zh: 新文本

# tableLayoutPaletteAddRectangle
source: Add Rectangle
ar: إضافة مستطيل
de: Rechteck hinzufügen
es: Añadir Rectángulo
fr: Ajouter un Rectangle
it: Aggiungi Rettangolo
ru: Добавить прямоугольник
tr: Dikdörtgen Ekle
zh: 添加矩形

# tableLayoutPaletteAddEllipse
source: Add Ellipse
ar: إضافة شكل بيضاوي
de: Ellipse hinzufügen
es: Añadir Elipse
fr: Ajouter une Ellipse
it: Aggiungi Ellisse
ru: Добавить эллипс
tr: Elips Ekle
zh: 添加椭圆

# tableLayoutPaletteAddLine
source: Add Line
ar: إضافة خط
de: Linie hinzufügen
es: Añadir Línea
fr: Ajouter une Ligne
it: Aggiungi Linea
ru: Добавить линию
tr: Çizgi Ekle
zh: 添加线条

# tableLayoutPaletteUnplacedTables
source: Unplaced Tables ({count})
ar: الطاولات غير الموضوعة ({count})
de: Nicht platzierte Tische ({count})
es: Mesas Sin Colocar ({count})
fr: Tables Non Placées ({count})
it: Tavoli Non Posizionati ({count})
ru: Неразмещенные столы ({count})
tr: Yerleştirilmemiş Masalar ({count})
zh: 未放置的桌位 ({count})

# tableLayoutPaletteAllTablesPlaced
source: All tables have been placed.
ar: تم وضع جميع الطاولات.
de: Alle Tische wurden platziert.
es: Todas las mesas han sido colocadas.
fr: Toutes les tables ont été placées.
it: Tutti i tavoli sono stati posizionati.
ru: Все столы размещены.
tr: Tüm masalar yerleştirildi.
zh: 所有桌位均已放置。

# tableLayoutPaletteTableLabel
source: Table {tableNumber}
ar: طاولة {tableNumber}
de: Tisch {tableNumber}
es: Mesa {tableNumber}
it: Tavolo {tableNumber}
ru: Стол {tableNumber}
tr: Masa {tableNumber}
zh: 桌位 {tableNumber}

# tableLayoutToggleGrid
source: Toggle Grid and Alignment
ar: تبديل الشبكة والمحاذاة
de: Raster und Ausrichtung umschalten
es: Alternar Cuadrícula y Alineación
fr: Basculer la Grille et l'Alignement
it: Attiva Griglia e Allineamento
ru: Переключить сетку и выравнивание
tr: Izgarayı ve Hizalamayı Aç/Kapat
zh: 切换网格和对齐

# unplacedTablesTitle
source: Unplaced Tables
ar: الطاولات غير الموضوعة
de: Nicht platzierte Tische
es: Mesas Sin Colocar
fr: Tables Non Placées
it: Tavoli Non Posizionati
ru: Неразмещенные столы
tr: Yerleştirilmemiş Masalar
zh: 未放置的桌位

# templateAddSelectedButton
source: Add Selected
ar: إضافة المحدد
de: Ausgewählte hinzufügen
es: Añadir Seleccionados
fr: Ajouter la Sélection
it: Aggiungi Selezionati
ru: Добавить выбранное
tr: Seçilenleri Ekle
zh: 添加已选

# templateVariantRequiredError
source: You must add at least one variant to each selected item.
ar: يجب عليك إضافة متغير واحد على الأقل لكل عنصر محدد.
de: Sie müssen mindestens eine Variante zu jedem ausgewählten Artikel hinzufügen.
es: Debes añadir al menos una variante a cada artículo seleccionado.
fr: Vous devez ajouter au moins une variante à chaque article sélectionné.
it: Devi aggiungere almeno una variante a ogni articolo selezionato.
ru: Вы должны добавить хотя бы один вариант к каждому выбранному товару.
tr: Her seçili ürüne en az bir varyant eklemelisiniz.
zh: 您必须为每个选定的产品添加至少一个变体。

# homeMenuPaymentSettings
source: Payment Settings
ar: إعدادات الدفع
de: Zahlungseinstellungen
es: Ajustes de Pago
fr: Paramètres de Paiement
it: Impostazioni Pagamento
ru: Настройки оплаты
tr: Ödeme Ayarları
zh: 支付设置

# paymentTypeQrCode
source: Pay with QR Code
ar: الدفع باستخدام رمز QR
de: Mit QR-Code bezahlen
es: Pagar con Código QR
fr: Payer avec Code QR
it: Paga con Codice QR
ru: Оплата через QR-код
tr: QR Kod ile Öde
zh: 二维码支付

# qrPaymentScreenTitle
source: Pay with QR Code
ar: الدفع باستخدام رمز QR
de: Mit QR-Code bezahlen
es: Pagar con Código QR
fr: Payer avec Code QR
it: Paga con Codice QR
ru: Оплата через QR-код
tr: QR Kod ile Ödeme
zh: 二维码支付

# qrPaymentInstruction
source: Scan the QR code with your bank's mobile app
ar: امسح رمز QR ضوئيًا باستخدام تطبيق البنك المحمول الخاص بك
de: Scannen Sie den QR-Code mit der Mobile-App Ihrer Bank
es: Escanea el código QR con la aplicación móvil de tu banco
fr: Scannez le code QR avec l'application mobile de votre banque
it: Scansiona il codice QR con l'app mobile della tua banca
ru: Сканируйте QR-код мобильным приложением вашего банка
tr: QR kodu bankanızın mobil uygulaması ile okutun
zh: 使用您银行的手机应用扫描二维码

# qrPaymentErrorInitiate
source: Error initiating QR payment: {error}
ar: خطأ في بدء الدفع بـ QR: {error}
de: Fehler beim Initiieren der QR-Zahlung: {error}
es: Error al iniciar el pago QR: {error}
fr: Erreur lors de l'initialisation du paiement QR : {error}
it: Errore avvio pagamento QR: {error}
ru: Ошибка инициализации QR-платежа: {error}
tr: QR ödeme başlatılırken hata: {error}
zh: 发起二维码支付错误: {error}

# qrPaymentErrorTimeout
source: QR payment timed out
ar: انتهت مهلة الدفع بـ QR
de: QR-Zahlung Zeitüberschreitung
es: El pago QR ha expirado
fr: Le paiement QR a expiré
it: Pagamento QR scaduto per timeout
ru: Время ожидания QR-платежа истекло
tr: QR ödeme süresi doldu
zh: 二维码支付超时

# qrPaymentErrorFailedOrExpired
source: QR payment failed or expired
ar: فشل الدفع بـ QR أو انتهت صلاحيته
de: QR-Zahlung fehlgeschlagen oder abgelaufen
es: El pago QR falló o expiró
fr: Le paiement QR a échoué ou a expiré
it: Pagamento QR fallito o scaduto
ru: QR-платеж не удался или истек
tr: QR ödeme başarısız veya süresi doldu
zh: 二维码支付失败或已过期

# paymentSuccessMessage
source: Payment completed successfully!
ar: تم الدفع بنجاح!
de: Zahlung erfolgreich abgeschlossen!
es: ¡Pago completado con éxito!
fr: Paiement effectué avec succès !
it: Pagamento completato con successo!
ru: Оплата успешно завершена!
tr: Ödeme başarıyla tamamlandı!
zh: 支付成功完成！

# dialogButtonBack
source: Back
ar: رجوع
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ru: Назад
tr: Geri
zh: 返回

# orderTotalLabel
source: Total Amount:
ar: المبلغ الإجمالي:
de: Gesamtbetrag:
es: Importe Total:
fr: Montant Total :
it: Importo Totale:
ru: Общая сумма:
tr: Toplam Tutar:
zh: 总金额:

# qrPaymentSecondsLeft
source: seconds left
ar: ثانية متبقية
de: Sekunden verbleiben
es: segundos restantes
fr: secondes restantes
it: secondi rimasti
ru: секунд осталось
tr: saniye kaldı
zh: 秒剩余

# takeawayErrorAssigningPagerWithCode
source: Error assigning device: {statusCode}
ar: خطأ في تعيين الجهاز: {statusCode}
de: Fehler beim Zuweisen des Geräts: {statusCode}
es: Error al asignar dispositivo: {statusCode}
fr: Erreur lors de l'assignation de l'appareil : {statusCode}
it: Errore assegnazione dispositivo: {statusCode}
ru: Ошибка назначения устройства: {statusCode}
tr: Cihaz atama hatası: {statusCode}
zh: 分配设备错误: {statusCode}

# takeawayTooltipNewOrder
source: New Takeaway Order
ar: طلب سفري جديد
de: Neue Außer-Haus-Bestellung
es: Nuevo Pedido para Llevar
fr: Nouvelle Commande à Emporter
it: Nuovo Ordine da Asporto
ru: Новый заказ на вынос
tr: Yeni Paket Sipariş
zh: 新外卖订单

# takeawayNoActiveOrders
source: There are no active takeaway orders.
ar: لا توجد طلبات سفري نشطة.
de: Es gibt keine aktiven Außer-Haus-Bestellungen.
es: No hay pedidos para llevar activos.
fr: Il n'y a pas de commandes à emporter actives.
it: Non ci sono ordini da asporto attivi.
ru: Нет активных заказов на вынос.
tr: Aktif takeaway siparişi bulunmamaktadır.
zh: 没有活跃的外卖订单。

# takeawayOrderFormTitle
source: New Takeaway Order
ar: طلب سفري جديد
de: Neue Außer-Haus-Bestellung
es: Nuevo Pedido para Llevar
fr: Nouvelle Commande à Emporter
it: Nuovo Ordine da Asporto
ru: Новый заказ на вынос
tr: Yeni Paket Sipariş
zh: 新外卖订单
