Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# snackbarUploadingVariantPhoto
source: Uploading variant photo...
ar: جاري تحميل صورة المتغير...
de: Variantenfoto wird hochgeladen...
es: Subiendo foto de la variante...
fr: Téléchargement de la photo de variante...
it: Caricamento foto variante in corso...
ru: Загрузка фото варианта...
tr: Varyant fotoğrafı yükleniyor...
zh: 正在上传变体照片...

# snackbarVariantAdded
source: Variant "{variantName}" added
ar: تمت إضافة المتغير "{variantName}"
de: Variante "{variantName}" hinzugefügt
es: Variante "{variantName}" añadida
fr: Variante "{variantName}" ajoutée
it: Variante "{variantName}" aggiunta
ru: Вариант «{variantName}» добавлен
tr: Varyant "{variantName}" eklendi
zh: 变体“{variantName}”已添加

# snackbarPendingVariantDataCleared
source: Pending variant data cleared
ar: تم مسح بيانات المتغير المعلقة
de: Ausstehende Variantendaten gelöscht
es: Datos de variante pendientes borrados
fr: Données de variante en attente effacées
it: Dati variante in sospeso cancellati
ru: Отложенные данные варианта очищены
tr: Bekleyen varyant verileri temizlendi
zh: 待处理的变体数据已清除

source: Firebase upload failed
ar: فشل تحميل Firebase
de: Firebase-Upload fehlgeschlagen
es: Error de subida a Firebase
fr: Échec du téléchargement Firebase
it: Caricamento Firebase fallito
ru: Не удалось загрузить в Firebase
tr: Firebase upload başarısız
zh: Firebase 上传失败

# dialogPendingVariantTitle
source: Pending Variant
ar: متغير معلق
de: Ausstehende Variante
es: Variante Pendiente
fr: Variante en Attente
it: Variante in Sospeso
ru: Отложенный вариант
tr: Bekleyen Varyant
zh: 待处理变体

# dialogPendingVariantContent1
source: There are filled fields in the manual variant entry form.
ar: هناك حقول مملوءة في نموذج إدخال المتغير اليدوي.
de: Es sind ausgefüllte Felder im Formular zur manuellen Varianteneingabe vorhanden.
es: Hay campos rellenados en el formulario de entrada manual de variantes.
fr: Il y a des champs remplis dans le formulaire de saisie manuelle de variante.
it: Ci sono campi compilati nel modulo di inserimento variante manuale.
ru: В форме ручного ввода варианта есть заполненные поля.
tr: Manuel varyant ekleme formunda doldurulmuş alanlar var.
zh: 手动变体输入表单中有已填写的字段。

# dialogPendingVariantContentName
source: • Variant Name: "{name}"
ar: • اسم المتغير: "{name}"
de: • Variantenname: "{name}"
es: • Nombre de la Variante: "{name}"
fr: • Nom de la Variante : "{name}"
it: • Nome Variante: "{name}"
ru: • Название варианта: «{name}»
tr: • Varyant Adı: "{name}"
zh: • 变体名称: “{name}”

# dialogPendingVariantContentPrice
source: • Price: "₺{price}"
ar: • السعر: "ل.ت{price}"
de: • Preis: "€{price}"
es: • Precio: "₺{price}"
fr: • Prix : "₺{price}"
it: • Prezzo: "₺{price}"
ru: • Цена: «₺{price}»
tr: • Fiyat: "₺{price}"
zh: • 价格: “₺{price}”

# dialogPendingVariantContent2
source: Do you want to exit without adding this variant?
ar: هل تريد الخروج دون إضافة هذا المتغير؟
de: Möchten Sie beenden, ohne diese Variante hinzuzufügen?
es: ¿Quieres salir sin añadir esta variante?
fr: Voulez-vous quitter sans ajouter cette variante ?
it: Vuoi uscire senza aggiungere questa variante?
ru: Вы хотите выйти, не добавляя этот вариант?
tr: Bu varyantı eklemeden çıkmak istiyor musunuz?
zh: 您想在不添加此变体的情况下退出吗？

# dialogButtonDeleteAndExit
source: Delete and Exit
ar: حذف وخروج
de: Löschen und beenden
es: Eliminar y Salir
fr: Supprimer et Quitter
it: Elimina ed Esci
ru: Удалить и выйти
tr: Sil ve Çık
zh: 删除并退出

# validatorVariantNameRequired
source: Variant name is required
ar: اسم المتغير مطلوب
de: Variantenname ist erforderlich
es: El nombre de la variante es obligatorio
fr: Le nom de la variante est requis
it: Il nome della variante è obbligatorio
ru: Название варианта обязательно
tr: Varyant adı gerekli
zh: 变体名称为必填项

# validatorPriceRequired
source: Price is required
ar: السعر مطلوب
de: Preis ist erforderlich
es: El precio es obligatorio
fr: Le prix est requis
it: Il prezzo è obbligatorio
ru: Цена обязательна
tr: Fiyat gerekli
zh: 价格为必填项

# validatorInvalidPrice
source: Invalid price
ar: سعر غير صالح
de: Ungültiger Preis
es: Precio no válido
fr: Prix invalide
it: Prezzo non valido
ru: Недействительная цена
tr: Geçersiz fiyat
zh: 价格无效

# kdsPrepare
source: Prepare
ar: تحضير
de: Vorbereiten
es: Preparar
fr: Préparer
it: Prepara
ru: Готовить
tr: Hazırla
zh: 准备

# kdsPreparing
source: Preparing...
ar: جاري التحضير...
de: Wird zubereitet...
es: Preparando...
fr: Préparation en cours...
it: In preparazione...
ru: Готовится...
tr: Hazırlanıyor...
zh: 正在准备...

# kdsPreparationStarted
source: Preparation started
ar: بدأ التحضير
de: Zubereitung gestartet
es: Preparación iniciada
fr: Préparation démarrée
it: Preparazione iniziata
ru: Приготовление начато
tr: Hazırlama başladı
zh: 准备已开始

# kdsReady
source: Ready
ar: جاهز
de: Fertig
es: Listo
fr: Prêt
it: Pronto
ru: Готов
tr: Hazır
zh: 就绪

# kdsMarkingReady
source: Marking as ready...
ar: جاري وضع علامة جاهز...
de: Wird als fertig markiert...
es: Marcando como listo...
fr: Marquage comme prêt...
it: Segnalazione pronto in corso...
ru: Отметка как готово...
tr: Hazır hale getiriliyor...
zh: 正在标记为就绪...

# kdsProductReady
source: Product is ready!
ar: المنتج جاهز!
de: Produkt ist fertig!
es: ¡Producto listo!
fr: Le produit est prêt !
it: Prodotto è pronto!
ru: Продукт готов!
tr: Ürün hazır!
zh: 产品已就绪！

# kdsCompleted
source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
it: Completato
ru: Завершено
tr: Tamamlandı
zh: 已完成

# kdsWaiting
source: Waiting
ar: في الانتظار
de: Wartend
es: Esperando
fr: En Attente
it: In Attesa
ru: Ожидание
tr: Bekliyor
zh: 等待中

# kdsStartPreparation
source: Start Preparation
ar: بدء التحضير
de: Zubereitung starten
es: Iniciar Preparación
fr: Démarrer la Préparation
it: Inizia Preparazione
ru: Начать приготовление
tr: Hazırlamaya Başla
zh: 开始准备

# kdsStartingPreparation
source: Starting preparation...
ar: جاري بدء التحضير...
de: Zubereitung wird gestartet...
es: Iniciando preparación...
fr: Démarrage de la préparation...
it: Avvio preparazione in corso...
ru: Начало приготовления...
tr: Hazırlama başlatılıyor...
zh: 正在开始准备...

# kdsOrderNumber
source: Order #{orderId}
ar: الطلب رقم #{orderId}
de: Bestellung #{orderId}
es: Pedido #{orderId}
fr: Commande #{orderId}
it: Ordine #{orderId}
ru: Заказ #{orderId}
tr: Sipariş #{orderId}
zh: 订单 #{orderId}

# kdsPackage
source: Takeaway
ar: سفري
de: Außer Haus
es: Para Llevar
fr: À Emporter
it: Asporto
ru: На вынос
tr: Paket
zh: 外卖

# kdsUnknownProduct
source: Unknown Product
ar: منتج غير معروف
de: Unbekanntes Produkt
es: Producto Desconocido
fr: Produit Inconnu
it: Prodotto Sconosciuto
ru: Неизвестный продукт
tr: Bilinmeyen Ürün
zh: 未知产品

# kdsNote
source: Note: {noteText}
ar: ملاحظة: {noteText}
de: Notiz: {noteText}
es: Nota: {noteText}
it: Nota: {noteText}
ru: Примечание: {noteText}
tr: Not: {noteText}
zh: 备注: {noteText}

# kdsNoItemsInOrder
source: There are no items in this order.
ar: لا توجد عناصر في هذا الطلب.
de: In dieser Bestellung sind keine Artikel enthalten.
es: No hay artículos en este pedido.
fr: Il n'y a aucun article dans cette commande.
it: Non ci sono articoli in questo ordine.
ru: В этом заказе нет товаров.
tr: Bu siparişte ürün bulunmuyor.
zh: 此订单中没有产品。

# kdsCardError
source: An error occurred while loading the card.
ar: حدث خطأ أثناء تحميل البطاقة.
de: Beim Laden der Karte ist ein Fehler aufgetreten.
es: Ocurrió un error al cargar la tarjeta.
fr: Une erreur s'est produite lors du chargement de la carte.
it: Si è verificato un errore durante il caricamento della scheda.
ru: Произошла ошибка при загрузке карточки.
tr: Kart yüklenirken bir hata oluştu.
zh: 加载卡片时发生错误。

# kdsScreenTitle
source: {screenName} KDS
ar: KDS: {screenName}
de: KDS: {screenName}
es: KDS: {screenName}
fr: KDS : {screenName}
it: KDS: {screenName}
ru: KDS: {screenName}
tr: {screenName} KDS Ekranı
zh: KDS: {screenName}

# kdsScreenTooltipGoHome
source: Go to Home
ar: الرئيسية
de: Startseite
es: Inicio
fr: Accueil
it: Home
ru: Главная
tr: Ana Sayfaya Git
zh: 首页

# kdsScreenTooltipBack
source: Back
ar: رجوع
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ru: Назад
tr: Geri
zh: 返回

# kdsScreenTooltipRefresh
source: Refresh
ar: تحديث
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ru: Обновить
tr: Yenile
zh: 刷新

# kdsScreenErrorFetching
source: Error fetching orders: {error}
ar: خطأ في جلب طلبات KDS: {error}
de: Fehler beim Abrufen der KDS-Bestellungen: {error}
es: Error al obtener pedidos KDS: {error}
fr: Erreur lors de la récupération des commandes KDS : {error}
it: Errore recupero ordini KDS: {error}
ru: Ошибка получения заказов KDS: {error}
tr: Siparişler alınırken hata oluştu: {error}
zh: 获取 KDS 订单错误: {error}

# kdsScreenButtonRetry
source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ru: Повторить
tr: Tekrar Dene
zh: 重试

# kdsScreenNoOrders
source: No active orders to display.
ar: لا توجد طلبات للتحضير لشاشة KDS هذه.
de: Für diesen KDS-Bildschirm gibt es keine Bestellungen zur Vorbereitung.
es: No hay pedidos para preparar para esta pantalla KDS.
fr: Il n'y a pas de commandes à préparer pour cet écran KDS.
it: Non ci sono ordini da preparare per questo schermo KDS.
ru: Нет заказов для приготовления для этого экрана KDS.
tr: Görüntülenecek aktif sipariş yok.
zh: 此 KDS 屏幕没有要准备的订单。

# kdsScreenWaitForRefresh
source: Please wait for the previous refresh to complete.
ar: الرجاء الانتظار حتى يكتمل التحديث السابق.
de: Bitte warten Sie, bis die vorherige Aktualisierung abgeschlossen ist.
es: Por favor, espera a que se complete la actualización anterior.
fr: Veuillez attendre que l'actualisation précédente soit terminée.
it: Per favore, attendi il completamento dell'aggiornamento precedente.
ru: Пожалуйста, дождитесь завершения предыдущего обновления.
tr: Lütfen bir önceki yenileme işleminin bitmesini bekleyin.
zh: 请等待上次刷新完成。

# kdsScreenRefreshingOrders
source: Refreshing KDS orders...
ar: جاري تحديث طلبات KDS...
de: KDS-Bestellungen werden aktualisiert...
es: Actualizando pedidos KDS...
fr: Actualisation des commandes KDS...
it: Aggiornamento ordini KDS in corso...
ru: Обновление заказов KDS...
tr: KDS siparişleri yenileniyor...
zh: 正在刷新 KDS 订单...

# kdsScreenOrdersUpdated
source: Orders updated!
ar: تم تحديث الطلبات!
de: Bestellungen aktualisiert!
es: ¡Pedidos actualizados!
fr: Commandes mises à jour !
it: Ordini aggiornati!
ru: Заказы обновлены!
tr: Siparişler güncellendi!
zh: 订单已更新！

# kdsScreenClosing
source: Closing KDS...
ar: جاري إغلاق KDS...
de: KDS wird geschlossen...
es: Cerrando KDS...
fr: Fermeture du KDS...
it: Chiusura KDS in corso...
ru: Закрытие KDS...
tr: KDS kapatılıyor...
zh: 正在关闭 KDS...

# kdsScreenRefreshing
source: Refreshing...
ar: جاري التحديث...
de: Wird aktualisiert...
es: Actualizando...
fr: Actualisation en cours...
it: Aggiornamento in corso...
ru: Обновление...
tr: Yenileniyor...
zh: 正在刷新...

# orderStatusUpdate
source: Order #{orderId} status updated: {statusDisplay}
ar: تم تحديث حالة الطلب #{orderId}: {statusDisplay}
de: Status von Bestellung #{orderId} aktualisiert: {statusDisplay}
es: Estado del Pedido #{orderId} actualizado: {statusDisplay}
fr: Statut de la Commande #{orderId} mis à jour : {statusDisplay}
it: Stato ordine #{orderId} aggiornato: {statusDisplay}
ru: Статус заказа #{orderId} обновлен: {statusDisplay}
tr: Sipariş #{orderId} durumu güncellendi: {statusDisplay}
zh: 订单 #{orderId} 状态已更新: {statusDisplay}

# orderItemAdded
source: {itemName} was added to Order #{orderId}.
ar: تمت إضافة {itemName} إلى الطلب #{orderId}.
de: {itemName} wurde zu Bestellung #{orderId} hinzugefügt.
es: {itemName} fue añadido al Pedido #{orderId}.
fr: {itemName} a été ajouté à la Commande #{orderId}.
it: {itemName} è stato aggiunto all'Ordine #{orderId}.
ru: {itemName} добавлен в Заказ #{orderId}.
tr: {itemName} ürünü Sipariş #{orderId}'e eklendi.
zh: {itemName} 已添加到订单 #{orderId}。

# statusApproved
source: Approved (Sent to Kitchen)
ar: تمت الموافقة (تم الإرسال إلى المطبخ)
de: Genehmigt (An die Küche gesendet)
es: Aprobado (Enviado a Cocina)
fr: Approuvée (Envoyée à la Cuisine)
it: Approvato (Inviato in Cucina)
ru: Одобрен (Отправлен на кухню)
tr: Onaylandı (Mutfağa İletildi)
zh: 已批准 (已发送至厨房)

# statusPreparing
source: Preparing in Kitchen
ar: قيد التحضير في المطبخ
de: Wird in der Küche zubereitet
es: En Preparación en Cocina
fr: En Préparation en Cuisine
it: In Preparazione in Cucina
ru: Готовится на кухне
tr: Mutfakta Hazırlanıyor
zh: 在厨房准备中

# statusReadyForPickup
source: Ready for Pickup
ar: جاهز للاستلام
de: Bereit zur Abholung
es: Listo para Recoger
fr: Prête pour le Ramassage
it: Pronto per il Ritiro
ru: Готов к получению
tr: Mutfakta Hazır (Garson Bekliyor)
zh: 准备取走

# newOrderNotificationTitle
source: New Order Notification
ar: إشعار طلب جديد
de: Benachrichtigung über neue Bestellung
es: Notificación de Nuevo Pedido
fr: Notification de Nouvelle Commande
it: Notifica Nuovo Ordine
ru: Уведомление о новом заказе
tr: Sipariş Bildirimi
zh: 新订单通知

# orderStatusUpdateTitle
source: Order Status Updated
ar: تم تحديث حالة الطلب
de: Bestellstatus aktualisiert
es: Estado del Pedido Actualizado
fr: Statut de la Commande Mis à Jour
it: Stato Ordine Aggiornato
ru: Статус заказа обновлен
tr: Sipariş Durumu Güncellendi
zh: 订单状态已更新

# orderItemAddedTitle
source: Order Status Updated
ar: تم تحديث حالة الطلب
de: Bestellstatus aktualisiert
es: Estado del Pedido Actualizado
fr: Statut de la Commande Mis à Jour
it: Stato Ordine Aggiornato
ru: Статус заказа обновлен
tr: Siparişe Ürün Eklendi
zh: 订单状态已更新

# tableCellPickingUp
source: 👐 Picking up...
ar: 👐 جاري الاستلام...
de: 👐 Wird abgeholt...
es: 👐 Recogiendo...
fr: 👐 Ramassage en cours...
it: 👐 Ritiro in corso...
ru: 👐 Забирается...
tr: 👐 Teslim alınıyor...
zh: 👐 正在取走...

# tableCellPickedUp
source: ✅ Picked up
ar: ✅ تم الاستلام
de: ✅ Abgeholt
es: ✅ Recogido
fr: ✅ Ramassé
it: ✅ Ritirato
ru: ✅ Забрано
tr: ✅ Teslim alındı
zh: ✅ 已取走

# tableCellPickupFailed
source: Pickup operation failed
ar: فشلت عملية الاستلام
de: Abholvorgang fehlgeschlagen
es: Fallo en la operación de recogida
fr: Échec de l'opération de ramassage
it: Operazione di ritiro fallita
ru: Операция получения не удалась
tr: Teslim alma işlemi başarısız oldu
zh: 取走操作失败

# tableCellUnexpectedError
source: Unexpected error: {error}
ar: خطأ غير متوقع: {error}
de: Unerwarteter Fehler: {error}
es: Error inesperado: {error}
fr: Erreur inattendue : {error}
it: Errore inatteso: {error}
ru: Непредвиденная ошибка: {error}
tr: Beklenmeyen hata: {error}
zh: 意外错误: {error}

# tableCellDelivering
source: 🎉 Delivering...
ar: 🎉 جاري التوصيل...
de: 🎉 Wird ausgeliefert...
es: 🎉 Entregando...
fr: 🎉 Livraison en cours...
it: 🎉 Consegna in corso...
ru: 🎉 Доставка...
tr: 🎉 Teslim ediliyor...
zh: 🎉 正在交付...

# tableCellDelivered
source: 🎉 Delivered
ar: 🎉 تم التوصيل
de: 🎉 Ausgeliefert
es: 🎉 Entregado
fr: 🎉 Livré
it: 🎉 Consegnato
ru: 🎉 Доставлено
tr: 🎉 Teslim edildi
zh: 🎉 已交付

# tableCellDeliveryFailed
source: Delivery operation failed
ar: فشلت عملية التوصيل
de: Ausliefervorgang fehlgeschlagen
es: Fallo en la operación de entrega
fr: Échec de l'opération de livraison
it: Operazione di consegna fallita
ru: Операция доставки не удалась
tr: Teslimat işlemi başarısız oldu
zh: 交付操作失败

# tableCellKdsPreparing
source: Preparing
ar: قيد التحضير
de: Wird zubereitet
es: En Preparación
fr: Préparation en cours
it: In Preparazione
ru: Готовится
tr: Hazırlanıyor
zh: 正在准备

# tableCellKdsReady
source: Ready
ar: جاهز
de: Fertig
es: Listo
fr: Prêt
it: Pronto
ru: Готов
tr: Hazır
zh: 就绪

# tableCellKdsPickedUp
source: Picked Up
ar: تم الاستلام
de: Abgeholt
es: Recogido
fr: Ramassé
it: Ritirato
ru: Забрано
tr: Alındı
zh: 已取走

# tableCellKdsCompleted
source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
it: Completato
ru: Завершено
tr: Tamamlandı
zh: 已完成

# tableCellTooltipWaiterPickup
source: Waiter Pickup
ar: استلام النادل
de: Abholung durch Kellner
es: Recogida por Camarero
fr: Ramassage par le Serveur
it: Ritiro del Cameriere
ru: Получение официантом
tr: Garson Teslim Al
zh: 服务员取走

# tableCellUnknownProduct
source: Unknown Product
ar: منتج غير معروف
de: Unbekanntes Produkt
es: Producto Desconocido
fr: Produit Inconnu
it: Prodotto Sconosciuto
ru: Неизвестный продукт
tr: Bilinmeyen Ürün
zh: 未知产品

# tableCellNewLabel
source: [NEW]
ar: [جديد]
de: [NEU]
es: [NUEVO]
fr: [NOUVEAU]
it: [NUOVO]
ru: [НОВЫЙ]
tr: [YENİ]
zh: [新]

# tableCellTooltipAddOrEditProduct
source: Add or edit product
ar: إضافة أو تعديل المنتج
de: Produkt hinzufügen oder bearbeiten
es: Añadir o editar producto
fr: Ajouter ou modifier le produit
it: Aggiungi o modifica prodotto
ru: Добавить или редактировать продукт
tr: Ürün ekle veya düzenle
zh: 添加或编辑产品

# tableCellTooltipMoreActions
source: More actions
ar: المزيد من الإجراءات
de: Weitere Aktionen
es: Más acciones
fr: Plus d'actions
it: Altre azioni
ru: Больше действий
tr: Diğer işlemler
zh: 更多操作

# tableCellMenuTransferTable
source: Transfer Table
ar: تحويل الطاولة
de: Tisch übertragen
es: Transferir Mesa
fr: Transférer la Table
it: Trasferisci Tavolo
ru: Перевести стол
tr: Masa Transferi
zh: 转移桌位

# tableCellMenuCancelOrder
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# orderStatusUpdateMessage
source: Order #{orderId} status updated: {statusDisplay}
ar: تم تحديث حالة الطلب #{orderId}: {statusDisplay}
de: Status von Bestellung #{orderId} aktualisiert: {statusDisplay}
es: Estado del Pedido #{orderId} actualizado: {statusDisplay}
fr: Statut de la Commande #{orderId} mis à jour : {statusDisplay}
it: Stato ordine #{orderId} aggiornato: {statusDisplay}
ru: Статус заказа #{orderId} обновлен: {statusDisplay}
tr: Sipariş #{orderId} durumu güncellendi: {statusDisplay}
zh: 订单 #{orderId} 状态已更新: {statusDisplay}

# orderItemAddedMessage
source: '{itemName}' was added to order #{orderId}.
ar: تمت إضافة '{itemName}' إلى الطلب #{orderId}.
de: '{itemName}' wurde zu Bestellung #{orderId} hinzugefügt.
es: '{itemName}' fue añadido al pedido #{orderId}.
fr: '{itemName}' a été ajouté à la commande #{orderId}.
it: '{itemName}' è stato aggiunto all'ordine #{orderId}.
ru: «{itemName}» добавлен в заказ #{orderId}.
tr: '{itemName}' ürünü #{orderId} numaralı siparişe eklendi.
zh: “{itemName}”已添加到订单 #{orderId}。

# websiteSettingsErrorQrCreation
source: Could not create QR code.
ar: تعذر إنشاء رمز QR.
de: QR-Code konnte nicht erstellt werden.
es: No se pudo crear el código QR.
fr: Impossible de créer le code QR.
it: Impossibile creare il codice QR.
ru: Не удалось создать QR-код.
tr: QR kodu oluşturulamadı.
zh: 无法创建二维码。

# websiteSettingsErrorStoragePermission
source: Storage permission was not granted.
ar: لم يتم منح إذن التخزين.
de: Speicherberechtigung wurde nicht erteilt.
es: No se concedió el permiso de almacenamiento.
fr: L'autorisation de stockage n'a pas été accordée.
it: Permesso di archiviazione non concesso.
ru: Разрешение на хранение не предоставлено.
tr: Depolama izni verilmedi.
zh: 未授予存储权限。

# websiteSettingsErrorDownloadsFolder
source: Downloads folder not found.
ar: لم يتم العثور على مجلد التنزيلات.
de: Download-Ordner nicht gefunden.
es: No se encontró la carpeta de descargas.
fr: Dossier Téléchargements non trouvé.
it: Cartella Download non trovata.
ru: Папка загрузок не найдена.
tr: İndirilenler klasörü bulunamadı.
zh: 未找到下载文件夹。

# websiteSettingsErrorOpenFile
source: Could not open file: {message}
ar: تعذر فتح الملف: {message}
de: Datei konnte nicht geöffnet werden: {message}
es: No se pudo abrir el archivo: {message}
fr: Impossible d'ouvrir le fichier : {message}
it: Impossibile aprire il file: {message}
ru: Не удалось открыть файл: {message}
tr: Dosya açılamadı: {message}
zh: 无法打开文件: {message}

# websiteSettingsQrDialogTitle
source: Website QR Code
ar: رمز QR للموقع الإلكتروني
es: Código QR del Sitio Web
fr: Code QR du Site Web
it: Codice QR Sito Web
ru: QR-код веб-сайта
tr: Web Sitesi QR Kodu
zh: 网站二维码

# websiteSettingsErrorBusinessNameNotFound
source: Business name not found, cannot create QR code.
ar: لم يتم العثور على اسم العمل، لا يمكن إنشاء رمز QR.
de: Geschäftsname nicht gefunden, QR-Code kann nicht erstellt werden.
es: No se encontró el nombre del negocio, no se puede crear el código QR.
fr: Nom de l'entreprise non trouvé, impossible de créer le code QR.
it: Nome attività non trovato, impossibile creare il codice QR.
ru: Название бизнеса не найдено, невозможно создать QR-код.
tr: İşletme adı bulunamadı, QR kod oluşturulamıyor.
zh: 未找到商家名称，无法创建二维码。

# websiteSettingsSectionMap
source: Map Settings
ar: إعدادات الخريطة
de: Karten-Einstellungen
es: Ajustes del Mapa
fr: Paramètres de la Carte
it: Impostazioni Mappa
ru: Настройки карты
tr: Harita Ayarları
zh: 地图设置

# websiteSettingsLabelLatitude
source: Latitude
ar: خط العرض
de: Breitengrad
es: Latitud
it: Latitudine
ru: Широта
tr: Enlem (Latitude)
zh: 纬度

# websiteSettingsValidatorLatitude
source: Enter a valid latitude (-90 to 90)
ar: أدخل خط عرض صالح (-90 إلى 90)
de: Geben Sie einen gültigen Breitengrad ein (-90 bis 90)
es: Introduce una latitud válida (-90 a 90)
fr: Saisir une latitude valide (-90 à 90)
it: Inserisci una latitudine valida (-90 a 90)
ru: Введите действительную широту (-90 до 90)
tr: Geçerli bir enlem girin (-90 ile 90)
zh: 输入有效纬度 (-90 到 90)

# websiteSettingsLabelLongitude
source: Longitude
ar: خط الطول
de: Längengrad
es: Longitud
it: Longitudine
ru: Долгота
tr: Boylam (Longitude)
zh: 经度

# websiteSettingsValidatorLongitude
source: Enter a valid longitude (-180 to 180)
ar: أدخل خط طول صالح (-180 إلى 180)
de: Geben Sie einen gültigen Längengrad ein (-180 bis 180)
es: Introduce una longitud válida (-180 a 180)
fr: Saisir une longitude valide (-180 à 180)
it: Inserisci una longitudine valida (-180 a 180)
ru: Введите действительную долготу (-180 до 180)
tr: Geçerli bir boylam girin (-180 ile 180)
zh: 输入有效经度 (-180 到 180)

# websiteSettingsButtonSelectLocation
source: Select Location from Map
ar: تحديد الموقع من الخريطة
de: Standort von der Karte auswählen
es: Seleccionar Ubicación del Mapa
fr: Sélectionner l'Emplacement sur la Carte
it: Seleziona Posizione dalla Mappa
ru: Выбрать местоположение на карте
tr: Haritadan Konum Seç
zh: 从地图选择位置

# websiteSettingsLabelMapZoom
source: Map Zoom Level (1-20)
ar: مستوى تكبير الخريطة (1-20)
de: Karten-Zoomstufe (1-20)
es: Nivel de Zoom del Mapa (1-20)
fr: Niveau de Zoom de la Carte (1-20)
it: Livello Zoom Mappa (1-20)
ru: Масштаб карты (1-20)
tr: Harita Zoom Seviyesi (1-20)
zh: 地图缩放级别 (1-20)

# websiteSettingsValidatorZoomRequired
source: Zoom level is required
ar: مستوى التكبير مطلوب
de: Zoomstufe ist erforderlich
es: El nivel de zoom es obligatorio
fr: Le niveau de zoom est requis
it: Il livello di zoom è obbligatorio
ru: Масштаб обязателен
tr: Zoom seviyesi gereklidir
zh: 缩放级别为必填项

# websiteSettingsValidatorZoomRange
source: Enter a valid zoom level (1-20)
ar: أدخل مستوى تكبير صالح (1-20)
de: Geben Sie eine gültige Zoomstufe ein (1-20)
es: Introduce un nivel de zoom válido (1-20)
fr: Saisir un niveau de zoom valide (1-20)
it: Inserisci un livello di zoom valido (1-20)
ru: Введите действительный масштаб (1-20)
tr: Geçerli bir zoom seviyesi girin (1-20)
zh: 输入有效缩放级别 (1-20)

# websiteSettingsLabelFacebookUrl
source: Facebook URL
ar: رابط Facebook
es: URL de Facebook
fr: URL Facebook
it: URL Facebook
ru: URL-адрес Facebook

# websiteSettingsLabelInstagramUrl
source: Instagram URL
ar: رابط Instagram
es: URL de Instagram
fr: URL Instagram
it: URL Instagram
ru: URL-адрес Instagram

# websiteSettingsLabelTwitterUrl
source: Twitter/X URL
ar: رابط Twitter/X
es: URL de Twitter/X
fr: URL Twitter/X
it: URL Twitter/X
ru: URL-адрес Twitter/X

# websiteSettingsSectionOnlineActions
source: Online Actions
ar: الإجراءات عبر الإنترنت
de: Online-Aktionen
es: Acciones en Línea
fr: Actions en Ligne
it: Azioni Online
ru: Онлайн-действия
tr: Online İşlemler
zh: 在线操作
