Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# bleStatusCharacteristicFound
source: Command characteristic found. Device is ready.
ar: تم العثور على خاصية الأمر. الجهاز جاهز.
de: Befehlseigenschaft gefunden. Gerät ist bereit.
es: Característica de comando encontrada. Dispositivo listo.
fr: Caractéristique de commande trouvée. L'appareil est prêt.
it: Caratteristica di comando trovata. Dispositivo pronto.
ru: Командная характеристика найдена. Устройство готово.
tr: Komut karakteristiği bulundu. Cihaz hazır.
zh: 已找到命令特征。设备已就绪。

# bleStatusCharacteristicNotFound
source: Appropriate service/characteristic not found.
ar: لم يتم العثور على الخدمة/الخاصية المناسبة.
de: Geeigneter Dienst/Eigenschaft nicht gefunden.
es: Servicio/característica apropiado no encontrado.
fr: Service/caractéristique approprié(e) non trouvé(e).
it: Servizio/caratteristica appropriata non trovata.
ru: Подходящая служба/характеристика не найдена.
tr: Uygun servis/karakteristik bulunamadı.
zh: 未找到合适的服或特征。

# bleStatusCommandSent
source: Command sent.
ar: تم إرسال الأمر.
de: Befehl gesendet.
es: Comando enviado.
fr: Commande envoyée.
it: Comando inviato.
ru: Команда отправлена.
tr: Komut gönderildi.
zh: 命令已发送。

# bleStatusCommandError
source: Command sending error.
ar: خطأ في إرسال الأمر.
de: Fehler beim Senden des Befehls.
es: Error de envío de comando.
fr: Erreur d'envoi de commande.
it: Errore invio comando.
ru: Ошибка отправки команды.
tr: Komut gönderme hatası.
zh: 命令发送错误。

# bleStatusCommandFailed
source: Command failed to send: No connection.
ar: فشل إرسال الأمر: لا يوجد اتصال.
de: Senden des Befehls fehlgeschlagen: Keine Verbindung.
es: No se pudo enviar el comando: Sin conexión.
fr: Échec de l'envoi de commande : Aucune connexion.
it: Invio comando fallito: Nessuna connessione.
ru: Не удалось отправить команду: нет подключения.
tr: Komut gönderilemedi: Bağlantı yok.
zh: 命令发送失败: 无连接。

# bleStatusPreparingNotificationFor
source: Preparing notification for pager ID '{pagerId}'...
ar: جاري إعداد الإشعار لمعرف جهاز النداء '{pagerId}'...
de: Benachrichtigung für Pager-ID '{pagerId}' wird vorbereitet...
es: Preparando notificación para ID de localizador '{pagerId}'...
fr: Préparation de la notification pour l'ID de biper '{pagerId}'...
it: Preparazione notifica per ID pager '{pagerId}'...
ru: Подготовка уведомления для ID пейджера «{pagerId}»...
tr: '{pagerId}' ID'li çağrı cihazına bildirim hazırlanıyor...
zh: 正在为传呼机 ID “{pagerId}”准备通知...

# bleStatusCouldNotConnectForNotification
source: Could not connect to or device is not ready for pager ID '{pagerId}'.
ar: تعذر الاتصال أو الجهاز غير جاهز لمعرف جهاز النداء '{pagerId}'.
de: Verbindung zu Pager-ID '{pagerId}' konnte nicht hergestellt werden oder Gerät ist nicht bereit.
es: No se pudo conectar o el dispositivo no está listo para el ID de localizador '{pagerId}'.
fr: Impossible de se connecter ou l'appareil n'est pas prêt pour l'ID de biper '{pagerId}'.
it: Impossibile connettersi o dispositivo non pronto per ID pager '{pagerId}'.
ru: Не удалось подключиться или устройство не готово для ID пейджера «{pagerId}».
tr: '{pagerId}' ID'li çağrı cihazına bağlanılamadı veya hazır değil.
zh: 无法连接到传呼机 ID “{pagerId}”或设备未就绪。

# bleStatusNotificationSent
source: Notification sent to device ID '{pagerId}'.
ar: تم إرسال الإشعار إلى معرف الجهاز '{pagerId}'.
de: Benachrichtigung an Geräte-ID '{pagerId}' gesendet.
es: Notificación enviada al ID de dispositivo '{pagerId}'.
fr: Notification envoyée à l'ID d'appareil '{pagerId}'.
it: Notifica inviata a ID dispositivo '{pagerId}'.
ru: Уведомление отправлено на ID устройства «{pagerId}».
tr: '{pagerId}' ID'li cihaza bildirim gönderildi.
zh: 通知已发送到设备 ID “{pagerId}”。

# bleStatusNotificationError
source: Error while sending notification to device ID '{pagerId}'.
ar: خطأ أثناء إرسال الإشعار إلى معرف الجهاز '{pagerId}'.
de: Fehler beim Senden der Benachrichtigung an Geräte-ID '{pagerId}'.
es: Error al enviar notificación al ID de dispositivo '{pagerId}'.
fr: Erreur lors de l'envoi de la notification à l'ID d'appareil '{pagerId}'.
it: Errore durante l'invio della notifica a ID dispositivo '{pagerId}'.
ru: Ошибка при отправке уведомления на ID устройства «{pagerId}».
tr: '{pagerId}' ID'li cihaza bildirim gönderilirken hata.
zh: 向设备 ID “{pagerId}”发送通知时出错。

# bleStatusDeviceNotFoundAfterScan
source: Pager ID '{pagerId}' not found after scan.
ar: لم يتم العثور على معرف جهاز النداء '{pagerId}' بعد المسح.
de: Pager-ID '{pagerId}' nach dem Scan nicht gefunden.
es: ID de localizador '{pagerId}' no encontrado después del escaneo.
fr: ID de biper '{pagerId}' non trouvé après le scan.
it: ID pager '{pagerId}' non trovato dopo la scansione.
ru: ID пейджера «{pagerId}» не найден после сканирования.
tr: Çağrı cihazı ID '{pagerId}' tarama sonrası bulunamadı.
zh: 扫描后未找到传呼机 ID “{pagerId}”。

# bleDeviceNameUnknown
source: Unknown Device
ar: جهاز غير معروف
de: Unbekanntes Gerät
es: Dispositivo Desconocido
fr: Appareil Inconnu
it: Dispositivo Sconosciuto
ru: Неизвестное устройство
tr: Bilinmeyen Cihaz
zh: 未知设备

# bleDeviceNameSearchedById
source: Searched by ID
ar: تم البحث بالمعرف
de: Über ID gesucht
es: Buscado por ID
fr: Recherché par ID
it: Cercato per ID
ru: Поиск по ID
tr: ID ile Aranan
zh: 按 ID 搜索

# bleDeviceNameNotFound
source: NOT FOUND
ar: لم يتم العثور
de: NICHT GEFUNDEN
es: NO ENCONTRADO
fr: NON TROUVÉ
it: NON TROVATO
ru: НЕ НАЙДЕНО
tr: BULUNAMADI
zh: 未找到

# language
source: Application Language
ar: لغة التطبيق
de: Anwendungssprache
es: Idioma de la Aplicación
fr: Langue de l'Application
it: Lingua Applicazione
ru: Язык приложения
tr: Uygulama Dili
zh: 应用语言

# unknownErrorOccurred
source: An unknown error occurred.
ar: حدث خطأ غير معروف.
de: Ein unbekannter Fehler ist aufgetreten.
es: Ocurrió un error desconocido.
fr: Une erreur inconnue s'est produite.
it: Si è verificato un errore sconosciuto.
ru: Произошла неизвестная ошибка.
tr: Bilinmeyen bir hata oluştu.
zh: 发生未知错误。

# addOrderItemDialogSelectionError
source: Please make the necessary selections.
ar: الرجاء إجراء التحديدات اللازمة.
de: Bitte nehmen Sie die erforderlichen Auswahlen vor.
es: Por favor, realiza las selecciones necesarias.
fr: Veuillez effectuer les sélections nécessaires.
it: Per favore, effettua le selezioni necessarie.
ru: Пожалуйста, сделайте необходимые выборы.
tr: Lütfen gerekli seçimleri yapın.
zh: 请进行必要的选择。

# variantSelectionDialogTitle
source: Variant Selection: {itemName}
ar: تحديد المتغير: {itemName}
de: Variantenauswahl: {itemName}
es: Selección de Variante: {itemName}
fr: Sélection de Variante : {itemName}
it: Selezione Variante: {itemName}
ru: Выбор варианта: {itemName}
tr: Varyant Seçimi: {itemName}
zh: 变体选择: {itemName}

# variantSelectionDialogTableOwnerLabel
source: Table Owner
ar: مالك الطاولة
de: Tischnutzer
es: Propietario de Mesa
fr: Propriétaire de Table
it: Proprietario Tavolo
ru: Владелец стола
tr: Masa Sahibi
zh: 桌位所有者

# variantSelectionDialogTableOwnerValidator
source: Please select a table owner.
ar: الرجاء تحديد مالك الطاولة.
de: Bitte wählen Sie einen Tischnutzer aus.
es: Por favor, selecciona un propietario de mesa.
fr: Veuillez sélectionner un propriétaire de table.
it: Per favore, seleziona un proprietario del tavolo.
ru: Пожалуйста, выберите владельца стола.
tr: Lütfen masa sahibini seçin.
zh: 请选择一个桌位所有者。

# variantSelectionDialogVariantLabel
source: Variant
ar: المتغير
de: Variante
es: Variante
fr: Variante
it: Variante
ru: Вариант
tr: Varyant
zh: 变体

# variantSelectionDialogVariantValidator
source: Please select a variant.
ar: الرجاء تحديد متغير.
de: Bitte wählen Sie eine Variante aus.
es: Por favor, selecciona una variante.
fr: Veuillez sélectionner une variante.
it: Per favore, seleziona una variante.
ru: Пожалуйста, выберите вариант.
tr: Lütfen bir varyant seçin.
zh: 请选择一个变体。

# variantSelectionDialogExtrasLabel
source: Extra Options:
ar: الخيارات الإضافية:
de: Zusatzoptionen:
es: Opciones Extra:
fr: Options Supplémentaires :
it: Opzioni Extra:
ru: Дополнительные опции:
tr: Ekstra Seçenekler:
zh: 附加选项:

# tooltipDecrement
source: Decrement
ar: إنقاص
de: Verringern
es: Disminuir
fr: Décrémenter
it: Decrementa
ru: Уменьшить
tr: Azalt
zh: 减少

# variantSelectionDialogQuantity
source: {quantity} Pcs
ar: {quantity} قطعة
de: {quantity} Stk
es: {quantity} Unidades
it: {quantity} Pz
ru: {quantity} Шт
tr: {quantity} Adet
zh: {quantity} 件

# tooltipIncrement
source: Increment
ar: زيادة
de: Erhöhen
es: Aumentar
fr: Incrémenter
it: Incrementa
ru: Увеличить
tr: Artır
zh: 增加

# variantSelectionDialogAddToCartButton
source: Add to Cart
ar: أضف إلى السلة
de: Zum Warenkorb hinzufügen
es: Añadir al Carrito
fr: Ajouter au Panier
it: Aggiungi al Carrello
ru: Добавить в корзину
tr: Sepete Ekle
zh: 添加到购物车

# tableOrderDetailsModalUpdateError
source: Could not update order status.
ar: تعذر تحديث حالة الطلب.
de: Bestellstatus konnte nicht aktualisiert werden.
es: No se pudo actualizar el estado del pedido.
fr: Impossible de mettre à jour le statut de la commande.
it: Impossibile aggiornare lo stato dell'ordine.
ru: Не удалось обновить статус заказа.
tr: Sipariş durumu güncellenemedi.
zh: 无法更新订单状态。

# newOrderNotificationTitleNew
source: New Order!
ar: طلب جديد!
de: Neue Bestellung!
es: ¡Nuevo Pedido!
fr: Nouvelle Commande !
it: Nuovo Ordine!
ru: Новый заказ!
tr: Yeni Sipariş!
zh: 新订单！

# newOrderNotificationTitleUpdate
source: Order Updated
ar: تم تحديث الطلب
de: Bestellung aktualisiert
es: Pedido Actualizado
fr: Commande Mise à Jour
it: Ordine Aggiornato
ru: Заказ обновлен
tr: Sipariş Güncellendi
zh: 订单更新

# newOrderNotificationDefaultMessage
source: A new transaction was made.
ar: تم إجراء معاملة جديدة.
de: Es wurde eine neue Transaktion durchgeführt.
es: Se realizó una nueva transacción.
fr: Une nouvelle transaction a été effectuée.
it: È stata effettuata una nuova transazione.
ru: Произошла новая транзакция.
tr: Yeni bir işlem yapıldı.
zh: 进行了一项新的交易。

# newOrderNotificationUpdateTable
source: '{itemName}' added to order for table {tableNumber}.
ar: تمت إضافة '{itemName}' إلى طلب الطاولة {tableNumber}.
de: '{itemName}' zur Bestellung für Tisch {tableNumber} hinzugefügt.
es: '{itemName}' añadido al pedido para la mesa {tableNumber}.
fr: '{itemName}' ajouté à la commande pour la table {tableNumber}.
it: '{itemName}' aggiunto all'ordine per il tavolo {tableNumber}.
ru: «{itemName}» добавлен в заказ для стола {tableNumber}.
tr: Masa {tableNumber} siparişine '{itemName}' eklendi.
zh: “{itemName}”已添加到桌位 {tableNumber} 的订单中。

# newOrderNotificationUpdateTakeaway
source: '{itemName}' added to takeaway order.
ar: تمت إضافة '{itemName}' إلى طلب سفري.
de: '{itemName}' zur Außer-Haus-Bestellung hinzugefügt.
es: '{itemName}' añadido al pedido para llevar.
fr: '{itemName}' ajouté à la commande à emporter.
it: '{itemName}' aggiunto all'ordine da asporto.
ru: «{itemName}» добавлен в заказ на вынос.
tr: Paket siparişe '{itemName}' eklendi.
zh: “{itemName}”已添加到外卖订单中。

# newOrderNotificationUpdateTakeawayWithCustomer
source: '{itemName}' added to takeaway order ({customerName}).
ar: تمت إضافة '{itemName}' إلى طلب سفري ({customerName}).
de: '{itemName}' zur Außer-Haus-Bestellung ({customerName}) hinzugefügt.
es: '{itemName}' añadido al pedido para llevar ({customerName}).
fr: '{itemName}' ajouté à la commande à emporter ({customerName}).
it: '{itemName}' aggiunto all'ordine da asporto ({customerName}).
ru: «{itemName}» добавлен в заказ на вынос ({customerName}).
tr: Paket siparişe '{itemName}' eklendi ({customerName}).
zh: “{itemName}”已添加到外卖订单中 ({customerName})。

# newOrderNotificationUpdateGeneric
source: '{itemName}' added to the order.
ar: تمت إضافة '{itemName}' إلى الطلب.
de: '{itemName}' zur Bestellung hinzugefügt.
es: '{itemName}' añadido al pedido.
fr: '{itemName}' ajouté à la commande.
it: '{itemName}' aggiunto all'ordine.
ru: «{itemName}» добавлен в заказ.
tr: '{itemName}' siparişe eklendi.
zh: “{itemName}”已添加到订单中。

# newOrderNotificationNewOrderTable
source: New order received for table {tableNumber}. First item: '{itemName}'.
ar: تم استلام طلب جديد للطاولة {tableNumber}. العنصر الأول: '{itemName}'.
de: Neue Bestellung für Tisch {tableNumber} eingegangen. Erster Artikel: '{itemName}'.
es: Nuevo pedido recibido para la mesa {tableNumber}. Primer artículo: '{itemName}'.
fr: Nouvelle commande reçue pour la table {tableNumber}. Premier article : '{itemName}'.
it: Nuovo ordine ricevuto per il tavolo {tableNumber}. Primo articolo: '{itemName}'.
ru: Получен новый заказ для стола {tableNumber}. Первый товар: «{itemName}».
tr: Masa {tableNumber} için yeni sipariş alındı. İlk ürün: '{itemName}'.
zh: 收到桌位 {tableNumber} 的新订单。第一个产品: “{itemName}”。

# newOrderNotificationNewOrderTakeaway
source: New takeaway order received. First item: '{itemName}'.
ar: تم استلام طلب سفري جديد. العنصر الأول: '{itemName}'.
de: Neue Außer-Haus-Bestellung eingegangen. Erster Artikel: '{itemName}'.
es: Nuevo pedido para llevar recibido. Primer artículo: '{itemName}'.
fr: Nouvelle commande à emporter reçue. Premier article : '{itemName}'.
it: Nuovo ordine da asporto ricevuto. Primo articolo: '{itemName}'.
ru: Получен новый заказ на вынос. Первый товар: «{itemName}».
tr: Yeni paket sipariş alındı. İlk ürün: '{itemName}'.
zh: 收到新的外卖订单。第一个产品: “{itemName}”。

# newOrderNotificationNewOrderTakeawayWithCustomer
source: New takeaway order received ({customerName}). First item: '{itemName}'.
ar: تم استلام طلب سفري جديد ({customerName}). العنصر الأول: '{itemName}'.
de: Neue Außer-Haus-Bestellung eingegangen ({customerName}). Erster Artikel: '{itemName}'.
es: Nuevo pedido para llevar recibido ({customerName}). Primer artículo: '{itemName}'.
fr: Nouvelle commande à emporter reçue ({customerName}). Premier article : '{itemName}'.
it: Nuovo ordine da asporto ricevuto ({customerName}). Primo articolo: '{itemName}'.
ru: Получен новый заказ на вынос ({customerName}). Первый товар: «{itemName}».
tr: Yeni paket sipariş alındı ({customerName}). İlk ürün: '{itemName}'.
zh: 收到新的外卖订单 ({customerName})。第一个产品: “{itemName}”。

# newOrderNotificationNewOrderGeneric
source: New order received. First item: '{itemName}'.
ar: تم استلام طلب جديد. العنصر الأول: '{itemName}'.
de: Neue Bestellung eingegangen. Erster Artikel: '{itemName}'.
es: Nuevo pedido recibido. Primer artículo: '{itemName}'.
fr: Nouvelle commande reçue. Premier article : '{itemName}'.
it: Nuovo ordine ricevuto. Primo articolo: '{itemName}'.
ru: Получен новый заказ. Первый товар: «{itemName}».
tr: Yeni sipariş alındı. İlk ürün: '{itemName}'.
zh: 收到新订单。第一个产品: “{itemName}”。

# newOrderNotificationOrderId
source: Order ID: {orderId}
ar: معرف الطلب: {orderId}
de: Bestell-ID: {orderId}
es: ID del Pedido: {orderId}
fr: ID de la Commande : {orderId}
it: ID Ordine: {orderId}
ru: ID заказа: {orderId}
tr: Sipariş ID: {orderId}
zh: 订单 ID: {orderId}

# newOrderNotificationTableNumber
source: Table No: {tableNumber}
ar: رقم الطاولة: {tableNumber}
de: Tischnummer: {tableNumber}
es: Nº de Mesa: {tableNumber}
fr: N° de Table : {tableNumber}
it: N. Tavolo: {tableNumber}
ru: № стола: {tableNumber}
tr: Masa No: {tableNumber}
zh: 桌位号: {tableNumber}

# newOrderNotificationCustomerName
source: Customer: {customerName}
ar: العميل: {customerName}
de: Kunde: {customerName}
es: Cliente: {customerName}
fr: Client : {customerName}
it: Cliente: {customerName}
ru: Клиент: {customerName}
tr: Müşteri: {customerName}
zh: 顾客: {customerName}

# okButtonText
source: OK
ar: موافق
ru: ОК
tr: Tamam
zh: 确定

# categoryAll
source: All
ar: الكل
de: Alle
es: Todos
fr: Tout
it: Tutto
ru: Все
tr: Tümü
zh: 全部

# menuNoProductsInCategory
source: No products found in the selected category.
ar: لم يتم العثور على منتجات في الفئة المحددة.
de: Keine Produkte in der ausgewählten Kategorie gefunden.
es: No se encontraron productos en la categoría seleccionada.
fr: Aucun produit trouvé dans la catégorie sélectionnée.
it: Nessun prodotto trovato nella categoria selezionata.
ru: В выбранной категории продукты не найдены.
tr: Seçilen kategoride ürün bulunamadı.
zh: 所选类别中没有找到产品。

# menuVariantsAvailable
source: Variants available
ar: المتغيرات متاحة
de: Varianten verfügbar
es: Variantes disponibles
fr: Variantes disponibles
it: Varianti disponibili
ru: Варианты доступны
tr: Varyant seçenekleri mevcut
zh: 有变体可用

# basketTitle
source: Cart
ar: السلة
de: Warenkorb
es: Carrito
fr: Panier
it: Carrello
ru: Корзина
tr: Sepet
zh: 购物车

# removeFromBasketTooltip
source: Remove from Cart
ar: إزالة من السلة
de: Aus dem Warenkorb entfernen
es: Eliminar del Carrito
fr: Retirer du Panier
it: Rimuovi dal Carrello
ru: Удалить из корзины
tr: Sepetten Kaldır
zh: 从购物车中移除

# tableTypeModalOwnersTitle
source: Enter Table Owners (Min 2)
ar: أدخل مالكي الطاولة (حد أدنى 2)
de: Tischnutzer eingeben (Min. 2)
es: Introducir Propietarios de Mesa (Mín. 2)
fr: Saisir les Propriétaires de Table (Min 2)
it: Inserisci Proprietari Tavolo (Min 2)
ru: Введите владельцев стола (Мин. 2)
tr: Masa Sahiplerini Girin (En az 2)
zh: 输入桌位所有者 (最少 2 个)

# continueButtonText
source: Continue
ar: متابعة
de: Weiter
es: Continuar
fr: Continuer
it: Continua
ru: Продолжить
tr: Devam
zh: 继续

# kitchenDialogTitleDefault
source: New Order at the Kitchen!
ar: طلب جديد في المطبخ!
de: Neue Bestellung in der Küche!
es: ¡Nuevo Pedido en la Cocina!
fr: Nouvelle Commande à la Cuisine !
it: Nuovo Ordine in Cucina!
ru: Новый заказ на кухне!
tr: Yeni Sipariş Mutfakta!
zh: 厨房收到新订单！

# kitchenDialogTitleWithKds
source: New Order Sent to {kdsName}!
ar: تم إرسال طلب جديد إلى {kdsName}!
de: Neue Bestellung an {kdsName} gesendet!
es: ¡Nuevo Pedido Enviado a {kdsName}!
fr: Nouvelle Commande Envoyée à {kdsName} !
it: Nuovo Ordine Inviato a {kdsName}!
ru: Новый заказ отправлен в {kdsName}!
tr: Yeni Sipariş {kdsName}'a İletildi!
zh: 新订单已发送至 {kdsName}！

# kitchenDialogMessageDefault
source: A new order has been confirmed and sent to the kitchen!
ar: تم تأكيد طلب جديد وإرساله إلى المطبخ!
de: Eine neue Bestellung wurde bestätigt und an die Küche gesendet!
es: ¡Un nuevo pedido ha sido confirmado y enviado a la cocina!
fr: Une nouvelle commande a été confirmée et envoyée à la cuisine !
it: Un nuovo ordine è stato confermato e inviato in cucina!
ru: Новый заказ подтвержден и отправлен на кухню!
tr: Yeni bir sipariş onaylandı ve mutfağa iletildi!
zh: 新订单已确认并发送至厨房！

# kitchenDialogMessageTable
source: A new order for table {tableNumber} has been confirmed and sent to the kitchen.
ar: تم تأكيد طلب جديد للطاولة {tableNumber} وإرساله إلى المطبخ.
de: Eine neue Bestellung für Tisch {tableNumber} wurde bestätigt und an die Küche gesendet.
es: Un nuevo pedido para la mesa {tableNumber} ha sido confirmado y enviado a la cocina.
fr: Une nouvelle commande pour la table {tableNumber} a été confirmée et envoyée à la cuisine.
it: Un nuovo ordine per il tavolo {tableNumber} è stato confermato e inviato in cucina.
ru: Новый заказ для стола {tableNumber} подтвержден и отправлен на кухню.
tr: Masa {tableNumber} için yeni sipariş onaylandı ve mutfağa iletildi.
zh: 桌位 {tableNumber} 的新订单已确认并发送至厨房。

# kitchenDialogMessageTakeawayCustomer
source: Takeaway order for {customerName} has been confirmed and sent to the kitchen.
ar: تم تأكيد طلب سفري لـ {customerName} وإرساله إلى المطبخ.
de: Außer-Haus-Bestellung für {customerName} wurde bestätigt und an die Küche gesendet.
es: El pedido para llevar de {customerName} ha sido confirmado y enviado a la cocina.
fr: La commande à emporter pour {customerName} a été confirmée et envoyée à la cuisine.
it: L'ordine da asporto per {customerName} è stato confermato e inviato in cucina.
ru: Заказ на вынос для {customerName} подтвержден и отправлен на кухню.
tr: {customerName} isimli paket sipariş onaylandı ve mutfağa iletildi.
zh: {customerName} 的外卖订单已确认并发送至厨房。

# kitchenDialogMessageTakeawayId
source: Takeaway order (ID: {orderId}) has been confirmed and sent to the kitchen.
ar: تم تأكيد طلب سفري (المعرف: {orderId}) وإرساله إلى المطبخ.
de: Außer-Haus-Bestellung (ID: {orderId}) wurde bestätigt und an die Küche gesendet.
es: El pedido para llevar (ID: {orderId}) ha sido confirmado y enviado a la cocina.
fr: La commande à emporter (ID : {orderId}) a été confirmée et envoyée à la cuisine.
it: L'ordine da asporto (ID: {orderId}) è stato confermato e inviato in cucina.
ru: Заказ на вынос (ID: {orderId}) подтвержден и отправлен на кухню.
tr: Paket sipariş (ID: {orderId}) onaylandı ve mutfağa iletildi.
zh: 外卖订单 (ID: {orderId}) 已确认并发送至厨房。

# tableCellItemPickupErrorWithDetails
source: Could not pick up item: {statusCode} - {details}
ar: تعذر استلام العنصر: {statusCode} - {details}
de: Artikel konnte nicht abgeholt werden: {statusCode} - {details}
es: No se pudo recoger el artículo: {statusCode} - {details}
fr: Impossible de ramasser l'article : {statusCode} - {details}
it: Impossibile ritirare l'articolo: {statusCode} - {details}
ru: Не удалось забрать товар: {statusCode} - {details}
tr: Ürün alınamadı: {statusCode} - {details}
zh: 无法取走产品: {statusCode} - {details}

# tableCellItemPickupErrorGeneric
source: Item pickup error: {error}
ar: خطأ في استلام العنصر: {error}
de: Fehler beim Abholen des Artikels: {error}
es: Error al recoger artículo: {error}
fr: Erreur de ramassage d'article : {error}
it: Errore ritiro articolo: {error}
ru: Ошибка получения товара: {error}
tr: Ürün alma hatası: {error}
zh: 产品取走错误: {error}

# tableCellDeliverErrorWithStatus
source: Error during delivery: {statusCode}
ar: خطأ أثناء التسليم: {statusCode}
de: Fehler bei der Auslieferung: {statusCode}
es: Error durante la entrega: {statusCode}
fr: Erreur lors de la livraison : {statusCode}
it: Errore durante la consegna: {statusCode}
ru: Ошибка при доставке: {statusCode}
tr: Teslim işlemi sırasında hata: {statusCode}
zh: 交付过程中出错: {statusCode}

# tableCellDeliverErrorGeneric
source: Delivery error: {error}
ar: خطأ في التسليم: {error}
de: Auslieferungsfehler: {error}
es: Error de entrega: {error}
fr: Erreur de livraison : {error}
it: Errore consegna: {error}
ru: Ошибка доставки: {error}
tr: Teslim işlemi hatası: {error}
zh: 交付错误: {error}

# tableCellDefaultTitle
source: Table {tableNumber}
ar: الطاولة {tableNumber}
de: Tisch {tableNumber}
es: Mesa {tableNumber}
it: Tavolo {tableNumber}
ru: Стол {tableNumber}
tr: Masa {tableNumber}
zh: 桌位 {tableNumber}

# tableCellTooltipDeliveredToCustomer
source: Delivered to customer
ar: تم التسليم للعميل
de: An Kunden ausgeliefert
es: Entregado al cliente
fr: Livré au client
it: Consegnato al cliente
ru: Доставлено клиенту
tr: Müşteriye teslim edildi
zh: 已送达顾客

# tableCellTooltipMarkAsPickedUpByWaiter
source: Mark as Picked Up by Waiter
ar: وضع علامة كـ تم الاستلام من قبل النادل
de: Als vom Kellner abgeholt markieren
es: Marcar como Recogido por Camarero
fr: Marquer comme Ramassé par le Serveur
it: Segna come Ritirato dal Cameriere
ru: Отметить как забранный официантом
tr: Garson Aldı Olarak İşaretle
zh: 标记为服务员已取走

# tableCellTooltipDeliverToCustomer
source: Deliver to Customer
ar: التسليم للعميل
de: An Kunden ausliefern
es: Entregar al Cliente
fr: Livrer au Client
it: Consegna al Cliente
ru: Доставить клиенту
tr: Müşteriye Teslim Et
zh: 送达顾客

# kdsStatusPreparing
source: Preparing at the Kitchen
ar: قيد التحضير في المطبخ
de: Wird in der Küche zubereitet
es: En Preparación en Cocina
fr: En Préparation à la Cuisine
it: In Preparazione in Cucina
ru: Готовится на кухне
tr: Mutfakta Hazırlanıyor
zh: 正在厨房准备中

# tableCellTooltipWaitingForKitchen
source: Waiting for kitchen
ar: في انتظار المطبخ
de: Warten auf Küche
es: Esperando cocina
fr: En attente de la cuisine
it: In attesa della cucina
ru: Ожидание кухни
tr: Mutfak için bekliyor
zh: 等待厨房

# newItemSuffix
source: (New)
ar: (جديد)
de: (Neu)
es: (Nuevo)
fr: (Nouveau)
it: (Nuovo)
ru: (Новый)
tr: (Yeni)
zh: (新)

# tableCellNoOrderItems
source: No order items
ar: لا توجد عناصر في الطلب
de: Keine Bestellpositionen
es: No hay artículos en el pedido
fr: Aucun article de commande
it: Nessun articolo d'ordine
ru: Нет товаров в заказе
tr: Sipariş öğesi yok
zh: 无订单项
