Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# addOrEditButton
source: Add/Edit
ar: إضافة/تعديل
de: Hinzufügen/Bearbeiten
es: Añadir/Editar
fr: Ajouter/Modifier
it: Aggiungi/Modifica
ru: Добавить/Редактировать
tr: Ekle/Düzenle
zh: 添加/编辑

# addProductOrEditTooltip
source: Add / Edit Product
ar: إضافة / تعديل المنتج
de: Produkt hinzufügen / bearbeiten
es: Añadir / Editar Producto
fr: Ajouter / Modifier le Produit
it: Aggiungi / Modifica Prodotto
ru: Добавить / Редактировать продукт
tr: Ürün Ekle / Düzenle
zh: 添加/编辑产品

# otherActionsTooltip
source: Other Actions
ar: إجراءات أخرى
de: Weitere Aktionen
es: Otras Acciones
fr: Autres Actions
it: Altre Azioni
ru: Другие действия
tr: Diğer İşlemler
zh: 其他操作

# transferTableMenuItem
source: Transfer Table
ar: تحويل الطاولة
de: Tisch übertragen
es: Transferir Mesa
fr: Transférer la Table
it: Trasferisci Tavolo
ru: Перевести стол
tr: Masayı Taşı
zh: 转移桌位

# cancelOrderMenuItem
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# readyForPickupTitle
source: Kitchen Ready!
ar: المطبخ جاهز!
de: Küche Fertig!
es: ¡Cocina Lista!
fr: Cuisine Prête !
it: Cucina Pronta!
ru: Кухня готова!
tr: Mutfak Hazır!
zh: 厨房准备就绪！

# readyForPickupMessageDefault
source: An order is ready at the kitchen, waiting for the waiter!
ar: طلب جاهز في المطبخ، في انتظار النادل!
de: Eine Bestellung ist in der Küche fertig, wartet auf den Kellner!
es: ¡Un pedido está listo en la cocina, esperando al camarero!
fr: Une commande est prête à la cuisine, en attente du serveur !
it: Un ordine è pronto in cucina, in attesa del cameriere!
ru: Заказ готов на кухне, ожидает официанта!
tr: Bir sipariş mutfakta hazır, garson bekleniyor!
zh: 订单在厨房准备就绪，等待服务员！

# readyForPickupMessageTable
source: Order for table {tableNumber} is ready at the kitchen, waiting to be picked up by the waiter.
ar: طلب الطاولة {tableNumber} جاهز في المطبخ، في انتظار أن يستلمه النادل.
de: Bestellung für Tisch {tableNumber} ist in der Küche fertig, wartet auf Abholung durch den Kellner.
es: El pedido para la mesa {tableNumber} está listo en la cocina, esperando ser recogido por el camarero.
fr: La commande pour la table {tableNumber} est prête à la cuisine, en attente d'être ramassée par le serveur.
it: L'ordine per il tavolo {tableNumber} è pronto in cucina, in attesa di essere ritirato dal cameriere.
ru: Заказ для стола {tableNumber} готов на кухне, ожидает получения официантом.
tr: Masa {tableNumber} siparişi mutfakta hazır, garson tarafından alınmayı bekliyor.
zh: 桌位 {tableNumber} 的订单在厨房准备就绪，等待服务员取走。

# readyForPickupMessageTakeawayCustomer
source: Takeaway order for {customerName} is ready at the kitchen, waiting to be picked up by the waiter.
ar: طلب سفري لـ {customerName} جاهز في المطبخ، في انتظار أن يستلمه النادل.
de: Außer-Haus-Bestellung für {customerName} ist in der Küche fertig, wartet auf Abholung durch den Kellner.
es: El pedido para llevar de {customerName} está listo en la cocina, esperando ser recogido por el camarero.
fr: La commande à emporter pour {customerName} est prête à la cuisine, en attente d'être ramassée par le serveur.
it: L'ordine da asporto per {customerName} è pronto in cucina, in attesa di essere ritirato dal cameriere.
ru: Заказ на вынос для {customerName} готов на кухне, ожидает получения официантом.
tr: {customerName} isimli paket sipariş mutfakta hazır, garson tarafından alınmayı bekliyor.
zh: {customerName} 的外卖订单在厨房准备就绪，等待服务员取走。

# readyForPickupMessageTakeawayId
source: Takeaway order (ID: {orderId}) is ready at the kitchen, waiting to be picked up by the waiter.
ar: طلب سفري (المعرف: {orderId}) جاهز في المطبخ، في انتظار أن يستلمه النادل.
de: Außer-Haus-Bestellung (ID: {orderId}) ist in der Küche fertig, wartet auf Abholung durch den Kellner.
es: El pedido para llevar (ID: {orderId}) está listo en la cocina, esperando ser recogido por el camarero.
fr: La commande à emporter (ID : {orderId}) est prête à la cuisine, en attente d'être ramassée par le serveur.
it: L'ordine da asporto (ID: {orderId}) è pronto in cucina, in attesa di essere ritirato dal cameriere.
ru: Заказ на вынос (ID: {orderId}) готов на кухне, ожидает получения официантом.
tr: Paket sipariş (ID: {orderId}) mutfakta hazır, garson tarafından alınmayı bekliyor.
zh: 外卖订单 (ID: {orderId}) 在厨房准备就绪，等待服务员取走。

# kdsCouldNotMarkPreparing
source: Could not mark item as preparing: {statusCode}
ar: تعذر وضع علامة قيد التحضير على العنصر: {statusCode}
de: Artikel konnte nicht als in Zubereitung markiert werden: {statusCode}
es: No se pudo marcar el artículo como en preparación: {statusCode}
fr: Impossible de marquer l'article comme en préparation : {statusCode}
it: Impossibile segnare l'articolo come in preparazione: {statusCode}
ru: Не удалось отметить товар как готовящийся: {statusCode}
tr: Ürün hazırlanıyor olarak işaretlenemedi: {statusCode}
zh: 无法将产品标记为准备中: {statusCode}

# kdsCouldNotMarkReady
source: Could not mark item as ready: {statusCode}
ar: تعذر وضع علامة جاهز على العنصر: {statusCode}
de: Artikel konnte nicht als fertig markiert werden: {statusCode}
es: No se pudo marcar el artículo como listo: {statusCode}
fr: Impossible de marquer l'article comme prêt : {statusCode}
it: Impossibile segnare l'articolo come pronto: {statusCode}
ru: Не удалось отметить товар как готовый: {statusCode}
tr: Ürün hazır olarak işaretlenemedi: {statusCode}
zh: 无法将产品标记为准备就绪: {statusCode}

# kdsNoItemsForKds
source: No items for this KDS.
ar: لا توجد عناصر لشاشة KDS هذه.
de: Keine Artikel für diesen KDS.
es: No hay artículos para este KDS.
fr: Aucun article pour ce KDS.
it: Nessun articolo per questo KDS.
ru: Нет товаров для этого KDS.
tr: Bu KDS için ürün kalemi yok.
zh: 此 KDS 没有产品。

# kdsTooltipStartPreparing
source: Start Preparing
ar: بدء التحضير
de: Mit der Zubereitung beginnen
es: Empezar a Preparar
fr: Commencer la Préparation
it: Inizia Preparazione
ru: Начать приготовление
tr: Hazırlamaya Başla
zh: 开始准备

# kdsTooltipMarkAsReady
source: Mark as Ready
ar: وضع علامة كـ جاهز
de: Als fertig markieren
es: Marcar como Listo
fr: Marquer comme Prêt
it: Segna come Pronto
ru: Отметить как готовый
tr: Hazır Olarak İşaretle
zh: 标记为准备就绪

# infoTransferringTable
source: Transferring table...
ar: جاري تحويل الطاولة...
de: Tisch wird übertragen...
es: Transfiriendo mesa...
fr: Transfert de table en cours...
it: Trasferimento tavolo in corso...
ru: Перевод стола...
tr: Masa transfer ediliyor...
zh: 正在转移桌位...

# infoTransferSuccess
source: Table transfer successful.
ar: تم تحويل الطاولة بنجاح.
de: Tischübertragung erfolgreich.
es: Transferencia de mesa exitosa.
fr: Transfert de table réussi.
it: Trasferimento tavolo completato con successo.
ru: Перевод стола успешен.
tr: Masa transferi başarılı.
zh: 桌位转移成功。

# errorTransferringTable
source: Error during table transfer: {statusCode} - {details}
ar: خطأ أثناء تحويل الطاولة: {statusCode} - {details}
de: Fehler bei der Tischübertragung: {statusCode} - {details}
es: Error durante la transferencia de mesa: {statusCode} - {details}
fr: Erreur lors du transfert de table : {statusCode} - {details}
it: Errore durante il trasferimento del tavolo: {statusCode} - {details}
ru: Ошибка при переводе стола: {statusCode} - {details}
tr: Masa transferi sırasında hata oluştu: {statusCode} - {details}
zh: 桌位转移错误: {statusCode} - {details}

# errorTransferGeneric
source: Transfer error: {error}
ar: خطأ في التحويل: {error}
de: Übertragungsfehler: {error}
es: Error de transferencia: {error}
fr: Erreur de transfert : {error}
it: Errore di trasferimento: {error}
ru: Ошибка перевода: {error}
tr: Transfer hatası: {error}
zh: 转移错误: {error}

# infoCancellingOrder
source: Cancelling order...
ar: جاري إلغاء الطلب...
de: Bestellung wird storniert...
es: Cancelando pedido...
fr: Annulation de la commande en cours...
it: Annullamento ordine in corso...
ru: Отмена заказа...
tr: Sipariş iptal ediliyor...
zh: 正在取消订单...

# errorUnknownServer
source: Unknown server error.
ar: خطأ خادم غير معروف.
de: Unbekannter Serverfehler.
es: Error de servidor desconocido.
fr: Erreur de serveur inconnue.
it: Errore del server sconosciuto.
ru: Неизвестная ошибка сервера.
tr: Bilinmeyen sunucu hatası.
zh: 未知服务器错误。

source: Error during cancellation.
ar: خطأ أثناء الإلغاء.
de: Fehler während der Stornierung.
es: Error durante la cancelación.
fr: Erreur lors de l'annulation.
it: Errore durante l'annullamento.
ru: Ошибка при отмене.
tr: İptal sırasında hata.
zh: 取消过程中出错。

# errorCancellingOrderWithDetails
source: Error during order cancellation: {statusCode} - {details}
ar: خطأ أثناء إلغاء الطلب: {statusCode} - {details}
de: Fehler während der Bestellstornierung: {statusCode} - {details}
es: Error durante la cancelación del pedido: {statusCode} - {details}
fr: Erreur lors de l'annulation de la commande : {statusCode} - {details}
it: Errore durante l'annullamento dell'ordine: {statusCode} - {details}
ru: Ошибка при отмене заказа: {statusCode} - {details}
tr: Sipariş iptali sırasında hata oluştu: {statusCode} - {details}
zh: 订单取消错误: {statusCode} - {details}

# errorCancellationGeneric
source: Cancellation error: {error}
ar: خطأ في الإلغاء: {error}
de: Stornierungsfehler: {error}
es: Error de cancelación: {error}
fr: Erreur d'annulation : {error}
it: Errore di annullamento: {error}
ru: Ошибка отмены: {error}
tr: İptal hatası: {error}
zh: 取消错误: {error}

# infoApprovingOrder
source: Approving order...
ar: جاري الموافقة على الطلب...
de: Bestellung wird genehmigt...
es: Aprobando pedido...
fr: Approbation de la commande en cours...
it: Approvazione ordine in corso...
ru: Одобрение заказа...
tr: Sipariş onaylanıyor...
zh: 正在批准订单...

# infoGuestOrderApproved
source: Guest order approved.
ar: تمت الموافقة على طلب الضيف.
de: Gastbestellung genehmigt.
es: Pedido de invitado aprobado.
fr: Commande invité approuvée.
it: Ordine ospite approvato.
ru: Гостевой заказ одобрен.
tr: Misafir siparişi onaylandı.
zh: 客人订单已批准。

# errorApprovingOrder
source: Error during order approval: {statusCode} - {details}
ar: خطأ أثناء الموافقة على الطلب: {statusCode} - {details}
de: Fehler bei der Bestellgenehmigung: {statusCode} - {details}
es: Error durante la aprobación del pedido: {statusCode} - {details}
fr: Erreur lors de l'approbation de la commande : {statusCode} - {details}
it: Errore durante l'approvazione dell'ordine: {statusCode} - {details}
ru: Ошибка при одобрении заказа: {statusCode} - {details}
tr: Sipariş onayı sırasında hata: {statusCode} - {details}
zh: 订单批准错误: {statusCode} - {details}

# errorApprovalGeneric
source: Order approval error: {error}
ar: خطأ في الموافقة على الطلب: {error}
de: Fehler bei der Bestellgenehmigung: {error}
es: Error de aprobación de pedido: {error}
fr: Erreur d'approbation de la commande : {error}
it: Errore di approvazione ordine: {error}
ru: Ошибка одобрения заказа: {error}
tr: Sipariş onay hatası: {error}
zh: 订单批准错误: {error}

# infoRejectingOrder
source: Rejecting order...
ar: جاري رفض الطلب...
de: Bestellung wird abgelehnt...
es: Rechazando pedido...
fr: Rejet de la commande en cours...
it: Rifiuto ordine in corso...
ru: Отклонение заказа...
tr: Sipariş reddediliyor...
zh: 正在拒绝订单...

# infoGuestOrderRejected
source: Guest order rejected.
ar: تم رفض طلب الضيف.
de: Gastbestellung abgelehnt.
es: Pedido de invitado rechazado.
fr: Commande invité rejetée.
it: Ordine ospite rifiutato.
ru: Гостевой заказ отклонен.
tr: Misafir siparişi reddedildi.
zh: 客人订单已拒绝。

# errorRejectingOrder
source: Error during order rejection: {statusCode} - {details}
ar: خطأ أثناء رفض الطلب: {statusCode} - {details}
de: Fehler bei der Bestellablehnung: {statusCode} - {details}
es: Error durante el rechazo del pedido: {statusCode} - {details}
fr: Erreur lors du rejet de la commande : {statusCode} - {details}
it: Errore durante il rifiuto dell'ordine: {statusCode} - {details}
ru: Ошибка при отклонении заказа: {statusCode} - {details}
tr: Sipariş reddi sırasında hata: {statusCode} - {details}
zh: 订单拒绝错误: {statusCode} - {details}

# errorRejectionGeneric
source: Order rejection error: {error}
ar: خطأ في رفض الطلب: {error}
de: Fehler bei der Bestellablehnung: {error}
es: Error de rechazo de pedido: {error}
fr: Erreur de rejet de la commande : {error}
it: Errore di rifiuto ordine: {error}
ru: Ошибка отклонения заказа: {error}
tr: Sipariş reddetme hatası: {error}
zh: 订单拒绝错误: {error}

# orderItemLineTotal
source: Line Total: {amount} {currency}
ar: إجمالي السطر: {amount} {currency}
de: Gesamtpreis der Position: {amount} {currency}
es: Total de Línea: {amount} {currency}
fr: Total Ligne : {amount} {currency}
it: Totale Riga: {amount} {currency}
ru: Итого по строке: {amount} {currency}
tr: Kalem Toplam: {amount} {currency}
zh: 行总计: {amount} {currency}

# pendingOrderCardSubtitle
source: Total Amount: {formattedAmount}
ar: المبلغ الإجمالي: {formattedAmount}
de: Gesamtbetrag: {formattedAmount}
es: Importe Total: {formattedAmount}
fr: Montant Total : {formattedAmount}
it: Importo Totale: {formattedAmount}
ru: Общая сумма: {formattedAmount}
tr: Toplam Tutar: {formattedAmount}
zh: 总金额: {formattedAmount}

# paymentProcessingAmountLabel
source: Amount to Pay: {formattedAmount}
ar: المبلغ المطلوب دفعه: {formattedAmount}
de: Zu zahlender Betrag: {formattedAmount}
es: Importe a Pagar: {formattedAmount}
fr: Montant à Payer : {formattedAmount}
it: Importo da Pagare: {formattedAmount}
ru: Сумма к оплате: {formattedAmount}
tr: Ödenecek Tutar: {formattedAmount}
zh: 应付金额: {formattedAmount}

# staffPerformanceTurnoverLabel
source: Sales Turnover: {amount} {currency}
ar: إيرادات المبيعات: {amount} {currency}
de: Umsatz: {amount} {currency}
es: Facturación de Ventas: {amount} {currency}
fr: Chiffre d'Affaires : {amount} {currency}
it: Fatturato Vendite: {amount} {currency}
ru: Оборот продаж: {amount} {currency}
tr: Satış Cirosu: {amount} {currency}
zh: 销售额: {amount} {currency}

# creditSalesCardTotalAmount
source: Total Amount: {amount} {currency}
ar: المبلغ الإجمالي: {amount} {currency}
de: Gesamtbetrag: {amount} {currency}
es: Importe Total: {amount} {currency}
fr: Montant Total : {amount} {currency}
it: Importo Totale: {amount} {currency}
ru: Общая сумма: {amount} {currency}
tr: Toplam Tutar: {amount} {currency}
zh: 总金额: {amount} {currency}

# campaignItemDetails
source: Qty: {quantity} - Normal Price: {price} {currency}
ar: الكمية: {quantity} - السعر العادي: {price} {currency}
de: Menge: {quantity} - Normalpreis: {price} {currency}
es: Cant: {quantity} - Precio Normal: {price} {currency}
fr: Qté : {quantity} - Prix Normal : {price} {currency}
it: Qtà: {quantity} - Prezzo Normale: {price} {currency}
ru: Кол-во: {quantity} - Обычная цена: {price} {currency}
tr: Adet: {quantity} - Normal Fiyat: {price} {currency}
zh: 数量: {quantity} - 正常价格: {price} {currency}

# campaignContentTitle
source: Campaign Content (Normal Total: {total} {currency})
ar: محتوى الحملة (الإجمالي العادي: {total} {currency})
de: Kampagneninhalt (Normal-Gesamt: {total} {currency})
es: Contenido de la Campaña (Total Normal: {total} {currency})
fr: Contenu de la Campagne (Total Normal : {total} {currency})
it: Contenuto Campagna (Totale Normale: {total} {currency})
ru: Содержимое кампании (Общая обычная цена: {total} {currency})
tr: Kampanya İçeriği (Normal Toplam: {total} {currency})
zh: 促销活动内容 (正常总计: {total} {currency})

# orderCardSubtitleDetails
source: Amount: {totalAmount} Payment: {paymentType} Date: {displayDate} Time: {displayTime}
ar: المبلغ: {totalAmount} الدفع: {paymentType} التاريخ: {displayDate} الوقت: {displayTime}
de: Betrag: {totalAmount} Zahlung: {paymentType} Datum: {displayDate} Uhrzeit: {displayTime}
es: Importe: {totalAmount} Pago: {paymentType} Fecha: {displayDate} Hora: {displayTime}
fr: Montant : {totalAmount} Paiement : {paymentType} Date : {displayDate} Heure : {displayTime}
it: Importo: {totalAmount} Pagamento: {paymentType} Data: {displayDate} Ora: {displayTime}
ru: Сумма: {totalAmount} Оплата: {paymentType} Дата: {displayDate} Время: {displayTime}
tr: Tutar: {totalAmount} Ödeme: {paymentType} Tarih: {displayDate} Saat: {displayTime}
zh: 金额: {totalAmount} 支付方式: {paymentType} 日期: {displayDate} 时间: {displayTime}

# paymentModalTotalAmount
source: Total: {amount} {currency} ({paymentType})
ar: الإجمالي: {amount} {currency} ({paymentType})
de: Gesamt: {amount} {currency} ({paymentType})
it: Totale: {amount} {currency} ({paymentType})
ru: Итого: {amount} {currency} ({paymentType})
tr: Toplam: {amount} {currency} ({paymentType})
zh: 总计: {amount} {currency} ({paymentType})

# newOrderBasketTotal
source: Cart Total: {totalAmount} ({currency})
ar: إجمالي السلة: {totalAmount} ({currency})
de: Warenkorb-Gesamt: {totalAmount} ({currency})
es: Total del Carrito: {totalAmount} ({currency})
fr: Total du Panier : {totalAmount} ({currency})
it: Totale Carrello: {totalAmount} ({currency})
ru: Итого корзины: {totalAmount} ({currency})
tr: Sepet Toplamı: {totalAmount} ({currency})
zh: 购物车总计: {totalAmount} ({currency})

# newOrderBasketTotalLabel
source: Total: {formattedAmount}
ar: الإجمالي: {formattedAmount}
de: Gesamt: {formattedAmount}
it: Totale: {formattedAmount}
ru: Итого: {formattedAmount}
tr: Toplam: {formattedAmount}
zh: 总计: {formattedAmount}

# businessSettingsTitle
source: Business Settings
ar: إعدادات العمل
de: Geschäftseinstellungen
es: Ajustes del Negocio
fr: Paramètres de l'Entreprise
it: Impostazioni Attività
ru: Настройки бизнеса
tr: İşletme Ayarları
zh: 商家设置

# homeMenuBusinessSettings
source: Business Settings
ar: إعدادات العمل
de: Geschäftseinstellungen
es: Ajustes del Negocio
fr: Paramètres de l'Entreprise
it: Impostazioni Attività
ru: Настройки бизнеса
tr: İşletme Ayarları
zh: 商家设置

# businessSettingsCurrencyLabel
source: Business Currency
ar: عملة العمل
de: Geschäftswährung
es: Moneda del Negocio
fr: Devise de l'Entreprise
it: Valuta Attività
ru: Валюта бизнеса
tr: İşletme Para Birimi
zh: 商家货币

# businessSettingsSuccess
source: Settings saved successfully.
ar: تم حفظ الإعدادات بنجاح.
de: Einstellungen erfolgreich gespeichert.
es: Ajustes guardados con éxito.
fr: Paramètres enregistrés avec succès.
it: Impostazioni salvate con successo.
ru: Настройки успешно сохранены.
tr: Ayarlar başarıyla kaydedildi.
zh: 设置保存成功。

# businessSettingsError
source: Error saving settings: {error}
ar: خطأ في حفظ الإعدادات: {error}
de: Fehler beim Speichern der Einstellungen: {error}
es: Error al guardar ajustes: {error}
fr: Erreur lors de l'enregistrement des paramètres : {error}
it: Errore durante il salvataggio delle impostazioni: {error}
ru: Ошибка сохранения настроек: {error}
tr: Ayarları kaydederken hata: {error}
zh: 保存设置错误: {error}

# permissionViewReports
source: View Reports
ar: عرض التقارير
de: Berichte anzeigen
es: Ver Informes
fr: Afficher les Rapports
it: Visualizza Report
ru: Просмотр отчетов
tr: Raporları Görüntüleme
zh: 查看报告

# permissionManageCreditSales
source: Manage Credit Sales
ar: إدارة المبيعات الآجلة
de: Kreditverkäufe verwalten
es: Gestionar Ventas a Crédito
fr: Gérer les Ventes à Crédit
it: Gestisci Vendite a Credito
ru: Управление продажами в кредит
tr: Veresiye Satış Yönetimi
zh: 管理赊账销售

# permissionManageMenu
source: Manage Menu
ar: إدارة القائمة
de: Menü verwalten
es: Gestionar Menú
fr: Gérer le Menu
it: Gestisci Menù
ru: Управление меню
tr: Menü Yönetimi
zh: 管理菜单

# permissionManageStock
source: Manage Stock
ar: إدارة المخزون
de: Lager verwalten
es: Gestionar Stock
fr: Gérer les Stocks
it: Gestisci Magazzino
ru: Управление запасами
tr: Stok Yönetimi
zh: 管理库存

# permissionManageTables
source: Manage Tables
ar: إدارة الطاولات
de: Tische verwalten
es: Gestionar Mesas
fr: Gérer les Tables
it: Gestisci Tavoli
ru: Управление столами
tr: Masa Yönetimi
zh: 管理桌位

# permissionViewCompletedOrders
source: View Completed Orders
ar: عرض الطلبات المكتملة
de: Abgeschlossene Bestellungen anzeigen
es: Ver Pedidos Completados
fr: Afficher les Commandes Terminées
it: Visualizza Ordini Completati
ru: Просмотр завершенных заказов
tr: Tamamlanmış Siparişleri Görüntüleme
zh: 查看已完成订单

# permissionViewPendingOrders
source: View Pending Orders
ar: عرض الطلبات المعلقة
de: Ausstehende Bestellungen anzeigen
es: Ver Pedidos Pendientes
fr: Afficher les Commandes en Attente
it: Visualizza Ordini in Sospeso
ru: Просмотр неоплаченных заказов
tr: Bekleyen Siparişleri Görüntüleme
zh: 查看待处理订单

# permissionTakeOrders
source: Take Orders
ar: تلقي الطلبات
de: Bestellungen aufnehmen
es: Tomar Pedidos
fr: Prendre les Commandes
it: Prendi Ordini
ru: Прием заказов
tr: Sipariş Alma
zh: 接受订单

# permissionManageStaff
source: Manage Staff
ar: إدارة الموظفين
de: Personal verwalten
es: Gestionar Personal
fr: Gérer le Personnel
it: Gestisci Staff
ru: Управление персоналом
tr: Personel Yönetimi
zh: 管理员工

# permissionManageWaitingCustomers
source: Manage Waiting Customers
ar: إدارة العملاء المنتظرين
de: Wartende Kunden verwalten
es: Gestionar Clientes en Espera
fr: Gérer les Clients en Attente
it: Gestisci Clienti in Attesa
ru: Управление ожидающими клиентами
tr: Bekleyen Müşteri Yönetimi
zh: 管理等待中的顾客

# permissionViewAccountSettings
source: View Account Settings
ar: عرض إعدادات الحساب
de: Kontoeinstellungen anzeigen
es: Ver Ajustes de Cuenta
fr: Afficher les Paramètres du Compte
it: Visualizza Impostazioni Account
ru: Просмотр настроек аккаунта
tr: Hesap Ayarları
zh: 查看帐户设置

# permissionManageKds
source: Manage Kitchen Display System
ar: إدارة نظام عرض المطبخ
de: Küchenanzeigesystem verwalten
es: Gestionar Sistema de Visualización de Cocina
fr: Gérer le Système d'Affichage de Cuisine
it: Gestisci Sistema di Visualizzazione Cucina
ru: Управление системой кухонного дисплея
tr: Mutfak Ekranı Yönetimi
zh: 管理厨房显示系统

# permissionManageKdsScreens
source: Manage KDS Screen Definitions
ar: إدارة تعريفات شاشة KDS
de: KDS-Bildschirmdefinitionen verwalten
es: Gestionar Definiciones de Pantalla KDS
fr: Gérer les Définitions d'Écran KDS
it: Gestisci Definizioni Schermo KDS
ru: Управление определениями экранов KDS
tr: KDS Ekran Tanımları Yönetimi
zh: 管理 KDS 屏幕定义

# permissionManagePagers
source: Manage Pagers
ar: إدارة أجهزة النداء
de: Pager verwalten
es: Gestionar Localizadores
fr: Gérer les Bipers
it: Gestisci Pager
ru: Управление пейджерами
tr: Çağrı Cihazı Yönetimi
zh: 管理传呼机

# permissionManageCampaigns
source: Manage Campaigns
ar: إدارة الحملات
de: Kampagnen verwalten
es: Gestionar Campañas
fr: Gérer les Campagnes
it: Gestisci Campagne
ru: Управление кампаниями
tr: Kampanya Yönetimi
zh: 管理促销活动

# buttonSave
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ru: Сохранить
tr: Kaydet
zh: 保存

source: Logout
ar: تسجيل الخروج
de: Abmelden
es: Cerrar Sesión
fr: Déconnexion
it: Esci
ru: Выйти
tr: Çıkış Yap
zh: 退出登录

# errorLoadingInitialData
source: Error loading initial data: {details}
ar: خطأ في تحميل البيانات الأولية: {details}
de: Fehler beim Laden der Anfangsdaten: {details}
es: Error al cargar datos iniciales: {details}
fr: Erreur lors du chargement des données initiales : {details}
it: Errore caricamento dati iniziali: {details}
ru: Ошибка загрузки исходных данных: {details}
tr: Başlangıç verileri yüklenirken hata oluştu: {details}
zh: 加载初始数据错误: {details}

# errorFirebaseUploadFailed
source: Firebase file upload failed.
ar: فشل تحميل ملف Firebase.
de: Firebase-Dateiupload fehlgeschlagen.
es: Error al subir archivo a Firebase.
fr: Échec du téléchargement de fichier Firebase.
it: Caricamento file Firebase fallito.
ru: Не удалось загрузить файл в Firebase.
tr: Firebase dosya yüklemesi başarısız oldu.
zh: Firebase 文件上传失败。

# categoryNameLabelRequired
source: Category Name*
ar: اسم الفئة*
de: Kategoriename*
es: Nombre de la Categoría*
fr: Nom de la Catégorie*
it: Nome Categoria*
ru: Название категории*
tr: Kategori Adı*
zh: 类别名称*
