Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# orderCardTitleTakeaway
source: Takeaway - Order #{orderId}
ar: سفري - طلب #{orderId}
de: Außer Haus - Bestellung #{orderId}
es: Para Llevar - Pedido #{orderId}
fr: À Emporter - Commande #{orderId}
it: Asporto - Ordine #{orderId}
ru: На вынос - Заказ #{orderId}
tr: Paket - Sipariş #{orderId}
zh: 外卖 - 订单 #{orderId}

# orderCardDetailsButton
source: Details
ar: التفاصيل
es: Detalles
fr: Détails
it: Dettagli
ru: Детали
tr: Detay
zh: 详情

# manageStaffTitle
source: Staff Management
ar: إدارة الموظفين
de: Personalverwaltung
es: Gestión de Personal
fr: Gestion du Personnel
it: Gestione Staff
ru: Управление персоналом
tr: Personel Yönetimi
zh: 员工管理

# manageStaffErrorFetching
source: An error occurred while fetching the staff list: {error}
ar: حدث خطأ أثناء جلب قائمة الموظفين: {error}
de: Ein Fehler ist beim Abrufen der Personalliste aufgetreten: {error}
es: Ocurrió un error al obtener la lista de personal: {error}
fr: Une erreur s'est produite lors de la récupération de la liste du personnel : {error}
it: Si è verificato un errore durante il recupero dell'elenco dello staff: {error}
ru: Произошла ошибка при получении списка персонала: {error}
tr: Personel listesi alınırken hata oluştu: {error}
zh: 获取员工列表时发生错误: {error}

# manageStaffTooltipAdd
source: Add New Staff Member
ar: إضافة موظف جديد
de: Neues Personalmitglied hinzufügen
es: Añadir Nuevo Miembro del Personal
fr: Ajouter un Nouveau Membre du Personnel
it: Aggiungi Nuovo Membro Staff
ru: Добавить нового сотрудника
tr: Yeni Personel Ekle
zh: 添加新员工

# manageStaffNoStaff
source: No staff members have been added yet.
ar: لم تتم إضافة أي موظفين بعد.
de: Es wurden noch keine Personalmitglieder hinzugefügt.
es: Aún no se han añadido miembros del personal.
fr: Aucun membre du personnel n'a été ajouté pour le moment.
it: Nessun membro staff è stato ancora aggiunto.
ru: Сотрудники еще не добавлены.
tr: Henüz personel eklenmemiş.
zh: 尚未添加任何员工。

# manageStaffUnknownStaff
source: Unknown Staff
ar: موظف غير معروف
de: Unbekanntes Personal
es: Personal Desconocido
fr: Personnel Inconnu
it: Staff Sconosciuto
ru: Неизвестный сотрудник
tr: Bilinmeyen Personel
zh: 未知员工

# manageStaffNoEmail
source: No email
ar: لا يوجد بريد إلكتروني
de: Keine E-Mail
es: Sin correo electrónico
fr: Pas d'e-mail
it: Nessuna email
ru: Нет электронной почты
tr: E-posta yok
zh: 无电子邮件

# manageStaffDialogDeleteTitle
source: Delete Staff Member
ar: حذف الموظف
de: Personalmitglied löschen
es: Eliminar Miembro del Personal
fr: Supprimer un Membre du Personnel
it: Elimina Membro Staff
ru: Удалить сотрудника
tr: Personeli Sil
zh: 删除员工

# manageStaffDialogDeleteContent
source: Are you sure you want to delete this staff member? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الموظف؟ لا يمكن التراجع عن هذا الإجراء.
de: Sind Sie sicher, dass Sie dieses Personalmitglied löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar a este miembro del personal? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer ce membre du personnel ? Cette action est irréversible.
it: Sei sicuro di voler eliminare questo membro dello staff? Questa azione non può essere annullata.
ru: Вы уверены, что хотите удалить этого сотрудника? Это действие необратимо.
tr: Bu personeli silmek istediğinize emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除此员工吗？此操作无法撤销。

# manageStaffSuccessDelete
source: Staff member deleted successfully.
ar: تم حذف الموظف بنجاح.
de: Personalmitglied erfolgreich gelöscht.
es: Miembro del personal eliminado con éxito.
fr: Membre du personnel supprimé avec succès.
it: Membro staff eliminato con successo.
ru: Сотрудник успешно удален.
tr: Personel başarıyla silindi.
zh: 员工删除成功。

# manageStaffErrorDelete
source: Error while deleting staff member: {error}
ar: خطأ أثناء حذف الموظف: {error}
de: Fehler beim Löschen des Personalmitglieds: {error}
es: Error al eliminar miembro del personal: {error}
fr: Erreur lors de la suppression du membre du personnel : {error}
it: Errore durante l'eliminazione del membro staff: {error}
ru: Ошибка при удалении сотрудника: {error}
tr: Personel silinirken hata: {error}
zh: 删除员工时出错: {error}

# orderDetailTitle
source: Order #{orderId} Details
ar: تفاصيل الطلب رقم #{orderId}
de: Bestellung #{orderId} Details
es: Detalles del Pedido #{orderId}
fr: Détails de la Commande #{orderId}
it: Dettagli Ordine #{orderId}
ru: Детали заказа #{orderId}
tr: Sipariş #{orderId} Detayları
zh: 订单 #{orderId} 详情

# durationNotCalculated
source: Not calculated
ar: لم يتم الحساب
de: Nicht berechnet
es: No calculado
fr: Non calculé
it: Non calcolato
ru: Не рассчитано
tr: Hesaplanamadı
zh: 未计算

# durationZeroSeconds
source: 0 sec
ar: 0 ثانية
de: 0 Sek
es: 0 seg
ru: 0 сек
tr: 0 sn
zh: 0 秒

# timelineUnitHour
source: hr
ar: ساعة
de: Std
es: h
fr: h
it: ore
ru: ч
tr: sa
zh: 小时

# timelineUnitMinute
source: min
ar: دقيقة
ru: мин
tr: dk
zh: 分钟

# timelineUnitSecond
source: sec
ar: ثانية
de: Sek
es: seg
ru: сек
tr: sn
zh: 秒

# orderDetailCardGeneralInfo
source: General Information
ar: معلومات عامة
de: Allgemeine Informationen
es: Información General
fr: Informations Générales
it: Informazioni Generali
ru: Общая информация
tr: Genel Bilgiler
zh: 一般信息

# orderDetailLabelId
source: Order ID:
ar: معرف الطلب:
de: Bestell-ID:
es: ID del Pedido:
fr: ID de la Commande :
it: ID Ordine:
ru: ID заказа:
tr: Sipariş ID:
zh: 订单 ID:

# orderDetailLabelCustomer
source: Customer:
ar: العميل:
de: Kunde:
es: Cliente:
fr: Client :
it: Cliente:
ru: Клиент:
tr: Müşteri:
zh: 顾客:

# orderDetailLabelType
source: Order Type:
ar: نوع الطلب:
de: Bestellart:
es: Tipo de Pedido:
fr: Type de Commande :
it: Tipo Ordine:
ru: Тип заказа:
tr: Sipariş Tipi:
zh: 订单类型:

# orderDetailTypeTable
source: Table
ar: طاولة
de: Tisch
es: Mesa
it: Tavolo
ru: Стол
tr: Masa
zh: 桌位

# orderDetailTypeTakeaway
source: Takeaway
ar: سفري
de: Außer Haus
es: Para Llevar
fr: À Emporter
it: Asporto
ru: На вынос
tr: Paket Servis
zh: 外卖

# orderDetailLabelTableNumber
source: Table No:
ar: رقم الطاولة:
de: Tisch-Nr:
es: Nº de Mesa:
fr: N° de Table :
it: N. Tavolo:
ru: № стола:
tr: Masa No:
zh: 桌位号:

# orderDetailLabelDate
source: Date:
ar: التاريخ:
de: Datum:
es: Fecha:
it: Data:
ru: Дата:
tr: Tarih:
zh: 日期:

# orderDetailCardTimeline
source: Order Timeline
ar: الجدول الزمني للطلب
de: Bestell-Zeitachse
es: Línea de Tiempo del Pedido
fr: Chronologie de la Commande
it: Cronologia Ordine
ru: Хронология заказа
tr: Sipariş Zaman Akışı
zh: 订单时间轴

# timelineApprovalDuration
source: Approval Time
ar: وقت الموافقة
de: Genehmigungszeit
es: Tiempo de Aprobación
fr: Temps d'Approbation
it: Tempo di Approvazione
ru: Время одобрения
tr: Onay Süresi
zh: 批准时间

# timelineKitchenDuration
source: Kitchen Preparation Time
ar: وقت إعداد المطبخ
de: Zubereitungszeit Küche
es: Tiempo de Preparación de Cocina
fr: Temps de Préparation en Cuisine
it: Tempo di Preparazione Cucina
ru: Время приготовления на кухне
tr: Mutfak Hazırlama Süresi
zh: 厨房准备时间

# timelineWaiterPickupDuration
source: Waiter Pickup Time
ar: وقت استلام النادل
de: Abholzeit Kellner
es: Tiempo de Recogida del Camarero
fr: Temps de Ramassage par le Serveur
it: Tempo di Ritiro del Cameriere
ru: Время получения официантом
tr: Garson Teslim Alma Süresi
zh: 服务员取餐时间

# timelineCustomerDeliveryDuration
source: Customer Delivery Time
ar: وقت تسليم العميل
de: Lieferzeit an Kunden
es: Tiempo de Entrega al Cliente
fr: Temps de Livraison au Client
it: Tempo di Consegna al Cliente
ru: Время доставки клиенту
tr: Müşteri Teslim Süresi
zh: 顾客送达时间

# timelineTotalDuration
source: Total Duration
ar: المدة الإجمالية
de: Gesamtdauer
es: Duración Total
fr: Durée Totale
it: Durata Totale
ru: Общая продолжительность
tr: Toplam Geçen Süre
zh: 总时长

# takeawayOrderApproved
source: Order approved.
ar: تمت الموافقة على الطلب.
de: Bestellung genehmigt.
es: Pedido aprobado.
fr: Commande approuvée.
it: Ordine approvato.
ru: Заказ одобрен.
tr: Sipariş onaylandı.
zh: 订单已批准。

# takeawayErrorApproving
source: Approval error: {error}
ar: خطأ في الموافقة: {error}
de: Fehler bei der Genehmigung: {error}
es: Error de aprobación: {error}
fr: Erreur d'approbation : {error}
it: Errore di approvazione: {error}
ru: Ошибка одобрения: {error}
tr: Onaylama hatası: {error}
zh: 批准错误: {error}

# takeawayDialogRejectTitle
source: Reject Order
ar: رفض الطلب
de: Bestellung ablehnen
es: Rechazar Pedido
fr: Rejeter la Commande
it: Rifiuta Ordine
ru: Отклонить заказ
tr: Siparişi Reddet
zh: 拒绝订单

# takeawayDialogRejectContent
source: Are you sure you want to reject the products added by the customer?
ar: هل أنت متأكد أنك تريد رفض المنتجات التي أضافها العميل؟
de: Sind Sie sicher, dass Sie die vom Kunden hinzugefügten Produkte ablehnen möchten?
es: ¿Estás seguro de que quieres rechazar los productos añadidos por el cliente?
fr: Êtes-vous sûr de vouloir rejeter les produits ajoutés par le client ?
it: Sei sicuro di voler rifiutare i prodotti aggiunti dal cliente?
ru: Вы уверены, что хотите отклонить продукты, добавленные клиентом?
tr: Müşterinin eklediği ürünleri reddetmek istediğinize emin misiniz?
zh: 您确定要拒绝顾客添加的产品吗？

# takeawayDialogButtonReject
source: Yes, Reject
ar: نعم، رفض
de: Ja, ablehnen
es: Sí, Rechazar
fr: Oui, Rejeter
it: Sì, Rifiuta
ru: Да, отклонить
tr: Evet, Reddet
zh: 是，拒绝

# takeawayOrderRejected
source: Order rejected.
ar: تم رفض الطلب.
de: Bestellung abgelehnt.
es: Pedido rechazado.
fr: Commande rejetée.
it: Ordine rifiutato.
ru: Заказ отклонен.
tr: Sipariş reddedildi.
zh: 订单已拒绝。

# takeawayErrorRejecting
source: Rejection error: {error}
ar: خطأ في الرفض: {error}
de: Fehler beim Ablehnen: {error}
es: Error de rechazo: {error}
fr: Erreur de rejet : {error}
it: Errore di rifiuto: {error}
ru: Ошибка отклонения: {error}
tr: Reddetme hatası: {error}
zh: 拒绝错误: {error}

# takeawayDialogCancelContent
source: Are you sure you want to cancel this order?
ar: هل أنت متأكد أنك تريد إلغاء هذا الطلب؟
de: Sind Sie sicher, dass Sie diese Bestellung stornieren möchten?
es: ¿Estás seguro de que quieres cancelar este pedido?
fr: Êtes-vous sûr de vouloir annuler cette commande ?
it: Sei sicuro di voler annullare questo ordine?
ru: Вы уверены, что хотите отменить этот заказ?
tr: Bu siparişi iptal etmek istediğinize emin misiniz?
zh: 您确定要取消此订单吗？

# takeawayErrorCancellingWithCode
source: Error while canceling order: {statusCode}
ar: خطأ أثناء إلغاء الطلب: {statusCode}
de: Fehler beim Stornieren der Bestellung: {statusCode}
es: Error al cancelar pedido: {statusCode}
fr: Erreur lors de l'annulation de la commande : {statusCode}
it: Errore durante l'annullamento dell'ordine: {statusCode}
ru: Ошибка при отмене заказа: {statusCode}
tr: Sipariş iptal edilirken hata: {statusCode}
zh: 取消订单时出错: {statusCode}

# businessSettingsSectionLocalization
source: Regional Settings
ar: الإعدادات الإقليمية
de: Regionale Einstellungen
es: Ajustes Regionales
fr: Paramètres Régionaux
it: Impostazioni Regionali
ru: Региональные настройки
tr: Bölgesel Ayarlar
zh: 区域设置

# setupWizardSettingsSaved
source: Settings saved
ar: تم حفظ الإعدادات
de: Einstellungen gespeichert
es: Ajustes guardados
fr: Paramètres enregistrés
it: Impostazioni salvate
ru: Настройки сохранены
tr: Ayarlar kaydedildi
zh: 设置已保存

# manageShiftsNoShiftsFound
source: No shifts have been created yet.
ar: لم يتم إنشاء أي مناوبات بعد.
de: Es wurden noch keine Schichten erstellt.
es: Aún no se han creado turnos.
fr: Aucun quart n'a été créé pour le moment.
it: Nessun turno è stato ancora creato.
ru: Смены еще не созданы.
tr: Henüz vardiya oluşturulmamış.
zh: 尚未创建任何班次。

# defaultCampaignCategoryName
source: Campaigns
ar: الحملات
de: Kampagnen
es: Campañas
fr: Campagnes
it: Campagne
ru: Кампании
tr: Kampanyalar
zh: 促销活动

# campaignKdsAssignmentTitle
source: Kitchen Display Required
ar: شاشة عرض المطبخ مطلوبة
de: Küchenanzeige erforderlich
es: Pantalla de Cocina Requerida
fr: Écran d'Affichage de Cuisine Requis
it: Schermo Cucina Richiesto
ru: Требуется кухонный дисплей
tr: Mutfak Ekranı Gerekli
zh: 需要厨房显示器

# campaignKdsAssignmentPrompt
source: The category '{campaignCategoryName}' has not been assigned a kitchen display yet. Would you like to make an assignment now for this campaign to appear in the kitchen?
ar: لم يتم تعيين شاشة عرض مطبخ لفئة '{campaignCategoryName}' بعد. هل ترغب في إجراء تعيين الآن لكي تظهر هذه الحملة في المطبخ؟
de: Der Kategorie '{campaignCategoryName}' wurde noch keine Küchenanzeige zugewiesen. Möchten Sie jetzt eine Zuweisung vornehmen, damit diese Kampagne in der Küche erscheint?
es: A la categoría '{campaignCategoryName}' aún no se le ha asignado una pantalla de cocina. ¿Te gustaría hacer una asignación ahora para que esta campaña aparezca en la cocina?
fr: La catégorie '{campaignCategoryName}' n'a pas encore été assignée à un écran de cuisine. Souhaitez-vous effectuer une assignation maintenant pour que cette campagne apparaisse en cuisine ?
it: Alla categoria '{campaignCategoryName}' non è stato ancora assegnato uno schermo cucina. Vuoi effettuare subito un'assegnazione affinché questa campagna appaia in cucina?
ru: Категории '{campaignCategoryName}' еще не назначен кухонный дисплей. Хотите ли вы сделать назначение сейчас, чтобы эта кампания появилась на кухне?
tr: '{campaignCategoryName}' kategorisine henüz bir mutfak ekranı atanmamış. Bu kampanyanın mutfakta görünmesi için şimdi bir atama yapmak ister misiniz?
zh: 类别“{campaignCategoryName}”尚未分配厨房显示器。您想现在进行分配以使此促销活动出现在厨房中吗？

# dialogButtonAssignNow
source: Assign Now
ar: تعيين الآن
de: Jetzt zuweisen
es: Asignar Ahora
fr: Assigner Maintenant
it: Assegna Ora
ru: Назначить сейчас
tr: Şimdi Ata
zh: 立即分配

# dialogDeleteCategoryContent
source: Are you sure you want to delete this category and all products under it? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه الفئة وجميع المنتجات الموجودة تحتها؟ لا يمكن التراجع عن هذا الإجراء.
de: Sind Sie sicher, dass Sie diese Kategorie und alle Produkte darunter löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar esta categoría y todos los productos bajo ella? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cette catégorie et tous les produits qu'elle contient ? Cette action est irréversible.
it: Sei sicuro di voler eliminare questa categoria e tutti i prodotti al suo interno? Questa azione non può essere annullata.
ru: Вы уверены, что хотите удалить эту категорию и все продукты в ней? Это действие необратимо.
tr: '{categoryName}' kategorisini ve bağlantılı tüm ürünleri silmek geri döndürülemez bir işlemdir. Devam etmek istediğinizden emin misiniz?
zh: 您确定要删除此类别及其下的所有产品吗？此操作无法撤销。

# subscriptionErrorWeb
source: In-app subscriptions are currently only available through mobile applications.
ar: الاشتراكات داخل التطبيق متاحة حاليًا فقط من خلال تطبيقات الهاتف المحمول.
de: In-App-Abonnements sind derzeit nur über mobile Anwendungen verfügbar.
es: Las suscripciones dentro de la aplicación solo están disponibles actualmente a través de aplicaciones móviles.
fr: Les abonnements intégrés à l'application sont actuellement disponibles uniquement via les applications mobiles.
it: Gli abbonamenti in-app sono attualmente disponibili solo tramite applicazioni mobili.
ru: Подписки в приложении в настоящее время доступны только через мобильные приложения.
tr: Uygulama içi abonelikler şu anda sadece mobil uygulamalar üzerinden yapılabilmektedir.
zh: 应用内订阅目前仅通过移动应用程序提供。

# subscriptionPurchasing
source: Processing purchase...
ar: جاري معالجة عملية الشراء...
de: Kauf wird verarbeitet...
es: Procesando compra...
fr: Traitement de l'achat...
it: Elaborazione acquisto...
ru: Обработка покупки...
tr: Satın alma işleniyor...
zh: 正在处理购买...

# planBasic
source: Basic Plan
ar: الباقة الأساسية
de: Basis-Plan
es: Plan Básico
fr: Forfait Basique
it: Piano Basic
ru: Базовый план
tr: Temel Paket
zh: 基础套餐

# planSilver
source: Silver Plan
ar: الباقة الفضية
de: Silber-Plan
es: Plan Plata
fr: Forfait Argent
it: Piano Silver
ru: Серебряный план
tr: Silver Paket
zh: 白银套餐

# planGold
source: Gold Plan
ar: الباقة الذهبية
es: Plan Oro
fr: Forfait Or
it: Piano Gold
ru: Золотой план
tr: Gold Paket
zh: 黄金套餐

# maxTables
source: Max. Number of Tables
ar: الحد الأقصى لعدد الطاولات
de: Max. Anzahl an Tischen
es: Máx. Número de Mesas
fr: Nombre Max. de Tables
it: Max. Numero di Tavoli
ru: Макс. количество столов
tr: Maks. Masa Sayısı
zh: 最大桌位数

# maxStaff
source: Max. Number of Staff
ar: الحد الأقصى لعدد الموظفين
de: Max. Anzahl an Personal
es: Máx. Número de Personal
fr: Nombre Max. de Personnel
it: Max. Numero di Staff
ru: Макс. количество персонала
tr: Maks. Personel Sayısı
zh: 最大员工数

source: Max. KDS Screens
ar: الحد الأقصى لشاشات KDS
de: Max. KDS-Bildschirme
es: Máx. Pantallas KDS
fr: Écrans KDS Max.
it: Max. Schermi KDS
ru: Макс. количество экранов KDS
tr: Maks. KDS Ekranı
zh: 最大 KDS 屏幕数

source: Max. Categories
ar: الحد الأقصى للفئات
de: Max. Kategorien
es: Máx. Categorías
fr: Catégories Max.
it: Max. Categorie
ru: Макс. количество категорий
tr: Maks. Kategori
zh: 最大类别数

source: Max. Menu Items
ar: الحد الأقصى لعناصر القائمة
de: Max. Menüpunkte
es: Máx. Artículos de Menú
fr: Éléments de Menu Max.
it: Max. Elementi Menù
ru: Макс. количество пунктов меню
tr: Maks. Menü Ürünü
zh: 最大菜单项数

# maxVariants
source: Max. Product Variants
ar: الحد الأقصى لمتغيرات المنتج
de: Max. Produktvarianten
es: Máx. Variantes de Producto
fr: Variantes de Produit Max.
it: Max. Varianti Prodotto
ru: Макс. количество вариантов продукта
tr: Maks. Ürün Varyantı
zh: 最大产品变体数

# planMonthly
source: Month
ar: شهر
de: Monat
es: Mes
fr: Mois
it: Mese
ru: Месяц
tr: Ay
zh: 月

# planYearly
source: Year
ar: سنة
de: Jahr
es: Año
fr: Année
it: Anno
ru: Год
tr: Yıl
zh: 年

# subscriptionRestoring
source: Restoring purchases...
ar: جاري استعادة المشتريات...
de: Käufe werden wiederhergestellt...
es: Restaurando compras...
fr: Restauration des achats...
it: Ripristino acquisti...
ru: Восстановление покупок...
tr: Satın alımlar geri yükleniyor...
zh: 正在恢复购买...

# subscriptionRestoreButton
source: Restore
ar: استعادة
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ru: Восстановить
tr: Geri Yükle
zh: 恢复

# shiftEndedDialogTitle
source: Shift End
ar: انتهاء المناوبة
de: Schichtende
es: Fin de Turno
fr: Fin de Quart
it: Fine Turno
ru: Окончание смены
tr: Vardiya Sonu
zh: 班次结束

# shiftEndedDialogContent
source: Your active work shift has ended. Please log out. You can no longer perform new actions.
ar: لقد انتهت مناوبة عملك النشطة. يرجى تسجيل الخروج. لم يعد بإمكانك تنفيذ إجراءات جديدة.
de: Ihre aktive Arbeitsschicht ist beendet. Bitte melden Sie sich ab. Sie können keine neuen Aktionen mehr durchführen.
es: Tu turno de trabajo activo ha terminado. Por favor, cierra la sesión. Ya no puedes realizar nuevas acciones.
fr: Votre quart de travail actif est terminé. Veuillez vous déconnecter. Vous ne pouvez plus effectuer de nouvelles actions.
it: Il tuo turno di lavoro attivo è terminato. Per favore, esegui il logout. Non puoi più eseguire nuove azioni.
ru: Ваша активная рабочая смена завершена. Пожалуйста, выйдите из системы. Вы больше не можете выполнять новые действия.
tr: Aktif çalışma vardiyanız sona ermiştir. Lütfen çıkış yapınız. Artık yeni işlem yapamazsınız.
zh: 您的活跃工作班次已结束。请退出登录。您不能再执行新操作。

# logoutButtonText
source: Log Out
ar: تسجيل الخروج
de: Abmelden
es: Cerrar Sesión
fr: Se Déconnecter
it: Esci
ru: Выйти
tr: Çıkış Yap
zh: 退出登录

# shiftEndedLabel
source: Shift Ended
ar: انتهت المناوبة
de: Schicht beendet
es: Turno Finalizado
fr: Quart Terminé
it: Turno Terminato
ru: Смена окончена
tr: Vardiya Bitti
zh: 班次已结束

# shiftCountdownLabel
source: {minutes} min {seconds} sec left
ar: متبقي {minutes} دقيقة و {seconds} ثانية
de: Noch {minutes} Min {seconds} Sek
es: {minutes} min {seconds} seg restantes
fr: {minutes} min {seconds} sec restants
it: Mancano {minutes} min {seconds} sec
ru: Осталось {minutes} мин {seconds} сек
tr: {minutes} dk {seconds} sn kaldı
zh: 剩余 {minutes} 分 {seconds} 秒

# shiftLabel
source: Shift
ar: مناوبة
de: Schicht
es: Turno
fr: Quart
it: Turno
ru: Смена
tr: Mesai
zh: 班次

# setupCategoriesAddFromTemplateButton
source: Add from Template
ar: إضافة من القالب
de: Aus Vorlage hinzufügen
es: Añadir desde Plantilla
fr: Ajouter à partir du Modèle
it: Aggiungi da Modello
ru: Добавить из шаблона
tr: Şablondan Ekle
zh: 从模板添加

# setupCategoriesTemplateDialogTitle
source: Category Templates
ar: قوالب الفئات
de: Kategorievorlagen
es: Plantillas de Categoría
fr: Modèles de Catégorie
it: Modelli Categoria
ru: Шаблоны категорий
tr: Kategori Şablonları
zh: 类别模板

# setupCategoriesTemplateAddButton
source: {count} templates selected - Create
ar: تم تحديد {count} قوالب - إنشاء
de: {count} Vorlagen ausgewählt - Erstellen
es: {count} plantillas seleccionadas - Crear
fr: {count} modèles sélectionnés - Créer
it: {count} modelli selezionati - Crea
ru: Выбрано {count} шаблонов - Создать
tr: {count} şablon seçildi - Oluştur
zh: 已选择 {count} 个模板 - 创建

# setupCategoriesSelectFromTemplate
source: Select Category from Template
ar: حدد الفئة من القالب
de: Kategorie aus Vorlage auswählen
es: Seleccionar Categoría de la Plantilla
fr: Sélectionner une Catégorie à partir du Modèle
it: Seleziona Categoria da Modello
ru: Выбрать категорию из шаблона
tr: Şablondan Kategori Seç
zh: 从模板选择类别

# setupCategoriesNoTemplatesFound
source: No templates found
ar: لم يتم العثور على قوالب
de: Keine Vorlagen gefunden
es: No se encontraron plantillas
fr: Aucun modèle trouvé
it: Nessun modello trovato
ru: Шаблоны не найдены
tr: Şablon bulunamadı
zh: 未找到模板

# kdsScreenLabelRequired
source: KDS Screen (Required)
ar: شاشة KDS (مطلوب)
de: KDS-Bildschirm (Erforderlich)
es: Pantalla KDS (Obligatorio)
fr: Écran KDS (Requis)
it: Schermo KDS (Obbligatorio)
ru: Экран KDS (Обязательно)
tr: KDS Ekranı (Gerekli)
zh: KDS 屏幕 (必填)

# passwordResetConfirmSuccessMessage
source: Your password has been reset successfully. Please log in with your new password.
ar: تم إعادة تعيين كلمة المرور الخاصة بك بنجاح. يرجى تسجيل الدخول باستخدام كلمة المرور الجديدة.
de: Ihr Passwort wurde erfolgreich zurückgesetzt. Bitte melden Sie sich mit Ihrem neuen Passwort an.
es: Tu contraseña ha sido restablecida con éxito. Por favor, inicia sesión con tu nueva contraseña.
fr: Votre mot de passe a été réinitialisé avec succès. Veuillez vous connecter avec votre nouveau mot de passe.
it: La tua password è stata resettata con successo. Per favore, accedi con la tua nuova password.
ru: Ваш пароль успешно сброшен. Пожалуйста, войдите с вашим новым паролем.
tr: Şifreniz başarıyla sıfırlandı. Lütfen yeni şifrenizle giriş yapın.
zh: 您的密码已成功重置。请使用新密码登录。

# passwordResetConfirmInstruction
source: Enter the 6-digit code sent to your email and your new password.
ar: أدخل الرمز المكون من 6 أرقام الذي تم إرساله إلى بريدك الإلكتروني وكلمة المرور الجديدة.
de: Geben Sie den 6-stelligen Code, der an Ihre E-Mail gesendet wurde, und Ihr neues Passwort ein.
es: Introduce el código de 6 dígitos enviado a tu correo electrónico y tu nueva contraseña.
fr: Saisissez le code à 6 chiffres envoyé à votre e-mail et votre nouveau mot de passe.
it: Inserisci il codice di 6 cifre inviato alla tua email e la tua nuova password.
ru: Введите 6-значный код, отправленный на вашу электронную почту, и ваш новый пароль.
tr: E-postanıza gönderilen 6 haneli kodu ve yeni şifrenizi girin.
zh: 输入发送到您邮箱的6位代码和您的新密码。

# passwordResetConfirmCodeLabel
source: Reset Code
ar: رمز إعادة التعيين
de: Rücksetzungscode
es: Código de Restablecimiento
fr: Code de réinitialisation
it: Codice di Reset
ru: Код сброса
tr: Sıfırlama Kodu
zh: 重置代码
