Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# categoryNameValidator
source: Please enter a category name.
ar: الرجاء إدخال اسم الفئة.
de: Bitte geben Sie einen Kategorienamen ein.
es: Por favor, introduce un nombre de categoría.
fr: Veuillez saisir un nom de catégorie.
it: Per favore, inserisci un nome per la categoria.
ru: Пожалуйста, введите название категории.
tr: Lütfen kategori adını girin.
zh: 请输入类别名称。

# parentCategoryLabel
source: Parent Category
ar: الفئة الرئيسية
de: Übergeordnete Kategorie
es: Categoría Padre
fr: Catégorie Parente
it: Categoria Genitore
ru: Родительская категория
tr: Üst Kategori
zh: 父类别

# dialogDeleteVariantContent
source: Are you sure you want to delete the variant '{variantName}'?
ar: هل أنت متأكد أنك تريد حذف المتغير '{variantName}'؟
de: Sind Sie sicher, dass Sie die Variante '{variantName}' löschen möchten?
es: ¿Estás seguro de que quieres eliminar la variante '{variantName}'?
fr: Êtes-vous sûr de vouloir supprimer la variante '{variantName}' ?
it: Sei sicuro di voler eliminare la variante '{variantName}'?
ru: Вы уверены, что хотите удалить вариант «{variantName}»?
tr: '{variantName}' adlı varyantı silmek istediğinizden emin misiniz?
zh: 您确定要删除变体“{variantName}”吗？

# editOrderErrorFetchingBusinessName
source: Error fetching business name: {error}
ar: خطأ في جلب اسم العمل: {error}
de: Fehler beim Abrufen des Geschäftsnamens: {error}
es: Error al obtener el nombre del negocio: {error}
fr: Erreur lors de la récupération du nom de l'entreprise : {error}
it: Errore recupero nome attività: {error}
ru: Ошибка получения названия бизнеса: {error}
tr: İşletme adı alınırken hata: {error}
zh: 获取商家名称错误: {error}

# editOrderErrorLoadingCategories
source: An error occurred while loading categories.
ar: حدث خطأ أثناء تحميل الفئات.
de: Beim Laden der Kategorien ist ein Fehler aufgetreten.
es: Ocurrió un error al cargar categorías.
fr: Une erreur s'est produite lors du chargement des catégories.
it: Si è verificato un errore durante il caricamento delle categorie.
ru: Произошла ошибка при загрузке категорий.
tr: Kategoriler yüklenirken bir hata oluştu.
zh: 加载类别时发生错误。

# editOrderErrorAddingProductWithStatus
source: An error occurred while adding product (Code: {statusCode}): {details}
ar: حدث خطأ أثناء إضافة المنتج (الرمز: {statusCode}): {details}
de: Beim Hinzufügen des Produkts ist ein Fehler aufgetreten (Code: {statusCode}): {details}
es: Ocurrió un error al añadir producto (Código: {statusCode}): {details}
fr: Une erreur s'est produite lors de l'ajout du produit (Code : {statusCode}) : {details}
it: Si è verificato un errore durante l'aggiunta del prodotto (Codice: {statusCode}): {details}
ru: Произошла ошибка при добавлении продукта (Код: {statusCode}): {details}
tr: Ürün eklenirken hata oluştu (Kod: {statusCode}): {details}
zh: 添加产品时发生错误 (代码: {statusCode}): {details}

# editOrderErrorUpdatingPagerStatus
source: Error updating pager status: {error}
ar: خطأ في تحديث حالة جهاز النداء: {error}
de: Fehler beim Aktualisieren des Pager-Status: {error}
es: Error al actualizar el estado del localizador: {error}
fr: Erreur lors de la mise à jour du statut du biper : {error}
it: Errore aggiornamento stato pager: {error}
ru: Ошибка обновления статуса пейджера: {error}
tr: Çağrı cihazı durumu güncellenirken hata: {error}
zh: 更新传呼机状态错误: {error}

# editOrderErrorUpdatingPagerOnCancel
source: Error updating pager on order cancellation: {error}
ar: خطأ في تحديث جهاز النداء عند إلغاء الطلب: {error}
de: Fehler beim Aktualisieren des Pagers bei Bestellstornierung: {error}
es: Error al actualizar el localizador en la cancelación del pedido: {error}
fr: Erreur lors de la mise à jour du biper à l'annulation de la commande : {error}
it: Errore aggiornamento pager all'annullamento dell'ordine: {error}
ru: Ошибка обновления пейджера при отмене заказа: {error}
tr: Sipariş iptalinde çağrı cihazı güncellenirken hata: {error}
zh: 取消订单时更新传呼机错误: {error}

# editOrderPrintCustomerReceipt
source: Print Customer Receipt
ar: طباعة إيصال العميل
de: Kundenbeleg drucken
es: Imprimir Recibo del Cliente
fr: Imprimer le Reçu Client
it: Stampa Ricevuta Cliente
ru: Распечатать чек клиента
tr: Müşteri Fişi Yazdır
zh: 打印顾客收据

# editOrderPrintKitchenTicket
source: Print Kitchen Ticket
ar: طباعة تذكرة المطبخ
de: Küchenticket drucken
es: Imprimir Ticket de Cocina
fr: Imprimer le Ticket de Cuisine
it: Stampa Ticket Cucina
ru: Распечатать кухонный чек
tr: Mutfak Fişi Yazdır
zh: 打印厨房小票

# editOrderTotal
source: Grand Total: {totalAmount}
ar: الإجمالي الكلي: {totalAmount}
de: Gesamtbetrag: {totalAmount}
es: Total General: {totalAmount}
fr: Total Général : {totalAmount}
it: Totale Complessivo: {totalAmount}
ru: Общая сумма: {totalAmount}
tr: Genel Toplam: {totalAmount}
zh: 总计: {totalAmount}

source: Your Business
ar: عملك
de: Ihr Unternehmen
es: Tu Negocio
fr: Votre Entreprise
it: La Tua Attività
ru: Ваш бизнес
tr: İşletmeniz
zh: 您的商家

# orderTypeTable
source: Table
ar: طاولة
de: Tisch
es: Mesa
it: Tavolo
ru: Стол
tr: Masa
zh: 桌位

# orderTypeTakeaway
source: Takeaway
ar: سفري
de: Außer Haus
es: Para Llevar
fr: À Emporter
it: Asporto
ru: На вынос
tr: Paket
zh: 外卖

# waitingCustomersTitle
source: Waiting Customers
ar: العملاء المنتظرون
de: Wartende Kunden
es: Clientes en Espera
fr: Clients en Attente
it: Clienti in Attesa
ru: Ожидающие клиенты
tr: Bekleyen Müşteriler
zh: 等待中的顾客

# addNewCustomerButtonLabel
source: Add New Customer
ar: إضافة عميل جديد
de: Neuen Kunden hinzufügen
es: Añadir Nuevo Cliente
fr: Ajouter un Nouveau Client
it: Aggiungi Nuovo Cliente
ru: Добавить нового клиента
tr: Yeni Müşteri Ekle
zh: 添加新顾客

# pagerDialogDeleteContent
source: Are you sure you want to delete the pager '{pagerName}'?
ar: هل أنت متأكد أنك تريد حذف جهاز النداء '{pagerName}'؟
de: Sind Sie sicher, dass Sie den Pager '{pagerName}' löschen möchten?
es: ¿Estás seguro de que quieres eliminar el localizador '{pagerName}'?
fr: Êtes-vous sûr de vouloir supprimer le biper '{pagerName}' ?
it: Sei sicuro di voler eliminare il pager '{pagerName}'?
ru: Вы уверены, что хотите удалить пейджер «{pagerName}»?
tr: '{pagerName}' adlı çağrı cihazını silmek istediğinizden emin misiniz?
zh: 您确定要删除传呼机“{pagerName}”吗？

# manageCampaignsCardSubtitle
source: Price: {price} {currency} | Active: {isActive}
ar: السعر: {price} {currency} | نشط: {isActive}
de: Preis: {price} {currency} | Aktiv: {isActive}
es: Precio: {price} {currency} | Activo: {isActive}
fr: Prix : {price} {currency} | Actif : {isActive}
it: Prezzo: {price} {currency} | Attiva: {isActive}
ru: Цена: {price} {currency} | Активна: {isActive}
tr: Fiyat: {price} {currency} | Aktif: {isActive}
zh: 价格: {price} {currency} | 活跃: {isActive}

# printerSettingsErrorLoadingSavedPrinters
source: Error loading saved printers: {error}
ar: خطأ في تحميل الطابعات المحفوظة: {error}
de: Fehler beim Laden gespeicherter Drucker: {error}
es: Error al cargar impresoras guardadas: {error}
fr: Erreur lors du chargement des imprimantes enregistrées : {error}
it: Errore caricamento stampanti salvate: {error}
ru: Ошибка загрузки сохраненных принтеров: {error}
tr: Kayıtlı yazıcılar yüklenirken hata: {error}
zh: 加载已保存的打印机时出错: {error}

# printerSettingsErrorIpExists
source: A printer with this IP address already exists.
ar: طابعة بهذا العنوان IP موجودة بالفعل.
de: Ein Drucker mit dieser IP-Adresse existiert bereits.
es: Ya existe una impresora con esta dirección IP.
fr: Une imprimante avec cette adresse IP existe déjà.
it: Esiste già una stampante con questo indirizzo IP.
ru: Принтер с таким IP-адресом уже существует.
tr: Bu IP adresine sahip bir yazıcı zaten mevcut.
zh: 此 IP 地址的打印机已存在。

# printerSettingsDeleteTitle
source: Delete Printer
ar: حذف الطابعة
de: Drucker löschen
es: Eliminar Impresora
fr: Supprimer l'Imprimante
it: Elimina Stampante
ru: Удалить принтер
tr: Yazıcıyı Sil
zh: 删除打印机

# printerSettingsDeleteConfirmation
source: Are you sure you want to delete the printer '{printerName}'?
ar: هل أنت متأكد أنك تريد حذف الطابعة '{printerName}'؟
de: Sind Sie sicher, dass Sie den Drucker '{printerName}' löschen möchten?
es: ¿Estás seguro de que quieres eliminar la impresora '{printerName}'?
fr: Êtes-vous sûr de vouloir supprimer l'imprimante '{printerName}' ?
it: Sei sicuro di voler eliminare la stampante '{printerName}'?
ru: Вы уверены, что хотите удалить принтер «{printerName}»?
tr: '{printerName}' adlı yazıcıyı silmek istediğinizden emin misiniz?
zh: 您确定要删除打印机“{printerName}”吗？

# printerSettingsSuccessDeleted
source: The printer '{printerName}' has been successfully deleted.
ar: تم حذف الطابعة '{printerName}' بنجاح.
de: Der Drucker '{printerName}' wurde erfolgreich gelöscht.
es: La impresora '{printerName}' ha sido eliminada con éxito.
fr: L'imprimante '{printerName}' a été supprimée avec succès.
it: La stampante '{printerName}' è stata eliminata con successo.
ru: Принтер «{printerName}» успешно удален.
tr: '{printerName}' adlı yazıcı başarıyla silindi.
zh: 打印机“{printerName}”已成功删除。

# printerSettingsErrorDiscoveryNotSupportedOnWeb
source: Printer discovery is not supported on the web platform.
ar: اكتشاف الطابعة غير مدعوم على منصة الويب.
de: Die Druckererkennung wird auf der Webplattform nicht unterstützt.
es: La detección de impresoras no es compatible en la plataforma web.
fr: La découverte d'imprimante n'est pas prise en charge sur la plateforme web.
it: La rilevazione delle stampanti non è supportata sulla piattaforma web.
ru: Обнаружение принтеров не поддерживается на веб-платформе.
tr: Web platformunda yazıcı keşfi desteklenmemektedir.
zh: Web 平台上不支持打印机发现。

# printerSettingsErrorDuringDiscovery
source: Error during printer discovery: {error}
ar: خطأ أثناء اكتشاف الطابعة: {error}
de: Fehler während der Druckererkennung: {error}
es: Error durante la detección de impresoras: {error}
fr: Erreur lors de la découverte d'imprimante : {error}
it: Errore durante la rilevazione della stampante: {error}
ru: Ошибка при обнаружении принтеров: {error}
tr: Yazıcı keşfi sırasında hata: {error}
zh: 打印机发现过程中出错: {error}

# printerSettingsInfoTesting
source: Testing printer '{printerName}'...
ar: جاري اختبار الطابعة '{printerName}'...
de: Drucker '{printerName}' wird getestet...
es: Probando impresora '{printerName}'...
fr: Test de l'imprimante '{printerName}' en cours...
it: Test stampa stampante '{printerName}'...
ru: Тестирование принтера «{printerName}»...
tr: '{printerName}' yazıcısı test ediliyor...
zh: 正在测试打印机“{printerName}”...

# printerSettingsSuccessTestPrint
source: Test print successful!
ar: نجحت طباعة الاختبار!
de: Testdruck erfolgreich!
es: ¡Impresión de prueba exitosa!
fr: Impression test réussie !
it: Stampa di prova riuscita!
ru: Тестовая печать прошла успешно!
tr: Test çıktısı başarılı!
zh: 测试打印成功！

# printerSettingsErrorTestPrintFailed
source: Test print failed.
ar: فشلت طباعة الاختبار.
de: Testdruck fehlgeschlagen.
es: Fallo en la impresión de prueba.
fr: L'impression test a échoué.
it: Stampa di prova fallita.
ru: Тестовая печать не удалась.
tr: Test çıktısı başarısız.
zh: 测试打印失败。

# printerSettingsErrorDuringTest
source: Error during test: {error}
ar: خطأ أثناء الاختبار: {error}
de: Fehler während des Tests: {error}
es: Error durante la prueba: {error}
fr: Erreur pendant le test : {error}
it: Errore durante il test: {error}
ru: Ошибка во время теста: {error}
tr: Test sırasında hata: {error}
zh: 测试过程中出错: {error}

# printerSettingsTitleAddManual
source: Add Manual Printer
ar: إضافة طابعة يدوية
de: Manuellen Drucker hinzufügen
es: Añadir Impresora Manual
fr: Ajouter une Imprimante Manuelle
it: Aggiungi Stampante Manuale
ru: Добавить принтер вручную
tr: Manuel Yazıcı Ekle
zh: 手动添加打印机

# printerSettingsTitleSaveDiscovered
source: Save Discovered Printer
ar: حفظ الطابعة المكتشفة
de: Gefundenen Drucker speichern
es: Guardar Impresora Detectada
fr: Enregistrer l'Imprimante Découverte
it: Salva Stampante Rilevata
ru: Сохранить обнаруженный принтер
tr: Keşfedilen Yazıcıyı Kaydet
zh: 保存发现的打印机

# printerSettingsLabelNameHint
source: Printer Name (e.g., Kitchen Printer)
ar: اسم الطابعة (مثل طابعة المطبخ)
de: Druckername (z. B. Küchendrucker)
es: Nombre de la Impresora (ej. Impresora de Cocina)
fr: Nom de l'Imprimante (ex: Imprimante Cuisine)
it: Nome Stampante (es. Stampante Cucina)
ru: Имя принтера (например, Принтер кухни)
tr: Yazıcı Adı (Örn: Mutfak Yazıcısı)
zh: 打印机名称 (例如: 厨房打印机)

# printerSettingsValidatorNameEmpty
source: Printer name cannot be empty.
ar: لا يمكن أن يكون اسم الطابعة فارغًا.
de: Der Druckername darf nicht leer sein.
es: El nombre de la impresora no puede estar vacío.
fr: Le nom de l'imprimante ne peut pas être vide.
it: Il nome della stampante non può essere vuoto.
ru: Имя принтера не может быть пустым.
tr: Yazıcı adı boş olamaz.
zh: 打印机名称不能为空。

# printerSettingsLabelIpHint
source: IP Address (e.g., 192.168.1.100)
ar: عنوان IP (مثل 192.168.1.100)
de: IP-Adresse (z. B. 192.168.1.100)
es: Dirección IP (ej. 192.168.1.100)
fr: Adresse IP (ex: 192.168.1.100)
it: Indirizzo IP (es. 192.168.1.100)
ru: IP-адрес (например, 192.168.1.100)
tr: IP Adresi (Örn: 192.168.1.100)
zh: IP 地址 (例如: 192.168.1.100)

# printerSettingsValidatorIpEmpty
source: IP address cannot be empty.
ar: لا يمكن أن يكون عنوان IP فارغًا.
de: Die IP-Adresse darf nicht leer sein.
es: La dirección IP no puede estar vacía.
fr: L'adresse IP ne peut pas être vide.
it: L'indirizzo IP non può essere vuoto.
ru: IP-адрес не может быть пустым.
tr: IP adresi boş olamaz.
zh: IP 地址不能为空。

# printerSettingsValidatorIpInvalid
source: Please enter a valid IP address.
ar: الرجاء إدخال عنوان IP صالح.
de: Bitte geben Sie eine gültige IP-Adresse ein.
es: Por favor, introduce una dirección IP válida.
fr: Veuillez saisir une adresse IP valide.
it: Per favore, inserisci un indirizzo IP valido.
ru: Пожалуйста, введите действительный IP-адрес.
tr: Geçerli bir IP adresi girin.
zh: 请输入有效的 IP 地址。

# printerSettingsLabelType
source: Printer Type
ar: نوع الطابعة
de: Druckertyp
es: Tipo de Impresora
fr: Type d'Imprimante
it: Tipo di Stampante
ru: Тип принтера
tr: Yazıcı Tipi
zh: 打印机类型

# printerSettingsTypeKitchen
source: Kitchen
ar: مطبخ
de: Küche
es: Cocina
fr: Cuisine
it: Cucina
ru: Кухня
tr: Mutfak
zh: 厨房

# printerSettingsTypeReceipt
source: Receipt
ar: إيصال
de: Beleg
es: Recibo
fr: Reçu
it: Ricevuta
ru: Чек
tr: Fiş
zh: 收据

# printerSettingsValidatorTypeEmpty
source: Please select a printer type.
ar: الرجاء تحديد نوع الطابعة.
de: Bitte wählen Sie einen Druckertyp aus.
es: Por favor, selecciona un tipo de impresora.
fr: Veuillez sélectionner un type d'imprimante.
it: Per favore, seleziona un tipo di stampante.
ru: Пожалуйста, выберите тип принтера.
tr: Lütfen yazıcı tipi seçin.
zh: 请选择打印机类型。

# printerSettingsTitle
source: Printer Settings
ar: إعدادات الطابعة
de: Druckereinstellungen
es: Ajustes de Impresora
fr: Paramètres de l'Imprimante
it: Impostazioni Stampante
ru: Настройки принтера
tr: Yazıcı Ayarları
zh: 打印机设置

# printerSettingsStateDiscovering
source: Searching for printers...
ar: جاري البحث عن الطابعات...
de: Suche nach Druckern...
es: Buscando impresoras...
fr: Recherche d'imprimantes...
it: Ricerca stampanti in corso...
ru: Поиск принтеров...
tr: Yazıcılar Aranıyor...
zh: 正在搜索打印机...

# printerSettingsButtonDiscover
source: Discover Printers on Network
ar: اكتشاف الطابعات على الشبكة
de: Drucker im Netzwerk erkennen
es: Detectar Impresoras en la Red
fr: Découvrir les Imprimantes sur le Réseau
it: Rileva Stampanti sulla Rete
ru: Обнаружить принтеры в сети
tr: Ağdaki Yazıcıları Keşfet
zh: 发现网络上的打印机

# printerSettingsNoPrintersFound
source: No saved printers found.
ar: لم يتم العثور على طابعات محفوظة.
de: Keine gespeicherten Drucker gefunden.
es: No se encontraron impresoras guardadas.
fr: Aucune imprimante enregistrée trouvée.
it: Nessuna stampante salvata trovata.
ru: Сохраненные принтеры не найдены.
tr: Kayıtlı yazıcı bulunamadı.
zh: 未找到已保存的打印机。

# printerSettingsHeaderDiscovered
source: Discovered Printers
ar: الطابعات المكتشفة
de: Gefundene Drucker
es: Impresoras Detectadas
fr: Imprimantes Découvertes
it: Stampanti Rilevate
ru: Обнаруженные принтеры
tr: Keşfedilen Yazıcılar
zh: 发现的打印机

# printerSettingsTooltipSaveDiscovered
source: Save this printer
ar: حفظ هذه الطابعة
de: Diesen Drucker speichern
es: Guardar esta impresora
fr: Enregistrer cette imprimante
it: Salva questa stampante
ru: Сохранить этот принтер
tr: Bu yazıcıyı kaydet
zh: 保存此打印机

# printerSettingsHeaderSaved
source: Saved Printers
ar: الطابعات المحفوظة
de: Gespeicherte Drucker
es: Impresoras Guardadas
fr: Imprimantes Enregistrées
it: Stampanti Salvate
ru: Сохраненные принтеры
tr: Kayıtlı Yazıcılar
zh: 已保存的打印机

# printerSettingsPrinterTypeLabel
source: Type: {type}
ar: النوع: {type}
de: Typ: {type}
es: Tipo: {type}
it: Tipo: {type}
ru: Тип: {type}
tr: Tip: {type}
zh: 类型: {type}

# printerSettingsTooltipTestPrint
source: Send Test Print
ar: إرسال طباعة اختبارية
de: Testdruck senden
es: Enviar Impresión de Prueba
fr: Envoyer une Impression Test
it: Invia Stampa di Prova
ru: Отправить тестовую печать
tr: Test Çıktısı Gönder
zh: 发送测试打印

# printerSettingsButtonAddManual
source: Add Manual Printer
ar: إضافة طابعة يدوية
de: Manuellen Drucker hinzufügen
es: Añadir Impresora Manual
fr: Ajouter une Imprimante Manuelle
it: Aggiungi Stampante Manuale
ru: Добавить принтер вручную
tr: Manuel Yazıcı Ekle
zh: 手动添加打印机

# printerSettingsTooltipAddManual
source: Add manual printer with IP address
ar: إضافة طابعة يدوية بعنوان IP
de: Manuellen Drucker mit IP-Adresse hinzufügen
es: Añadir impresora manual con dirección IP
fr: Ajouter une imprimante manuelle avec l'adresse IP
it: Aggiungi stampante manuale con indirizzo IP
ru: Добавить принтер вручную с IP-адресом
tr: IP adresi ile manuel yazıcı ekle
zh: 手动添加 IP 地址打印机

# newOrderBasketQuantity
source: Quantity: {quantity}
ar: الكمية: {quantity}
de: Menge: {quantity}
es: Cantidad: {quantity}
fr: Quantité : {quantity}
it: Quantità: {quantity}
ru: Количество: {quantity}
tr: Adet: {quantity}
zh: 数量: {quantity}

# extrasLabel
source: Extras:
ar: الإضافات:
it: Extra:
ru: Дополнительно:
tr: Ekstralar:
zh: 附加项:

# tableOwnerLabel
source: Owner: {name}
ar: المالك: {name}
de: Nutzer: {name}
es: Propietario: {name}
fr: Propriétaire : {name}
it: Proprietario: {name}
ru: Владелец: {name}
tr: Sahip: {name}
zh: 所有者: {name}

# paymentModalErrorWithDetails
source: Payment error (Code: {statusCode}): {details}
ar: خطأ في الدفع (الرمز: {statusCode}): {details}
de: Zahlungsfehler (Code: {statusCode}): {details}
es: Error de pago (Código: {statusCode}): {details}
fr: Erreur de paiement (Code : {statusCode}) : {details}
it: Errore di pagamento (Codice: {statusCode}): {details}
ru: Ошибка оплаты (Код: {statusCode}): {details}
tr: Ödeme hatası (Kod: {statusCode}): {details}
zh: 支付错误 (代码: {statusCode}): {details}

# menuCampaignPrice
source: Campaign Price: {price} {currency}
ar: سعر الحملة: {price} {currency}
de: Kampagnenpreis: {price} {currency}
es: Precio de Campaña: {price} {currency}
fr: Prix de la Campagne : {price} {currency}
it: Prezzo Campagna: {price} {currency}
ru: Цена кампании: {price} {currency}
tr: Kampanya Fiyatı: {price} {currency}
zh: 促销价格: {price} {currency}

# newOrderBasketEmpty
source: Your cart is empty.
ar: سلتك فارغة.
de: Ihr Warenkorb ist leer.
es: Tu carrito está vacío.
fr: Votre panier est vide.
it: Il tuo carrello è vuoto.
ru: Ваша корзина пуста.
tr: Sepetiniz boş.
zh: 您的购物车是空的。

# newOrderBasketExtras
source: Extras: {extrasList}
ar: الإضافات: {extrasList}
it: Extra: {extrasList}
ru: Дополнительно: {extrasList}
tr: Ekstralar: {extrasList}
zh: 附加项: {extrasList}

# orderItemButtonDeliver
source: Deliver
ar: توصيل
de: Ausliefern
es: Entregar
fr: Livrer
it: Consegna
ru: Доставить
tr: Teslim Et
zh: 送达

# errorUsernameExists
source: This username is already in use.
ar: اسم المستخدم هذا مستخدم بالفعل.
de: Dieser Benutzername wird bereits verwendet.
es: Este nombre de usuario ya está en uso.
fr: Ce nom d'utilisateur est déjà utilisé.
it: Questo nome utente è già in uso.
ru: Это имя пользователя уже используется.
tr: Bu kullanıcı adı zaten kullanılıyor.
zh: 此用户名已被使用。

# errorEmailExists
source: This email address is already in use.
ar: عنوان البريد الإلكتروني هذا مستخدم بالفعل.
de: Diese E-Mail-Adresse wird bereits verwendet.
es: Esta dirección de correo electrónico ya está en uso.
fr: Cette adresse e-mail est déjà utilisée.
it: Questo indirizzo email è già in uso.
ru: Этот адрес электронной почты уже используется.
tr: Bu e-posta adresi zaten kullanılıyor.
zh: 此电子邮件地址已被使用。

# parentCategoryHint
source: No parent category selected
ar: لم يتم تحديد فئة رئيسية
de: Keine übergeordnete Kategorie ausgewählt
es: Ninguna categoría padre seleccionada
fr: Aucune catégorie parente sélectionnée
it: Nessuna categoria genitore selezionata
ru: Родительская категория не выбрана
tr: Ana kategori seçilmedi
zh: 未选择父类别

# infoCategoryUpdatedSuccess
source: Category updated successfully.
ar: تم تحديث الفئة بنجاح.
de: Kategorie erfolgreich aktualisiert.
es: Categoría actualizada con éxito.
fr: Catégorie mise à jour avec succès.
it: Categoria aggiornata con successo.
ru: Категория успешно обновлена.
tr: Kategori başarıyla güncellendi.
zh: 类别更新成功。

# errorUpdatingCategory
source: Error updating category (Code: {statusCode}): {details}
ar: خطأ في تحديث الفئة (الرمز: {statusCode}): {details}
de: Fehler beim Aktualisieren der Kategorie (Code: {statusCode}): {details}
es: Error al actualizar categoría (Código: {statusCode}): {details}
fr: Erreur lors de la mise à jour de la catégorie (Code : {statusCode}) : {details}
it: Errore aggiornamento categoria (Codice: {statusCode}): {details}
ru: Ошибка обновления категории (Код: {statusCode}): {details}
tr: Kategori güncellenirken hata (Kod: {statusCode}): {details}
zh: 更新类别错误 (代码: {statusCode}): {details}

# errorUpdatingCategoryGeneral
source: General error updating category: {error}
ar: خطأ عام في تحديث الفئة: {error}
de: Allgemeiner Fehler beim Aktualisieren der Kategorie: {error}
es: Error general al actualizar categoría: {error}
fr: Erreur générale de mise à jour de la catégorie : {error}
it: Errore generale aggiornamento categoria: {error}
ru: Общая ошибка обновления категории: {error}
tr: Kategori güncellenirken genel hata: {error}
zh: 更新类别的一般错误: {error}

# editCategoryPageTitle
source: Edit Category
ar: تعديل الفئة
de: Kategorie bearbeiten
es: Editar Categoría
fr: Modifier la Catégorie
it: Modifica Categoria
ru: Редактировать категорию
tr: Kategoriyi Düzenle
zh: 编辑类别

# infoKdsLoading
source: Loading KDS screens...
ar: جاري تحميل شاشات KDS...
de: KDS-Bildschirme werden geladen...
es: Cargando pantallas KDS...
fr: Chargement des écrans KDS...
it: Caricamento schermi KDS...
ru: Загрузка экранов KDS...
tr: KDS ekranları yükleniyor...
zh: 正在加载 KDS 屏幕...

# kdsScreenLabel
source: KDS Screen
ar: شاشة KDS
de: KDS-Bildschirm
es: Pantalla KDS
fr: Écran KDS
it: Schermo KDS
ru: Экран KDS
tr: KDS Ekranı
zh: KDS 屏幕

# noKdsForBusiness
source: No KDS found for the business.
ar: لم يتم العثور على KDS للعمل.
de: Kein KDS für das Unternehmen gefunden.
es: No se encontró KDS para el negocio.
fr: Aucun KDS trouvé pour l'entreprise.
it: Nessun KDS trovato per l'attività.
ru: KDS для бизнеса не найден.
tr: İşletme için KDS bulunamadı.
zh: 商家未找到 KDS。

# buttonUpdateCategory
source: Update Category
ar: تحديث الفئة
de: Kategorie aktualisieren
es: Actualizar Categoría
fr: Mettre à Jour la Catégorie
it: Aggiorna Categoria
ru: Обновить категорию
tr: Kategoriyi Güncelle
zh: 更新类别

# errorLoadingDataWithDetails
source: Error loading data: {details}
ar: خطأ في تحميل البيانات: {details}
de: Fehler beim Laden der Daten: {details}
es: Error al cargar datos: {details}
fr: Erreur lors du chargement des données : {details}
it: Errore caricamento dati: {details}
ru: Ошибка загрузки данных: {details}
tr: Veri yüklenirken hata: {details}
zh: 加载数据错误: {details}
