Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# menuItemVariantsDialogTitle
source: Variant Management - {menuItemName}
ar: إدارة المتغيرات - {menuItemName}
de: Variantenverwaltung - {menuItemName}
es: Gestión de Variantes - {menuItemName}
fr: Gestion des Variantes - {menuItemName}
it: Gestione Varianti - {menuItemName}
ru: Управление вариантами - {menuItemName}
tr: Varyant Yönetimi - {menuItemName}
zh: 变体管理 - {menuItemName}

# menuItemVariantsDialogCurrentVariants
source: Current Variants ({count}):
ar: المتغيرات الحالية ({count}):
de: Aktuelle Varianten ({count}):
es: Variantes Actuales ({count}):
fr: Variantes Actuelles ({count}) :
it: Varianti Attuali ({count}):
ru: Текущие варианты ({count}):
tr: Mevcut Varyantlar ({count}):
zh: 当前变体 ({count}):

# menuItemVariantsDialogExtraTag
source: Extra
ar: إضافي
ru: Дополнительно
tr: Ekstra
zh: 附加

# menuItemVariantsDialogDeleteVariantTooltip
source: Delete Variant
ar: حذف المتغير
de: Variante löschen
es: Eliminar Variante
fr: Supprimer la Variante
it: Elimina Variante
ru: Удалить вариант
tr: Varyantı Sil
zh: 删除变体

# menuItemVariantsDialogNoVariantsAdded
source: No variants added yet
ar: لم تتم إضافة أي متغيرات بعد
de: Noch keine Varianten hinzugefügt
es: Aún no se han añadido variantes
fr: Aucune variante ajoutée pour le moment
it: Nessuna variante ancora aggiunta
ru: Варианты еще не добавлены
tr: Henüz varyant eklenmemiş
zh: 尚未添加变体

# menuItemVariantsDialogNoVariantsDescription
source: You can add variants such as size or extra options for this product
ar: يمكنك إضافة متغيرات مثل الحجم أو الخيارات الإضافية لهذا المنتج
de: Sie können Varianten wie Größe oder Zusatzoptionen für dieses Produkt hinzufügen
es: Puedes añadir variantes como tamaño u opciones extra para este producto
fr: Vous pouvez ajouter des variantes telles que la taille ou des options supplémentaires pour ce produit
it: Puoi aggiungere varianti come dimensione o opzioni extra per questo prodotto
ru: Вы можете добавить варианты, такие как размер или дополнительные опции, для этого продукта
tr: Bu ürün için boyut, ekstra seçenek gibi varyantlar ekleyebilirsiniz
zh: 您可以为该产品添加尺寸或附加选项等变体

# menuItemVariantsDialogAddNewVariant
source: Add New Variant:
ar: إضافة متغير جديد:
de: Neue Variante hinzufügen:
es: Añadir Nueva Variante:
fr: Ajouter une Nouvelle Variante :
it: Aggiungi Nuova Variante:
ru: Добавить новый вариант:
tr: Yeni Varyant Ekle:
zh: 添加新变体:

# menuItemVariantsDialogVariantNameLabel
source: Variant Name
ar: اسم المتغير
de: Variantenname
es: Nombre de la Variante
fr: Nom de la Variante
it: Nome Variante
ru: Название варианта
tr: Varyant Adı
zh: 变体名称

# menuItemVariantsDialogVariantNameHint
source: Large, Small, Extra...
ar: كبير، صغير، إضافي...
de: Groß, Klein, Extra...
es: Grande, Pequeño, Extra...
fr: Grand, Petit, Extra...
it: Grande, Piccolo, Extra...
ru: Большой, Маленький, Дополнительно...
tr: Büyük, Küçük, Ekstra...
zh: 大份, 小份, 附加...

# menuItemVariantsDialogVariantNameRequired
source: Variant name is required
ar: اسم المتغير مطلوب
de: Variantenname ist erforderlich
es: El nombre de la variante es obligatorio
fr: Le nom de la variante est requis
it: Il nome della variante è obbligatorio
ru: Название варианта обязательно
tr: Varyant adı gerekli
zh: 变体名称为必填项

# menuItemVariantsDialogPriceLabel
source: Price
ar: السعر
de: Preis
es: Precio
fr: Prix
it: Prezzo
ru: Цена
tr: Fiyat
zh: 价格

# menuItemVariantsDialogPriceRequired
source: Price is required
ar: السعر مطلوب
de: Preis ist erforderlich
es: El precio es obligatorio
fr: Le prix est requis
it: Il prezzo è obbligatorio
ru: Цена обязательна
tr: Fiyat gerekli
zh: 价格为必填项

# menuItemVariantsDialogInvalidPrice
source: Invalid price
ar: سعر غير صالح
de: Ungültiger Preis
es: Precio no válido
fr: Prix invalide
it: Prezzo non valido
ru: Недействительная цена
tr: Geçersiz fiyat
zh: 价格无效

# menuItemVariantsDialogExtraOptionTitle
source: Extra option
ar: خيار إضافي
de: Zusatzoption
es: Opción extra
fr: Option supplémentaire
it: Opzione extra
ru: Дополнительная опция
tr: Ekstra seçenek
zh: 附加选项

# menuItemVariantsDialogExtraOptionSubtitle
source: Is it a feature with an extra fee?
ar: هل هي ميزة برسوم إضافية؟
de: Ist es eine Funktion mit einer Zusatzgebühr?
es: ¿Es una característica con cargo extra?
fr: Est-ce une fonctionnalité avec des frais supplémentaires ?
it: È una caratteristica con un costo extra?
ru: Это функция с дополнительной платой?
tr: Ek ücretli özellik mi?
zh: 是否为额外收费的特色？

# menuItemVariantsDialogVariantPhotoOptional
source: Variant Photo (Optional)
ar: صورة المتغير (اختياري)
de: Variantenfoto (Optional)
es: Foto de la Variante (Opcional)
fr: Photo de Variante (Facultatif)
it: Foto Variante (Opzionale)
ru: Фото варианта (Необязательно)
tr: Varyant Fotoğrafı (Opsiyonel)
zh: 变体照片 (可选)

# menuItemVariantsDialogSelectImage
source: Select Image
ar: تحديد صورة
de: Bild auswählen
es: Seleccionar Imagen
fr: Sélectionner l'Image
it: Seleziona Immagine
ru: Выбрать изображение
tr: Resim Seç
zh: 选择图片

# menuItemVariantsDialogAddingButton
source: Adding...
ar: جاري الإضافة...
de: Wird hinzugefügt...
es: Añadiendo...
fr: Ajout en cours...
it: Aggiunta in corso...
ru: Добавление...
tr: Ekleniyor...
zh: 正在添加...

# menuItemVariantsDialogAddVariantButton
source: Add Variant
ar: إضافة متغير
de: Variante hinzufügen
es: Añadir Variante
fr: Ajouter la Variante
it: Aggiungi Variante
ru: Добавить вариант
tr: Varyant Ekle
zh: 添加变体

# menuItemVariantsDialogCloseButton
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ru: Закрыть
tr: Kapat
zh: 关闭

# templateCategoryDropdownLabel
source: Select Category
ar: حدد الفئة
de: Kategorie auswählen
es: Seleccionar Categoría
fr: Sélectionner la Catégorie
it: Seleziona Categoria
ru: Выбрать категорию
tr: Kategori Seçin
zh: 选择类别

# templateCategoryDropdownUnknownCategory
source: Unknown Category
ar: فئة غير معروفة
de: Unbekannte Kategorie
es: Categoría Desconocida
fr: Catégorie Inconnue
it: Categoria Sconosciuta
ru: Неизвестная категория
tr: Bilinmeyen Kategori
zh: 未知类别

# templateCategoryDropdownHint
source: Select a category...
ar: حدد فئة...
de: Eine Kategorie auswählen...
es: Selecciona una categoría...
fr: Sélectionner une catégorie...
it: Seleziona una categoria...
ru: Выберите категорию...
tr: Kategori seçiniz...
zh: 选择一个类别...

# snackbarMenuItemDeleted
source: Item {menuItemName} has been deleted
ar: تم حذف العنصر {menuItemName}
de: Artikel {menuItemName} wurde gelöscht
es: El artículo {menuItemName} ha sido eliminado
fr: L'article {menuItemName} a été supprimé
it: Articolo {menuItemName} è stato eliminato
ru: Товар {menuItemName} удален
tr: {menuItemName} ürünü silindi
zh: 产品 {menuItemName} 已删除

# snackbarMenuItemDeleteError
source: Error deleting item: {error}
ar: خطأ في حذف العنصر: {error}
de: Fehler beim Löschen des Artikels: {error}
es: Error al eliminar artículo: {error}
fr: Erreur lors de la suppression de l'article : {error}
it: Errore eliminazione articolo: {error}
ru: Ошибка удаления товара: {error}
tr: Ürün silinirken hata: {error}
zh: 删除产品错误: {error}

# snackbarUploadingPhotoFor
source: Uploading photo for {menuItemName}...
ar: جاري تحميل الصورة لـ {menuItemName}...
de: Foto für {menuItemName} wird hochgeladen...
es: Subiendo foto para {menuItemName}...
fr: Téléchargement de la photo pour {menuItemName}...
it: Caricamento foto per {menuItemName} in corso...
ru: Загрузка фото для {menuItemName}...
tr: {menuItemName} için fotoğraf yükleniyor...
zh: 正在为 {menuItemName} 上传照片...

# snackbarPhotoUpdateSuccess
source: Photo for {menuItemName} updated successfully!
ar: تم تحديث الصورة لـ {menuItemName} بنجاح!
de: Foto für {menuItemName} erfolgreich aktualisiert!
es: ¡Foto para {menuItemName} actualizada con éxito!
fr: Photo pour {menuItemName} mise à jour avec succès !
it: Foto per {menuItemName} aggiornata con successo!
ru: Фото для {menuItemName} успешно обновлено!
tr: {menuItemName} fotoğrafı başarıyla güncellendi!
zh: {menuItemName} 的照片更新成功！

# snackbarPhotoUploadFailed
source: Photo could not be uploaded: {error}
ar: تعذر تحميل الصورة: {error}
de: Foto konnte nicht hochgeladen werden: {error}
es: No se pudo subir la foto: {error}
fr: La photo n'a pas pu être téléchargée : {error}
it: Impossibile caricare la foto: {error}
ru: Не удалось загрузить фото: {error}
tr: Fotoğraf yüklenemedi: {error}
zh: 照片上传失败: {error}

# snackbarPhotoUploadError
source: Error while uploading photo: {error}
ar: خطأ أثناء تحميل الصورة: {error}
de: Fehler beim Hochladen des Fotos: {error}
es: Error al subir foto: {error}
fr: Erreur lors du téléchargement de la photo : {error}
it: Errore durante il caricamento della foto: {error}
ru: Ошибка при загрузке фото: {error}
tr: Fotoğraf yüklenirken hata oluştu: {error}
zh: 上传照片时出错: {error}

# firebaseUploadError
source: Firebase upload error: {error}
ar: خطأ في تحميل Firebase: {error}
de: Firebase-Upload-Fehler: {error}
es: Error de subida a Firebase: {error}
fr: Erreur de téléchargement Firebase : {error}
it: Errore caricamento Firebase: {error}
ru: Ошибка загрузки Firebase: {error}
tr: Firebase yükleme hatası: {error}
zh: Firebase 上传错误: {error}

# apiUpdateError
source: API update error: {error}
ar: خطأ في تحديث API: {error}
de: API-Aktualisierungsfehler: {error}
es: Error de actualización de API: {error}
fr: Erreur de mise à jour API : {error}
it: Errore aggiornamento API: {error}
ru: Ошибка обновления API: {error}
tr: API güncelleme hatası: {error}
zh: API 更新错误: {error}

# dialogPhotoSourceTitle
source: Photo Source
ar: مصدر الصورة
de: Fotoquelle
es: Fuente de la Foto
fr: Source de la Photo
it: Sorgente Foto
ru: Источник фото
tr: Fotoğraf Kaynağı
zh: 照片来源

# dialogPhotoSourceContent
source: Where do you want to select the photo from?
ar: من أين تريد تحديد الصورة؟
de: Von wo möchten Sie das Foto auswählen?
es: ¿Desde dónde quieres seleccionar la foto?
fr: D'où souhaitez-vous sélectionner la photo ?
it: Da dove vuoi selezionare la foto?
ru: Откуда вы хотите выбрать фото?
tr: Fotoğrafı nereden seçmek istiyorsunuz?
zh: 您想从哪里选择照片？

# photoSourceGallery
source: Gallery
ar: المعرض
de: Galerie
es: Galería
fr: Galerie
it: Galleria
ru: Галерея
tr: Galeri
zh: 图库

# photoSourceCamera
source: Camera
ar: الكاميرا
de: Kamera
es: Cámara
fr: Appareil Photo
it: Fotocamera
ru: Камера
tr: Kamera
zh: 相机

source: Uncategorized
ar: غير مصنف
de: Ohne Kategorie
es: Sin Categoría
fr: Non Catégorisé
it: Non Categorizzato
ru: Без категории
tr: Kategori Yok
zh: 未分类

# vatRate
source: VAT {kdvRate}%
ar: ضريبة القيمة المضافة {kdvRate}%
de: MwSt. {kdvRate}%
es: IVA {kdvRate}%
fr: TVA {kdvRate}%
it: IVA {kdvRate}%
ru: НДС {kdvRate}%
tr: KDV {kdvRate}%
zh: 增值税 {kdvRate}%

source: Add Photo
ar: إضافة صورة
de: Foto hinzufügen
es: Añadir Foto
fr: Ajouter Photo
it: Aggiungi Foto
ru: Добавить фото
tr: Fotoğraf Ekle
zh: 添加 照片

# badgeNew
source: NEW
ar: جديد
de: NEU
es: NUEVO
fr: NOUVEAU
it: NUOVO
ru: НОВЫЙ
tr: YENİ
zh: 新

# productNameRequired
source: Product name is required
ar: اسم المنتج مطلوب
de: Produktname ist erforderlich
es: El nombre del producto es obligatorio
fr: Le nom du produit est requis
it: Il nome del prodotto è obbligatorio
ru: Название продукта обязательно
tr: Ürün adı gerekli
zh: 产品名称为必填项

# genericError
source: Error: {error}
ar: خطأ: {error}
de: Fehler: {error}
fr: Erreur : {error}
it: Errore: {error}
ru: Ошибка: {error}
tr: Hata: {error}
zh: 错误: {error}

# addNewProductTitle
source: Add New Product
ar: إضافة منتج جديد
de: Neues Produkt hinzufügen
es: Añadir Nuevo Producto
fr: Ajouter un Nouveau Produit
it: Aggiungi Nuovo Prodotto
ru: Добавить новый продукт
tr: Yeni Ürün Ekle
zh: 添加新产品

# quickAddProductTitle
source: Quick Product Add
ar: إضافة منتج سريعة
de: Produkt schnell hinzufügen
es: Añadir Producto Rápido
fr: Ajout Rapide de Produit
it: Aggiunta Rapida Prodotto
ru: Быстрое добавление продукта
tr: Hızlı Ürün Ekleme
zh: 快速添加产品

# quickAddProductInfo
source: • The product is created based on a recipe by default. • You can edit the price, manual/recipe settings, and variants later. • It will appear in the product list after being added.
ar: • يتم إنشاء المنتج بناءً على وصفة افتراضيًا. • يمكنك تعديل السعر وإعدادات اليدوي/الوصفة والمتغيرات لاحقًا. • سيظهر في قائمة المنتجات بعد إضافته.
de: • Das Produkt wird standardmäßig basierend auf einem Rezept erstellt. • Sie können Preis, manuelle/Rezept-Einstellungen und Varianten später bearbeiten. • Es wird nach dem Hinzufügen in der Produktliste angezeigt.
es: • El producto se crea en base a una receta por defecto. • Puedes editar el precio, los ajustes manuales/de receta y las variantes más tarde. • Aparecerá en la lista de productos después de ser añadido.
fr: • Le produit est créé par défaut sur la base d'une recette. • Vous pouvez modifier le prix, les paramètres manuel/recette et les variantes plus tard. • Il apparaîtra dans la liste des produits après avoir été ajouté.
it: • Il prodotto è creato da ricetta per impostazione predefinita. • Puoi modificare il prezzo, le impostazioni manuali/ricetta e le varianti in seguito. • Apparirà nell'elenco prodotti dopo l'aggiunta.
ru: • Продукт по умолчанию создается на основе рецепта. • Вы можете отредактировать цену, настройки ручного/рецепта и варианты позже. • Он появится в списке продуктов после добавления.
tr: • Ürün varsayılan olarak reçeteli oluşturulur. • Fiyat, manuel/reçeteli ayarları ve varyantları sonradan düzenleyebilirsiniz. • Eklendikten sonra ürün listesinde görünecektir.
zh: • 产品默认基于配方创建。 • 您可以稍后编辑价格、手动/配方设置和变体。 • 添加后，它将出现在产品列表中。

# productNameLabel
source: Product Name
ar: اسم المنتج
de: Produktname
es: Nombre del Producto
fr: Nom du Produit
it: Nome Prodotto
ru: Название продукта
tr: Ürün Adı
zh: 产品名称

# productNameHint
source: e.g., Special Pizza, Fruit Juice, Homemade Meal...
ar: مثال: بيتزا خاصة، عصير فواكه، وجبة منزلية...
de: z. B. Spezialpizza, Fruchtsaft, Hausgemachtes Gericht...
es: ej. Pizza Especial, Zumo de Frutas, Comida Casera...
fr: ex: Pizza Spéciale, Jus de Fruit, Plat Fait Maison...
it: es. Pizza Speciale, Succo di Frutta, Piatto Fatto in Casa...
ru: например, Специальная пицца, Фруктовый сок, Домашнее блюдо...
tr: Örn: Özel Pizza, Meyve Suyu, Ev Yemeği...
zh: 例如: 特制披萨、果汁、家常饭菜...

# addingButtonLabel
source: Adding...
ar: جاري الإضافة...
de: Wird hinzugefügt...
es: Añadiendo...
fr: Ajout en cours...
it: Aggiunta in corso...
ru: Добавление...
tr: Ekleniyor...
zh: 正在添加...

# addProductButtonLabel
source: Add Product
ar: إضافة منتج
de: Produkt hinzufügen
es: Añadir Producto
fr: Ajouter le Produit
it: Aggiungi Prodotto
ru: Добавить продукт
tr: Ürünü Ekle
zh: 添加产品

# categoryLimitIndicator
source: {count} / {limit} Categories Created
ar: تم إنشاء {count} / {limit} فئة
de: {count} / {limit} Kategorien erstellt
es: {count} / {limit} Categorías Creadas
fr: {count} / {limit} Catégories Créées
it: {count} / {limit} Categorie Create
ru: Создано категорий: {count} / {limit}
tr: {count} / {limit} Kategori Oluşturuldu
zh: 已创建 {count} / {limit} 个类别

# selectImageButton
source: Select Image
ar: تحديد صورة
de: Bild auswählen
es: Seleccionar Imagen
fr: Sélectionner l'Image
it: Seleziona Immagine
ru: Выбрать изображение
tr: Resim Seç
zh: 选择图片

# addProductFromTemplateTitle
source: Add Product from Template
ar: إضافة منتج من القالب
de: Produkt aus Vorlage hinzufügen
es: Añadir Producto desde Plantilla
fr: Ajouter un Produit à partir du Modèle
it: Aggiungi Prodotto da Modello
ru: Добавить продукт из шаблона
tr: Şablondan Ürün Ekle
zh: 从模板添加产品

# itemSelectionInfo
source: Current: {currentCount}, Selected: {selectedCount}
ar: الحالي: {currentCount}، المحدد: {selectedCount}
de: Aktuell: {currentCount}, Ausgewählt: {selectedCount}
es: Actual: {currentCount}, Seleccionado: {selectedCount}
fr: Actuel : {currentCount}, Sélectionné : {selectedCount}
it: Attuali: {currentCount}, Selezionati: {selectedCount}
ru: Текущий: {currentCount}, Выбрано: {selectedCount}
tr: Mevcut: {currentCount}, Seçilen: {selectedCount}
zh: 当前: {currentCount}, 已选择: {selectedCount}

# totalVariantsInfo
source: Total Variants: {count}
ar: إجمالي المتغيرات: {count}
de: Toplam {count} varyant
es: Variantes Totales: {count}
fr: Total des Variantes : {count}
it: Varianti Totali: {count}
ru: Всего вариантов: {count}
tr: Toplam {count} varyant
zh: 总计 {count} 个变体

# searchProductLabel
source: Search Product
ar: البحث عن منتج
de: Produkt suchen
es: Buscar Producto
fr: Rechercher un Produit
it: Cerca Prodotto
ru: Поиск продукта
tr: Ürün Ara
zh: 搜索产品

# searchProductHint
source: Search by product name...
ar: البحث حسب اسم المنتج...
de: Nach Produktname suchen...
es: Buscar por nombre de producto...
fr: Rechercher par nom de produit...
it: Cerca per nome prodotto...
ru: Поиск по названию продукта...
tr: Ürün adı ile ara...
zh: 按产品名称搜索...

# setupCategoriesUnnamedCategory
source: Unnamed Category
ar: فئة غير مسماة
de: Unbenannte Kategorie
es: Categoría sin Nombre
fr: Catégorie sans Nom
it: Categoria Senza Nome
ru: Безымянная категория
tr: İsimsiz Kategori
zh: 未命名类别

# setupCategoriesKdsInfoWithId
source: KDS ID: {id}
ar: معرف KDS: {id}
es: ID de KDS: {id}
fr: ID KDS : {id}
it: ID KDS: {id}
ru: ID KDS: {id}

# setupCategoriesSubCategoryLabel
source: Sub: {parentName}
ar: فرعية: {parentName}
de: Unterkategorie: {parentName}
fr: Sous : {parentName}
it: Sotto: {parentName}
ru: Под: {parentName}
tr: Alt: {parentName}
zh: 子类别: {parentName}

# setupCategoriesVatRateLabel
source: VAT {rate}%
ar: ضريبة القيمة المضافة {rate}%
de: MwSt. {rate}%
es: IVA {rate}%
fr: TVA {rate}%
it: IVA {rate}%
ru: НДС {rate}%
tr: KDV {rate}%
zh: 增值税 {rate}%

# buttonDelete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ru: Удалить
tr: Sil
zh: 删除

# imagePickerSelectButton
source: Select Image
ar: تحديد صورة
de: Bild auswählen
es: Seleccionar Imagen
fr: Sélectionner l'Image
it: Seleziona Immagine
ru: Выбрать изображение
tr: Fotoğraf Seçimi Yap
zh: 选择图片

# audioGuideActive
source: Voice Guide Active
ar: الدليل الصوتي نشط
de: Audio-Anleitung aktiv
es: Guía de Audio Activa
fr: Guide Audio Actif
it: Guida Audio Attiva
ru: Аудиогид активен
tr: Sesli Rehber Aktif
zh: 语音指南已激活

# audioGuideTooltipUnmute
source: Unmute
ar: إلغاء كتم الصوت
de: Stummschaltung aufheben
fr: Activer le Son
it: Riattiva Audio
ru: Включить звук
tr: Sesi Aç
zh: 取消静音

# audioGuideTooltipMute
source: Mute
ar: كتم الصوت
de: Stummschalten
fr: Désactiver le Son
it: Silenzia
ru: Выключить звук
tr: Sesi Kapat
zh: 静音

# audioGuideTooltipReplay
source: Replay Guide
ar: إعادة تشغيل الدليل
de: Anleitung wiederholen
es: Repetir Guía
fr: Rejouer le Guide
it: Ripeti Guida
ru: Повторить сопровождение
tr: Rehberi Tekrar Çal
zh: 重播指南

# variantManagementDialogTitle
source: Variant Management - {templateName}
ar: إدارة المتغيرات - {templateName}
de: Variantenverwaltung - {templateName}
es: Gestión de Variantes - {templateName}
fr: Gestion des Variantes - {templateName}
it: Gestione Varianti - {templateName}
ru: Управление вариантами - {templateName}
tr: Varyant Yönetimi - {templateName}
zh: 变体管理 - {templateName}

# quickAddVariantTitle
source: Quick Add Variant:
ar: إضافة متغير سريع:
de: Variante schnell hinzufügen:
es: Añadir Variante Rápida:
fr: Ajout Rapide de Variante :
it: Aggiunta Rapida Variante:
ru: Быстрое добавление варианта:
tr: Hızlı Varyant Ekle:
zh: 快速添加变体:

source: Loading variant templates...
ar: جاري تحميل قوالب المتغيرات...
de: Varianten-Vorlagen werden geladen...
es: Cargando plantillas de variantes...
fr: Chargement des modèles de variante...
it: Caricamento modelli di variante...
ru: Загрузка шаблонов вариантов...
tr: Varyant şablonları yükleniyor...
zh: 正在加载变体模板...

# addedVariantsTitle
source: Added Variants ({count}):
ar: المتغيرات المضافة ({count}):
de: Hinzugefügte Varianten ({count}):
es: Variantes Añadidas ({count}):
fr: Variantes Ajoutées ({count}) :
it: Varianti Aggiunte ({count}):
ru: Добавленные варианты ({count}):
tr: Eklenen Varyantlar ({count}):
zh: 已添加变体 ({count}):

# variantExtraTag
source: Extra
ar: إضافي
ru: Дополнительно
tr: Ekstra
zh: 附加

# variantWithPhotoTag
source: With Photo
ar: مع صورة
de: Mit Foto
es: Con Foto
fr: Avec Photo
it: Con Foto
ru: С фото
tr: Fotoğraflı
zh: 有照片

# manualAddVariantTitle
source: Manual Add Variant:
ar: إضافة متغير يدويًا:
de: Manuelle Variante hinzufügen:
es: Añadir Variante Manual:
fr: Ajout Manuel de Variante :
it: Aggiunta Variante Manuale:
ru: Ручное добавление варианта:
tr: Manuel Varyant Ekle:
zh: 手动添加变体:

# variantNameHint
source: Large, Small...
ar: كبير، صغير...
de: Groß, Klein...
es: Grande, Pequeño...
fr: Grand, Petit...
it: Grande, Piccolo...
ru: Большой, Маленький...
tr: Büyük, Küçük...
zh: 大份, 小份...

# checkboxExtraOptionTitle
source: Extra option
ar: خيار إضافي
de: Zusatzoption
es: Opción extra
fr: Option supplémentaire
it: Opzione extra
ru: Дополнительная опция
tr: Ekstra seçenek
zh: 附加选项

# checkboxExtraOptionSubtitle
source: Is it a feature with an extra charge?
ar: هل هي ميزة برسوم إضافية؟
de: Ist es eine Funktion mit Zusatzgebühr?
es: ¿Es una característica con cargo extra?
fr: Est-ce une fonctionnalité avec des frais supplémentaires ?
it: È una caratteristica con un costo extra?
ru: Это функция с дополнительной платой?
tr: Ek ücretli özellik mi?
zh: 是否为额外收费的特色？

# checkboxAddPhotoTitle
source: Add photo
ar: إضافة صورة
de: Foto hinzufügen
es: Añadir foto
fr: Ajouter une photo
it: Aggiungi foto
ru: Добавить фото
tr: Fotoğraf ekle
zh: 添加照片

# checkboxAddPhotoSubtitle
source: Variant image
ar: صورة المتغير
de: Variantenbild
es: Imagen de la variante
fr: Image de variante
it: Immagine variante
ru: Изображение варианта
tr: Varyant görseli
zh: 变体图片

# variantPhotoTitle
source: Variant Photo
ar: صورة المتغير
de: Variantenfoto
es: Foto de la Variante
fr: Photo de Variante
it: Foto Variante
ru: Фото варианта
tr: Varyant Fotoğrafı
zh: 变体照片

# statusSelected
source: ✓ Selected
ar: ✓ محدد
de: ✓ Ausgewählt
es: ✓ Seleccionado
fr: ✓ Sélectionné
it: ✓ Selezionato
ru: ✓ Выбрано
tr: ✓ Seçildi
zh: ✓ 已选择

# statusUploading
source: Uploading...
ar: جاري التحميل...
de: Wird hochgeladen...
es: Subiendo...
fr: Téléchargement en cours...
it: Caricamento in corso...
ru: Загрузка...
tr: Yükleniyor...
zh: 正在上传...

# buttonClose
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ru: Закрыть
tr: Kapat
zh: 关闭

# buttonComplete
source: Complete ({count})
ar: إكمال ({count})
de: Abschließen ({count})
es: Completar ({count})
fr: Terminer ({count})
it: Completa ({count})
ru: Завершить ({count})
tr: Tamamla ({count})
zh: 完成 ({count})

# snackbarVariantNameAndPriceRequired
source: Variant name and price are required
ar: اسم المتغير والسعر مطلوبان
de: Variantenname und Preis sind erforderlich
es: El nombre de la variante y el precio son obligatorios
fr: Le nom et le prix de la variante sont requis
it: Nome e prezzo della variante sono obbligatori
ru: Название варианта и цена обязательны
tr: Varyant adı ve fiyat gerekli
zh: 变体名称和价格为必填项

# snackbarInvalidPrice
source: Please enter a valid price
ar: الرجاء إدخال سعر صالح
de: Bitte geben Sie einen gültigen Preis ein
es: Por favor, introduce un precio válido
fr: Veuillez saisir un prix valide
it: Per favore, inserisci un prezzo valido
ru: Пожалуйста, введите действительную цену
tr: Geçerli bir fiyat giriniz
zh: 请输入有效的价格

# snackbarVariantPhotoRequiredWhenActive
source: A variant photo is required when the photo option is active
ar: صورة المتغير مطلوبة عندما يكون خيار الصورة نشطًا
de: Ein Variantenfoto ist erforderlich, wenn die Fotooption aktiv ist
es: Se requiere una foto de la variante cuando la opción de foto está activa
fr: Une photo de variante est requise lorsque l'option photo est active
it: Una foto variante è obbligatoria quando l'opzione foto è attiva
ru: Фото варианта обязательно, когда опция фото активна
tr: Fotoğraf aktif olduğunda varyant fotoğrafı zorunludur
zh: 照片选项处于激活状态时，变体照片为必填项
