Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# takeawayOrderFormErrorLoadingData
source: Error loading data: {error}
ar: خطأ في تحميل البيانات: {error}
de: Fehler beim Laden der Daten: {error}
es: Error al cargar datos: {error}
fr: Erreur lors du chargement des données : {error}
it: Errore caricamento dati: {error}
ru: Ошибка загрузки данных: {error}
tr: Veriler yüklenirken hata: {error}
zh: 加载数据错误: {error}

# takeawayOrderFormErrorCustomerInfo
source: Please enter the customer information completely.
ar: الرجاء إدخال معلومات العميل بالكامل.
de: Bitte geben Sie die Kundeninformationen vollständig ein.
es: Por favor, introduce la información del cliente completamente.
fr: Veuillez saisir les informations client au complet.
it: Per favore, inserisci le informazioni del cliente completamente.
ru: Пожалуйста, полностью введите информацию о клиенте.
tr: Lütfen müşteri bilgilerini eksiksiz girin.
zh: 请完整输入顾客信息。

# takeawayOrderFormErrorAddProduct
source: Please add at least one product.
ar: الرجاء إضافة منتج واحد على الأقل.
de: Bitte fügen Sie mindestens ein Produkt hinzu.
es: Por favor, añade al menos un producto.
fr: Veuillez ajouter au moins un produit.
it: Per favore, aggiungi almeno un prodotto.
ru: Пожалуйста, добавьте хотя бы один продукт.
tr: Lütfen en az bir ürün ekleyin.
zh: 请至少添加一个产品。

# takeawayOrderFormSuccess
source: Takeaway order created successfully.
ar: تم إنشاء طلب سفري بنجاح.
de: Außer-Haus-Bestellung erfolgreich erstellt.
es: Pedido para llevar creado con éxito.
fr: Commande à emporter créée avec succès.
it: Ordine da asporto creato con successo.
ru: Заказ на вынос успешно создан.
tr: Paket sipariş başarıyla oluşturuldu.
zh: 外卖订单创建成功。

# takeawayOrderFormSuccessOffline
source: Order saved offline. It will be sent when a connection is established.
ar: تم حفظ الطلب دون اتصال بالإنترنت. سيتم إرساله عند إنشاء اتصال.
de: Bestellung offline gespeichert. Sie wird gesendet, wenn eine Verbindung hergestellt ist.
es: Pedido guardado sin conexión. Se enviará cuando se establezca una conexión.
fr: Commande enregistrée hors ligne. Elle sera envoyée lorsqu'une connexion sera établie.
it: Ordine salvato offline. Verrà inviato quando verrà stabilita una connessione.
ru: Заказ сохранен офлайн. Он будет отправлен при установлении соединения.
tr: Sipariş çevrimdışı kaydedildi. Bağlantı kurulduğunda gönderilecektir.
zh: 订单已离线保存。连接建立后将发送。

# takeawayOrderFormErrorCreating
source: An error occurred while creating the order.
ar: حدث خطأ أثناء إنشاء الطلب.
de: Beim Erstellen der Bestellung ist ein Fehler aufgetreten.
es: Ocurrió un error al crear el pedido.
fr: Une erreur s'est produite lors de la création de la commande.
it: Si è verificato un errore durante la creazione dell'ordine.
ru: Произошла ошибка при создании заказа.
tr: Sipariş oluşturulurken hata oluştu.
zh: 创建订单时发生错误。

# takeawayOrderFormErrorCreatingWithCode
source: Error creating order: {statusCode}
ar: خطأ في إنشاء الطلب: {statusCode}
de: Fehler beim Erstellen der Bestellung: {statusCode}
es: Error al crear pedido: {statusCode}
fr: Erreur lors de la création de la commande : {statusCode}
it: Errore creazione ordine: {statusCode}
ru: Ошибка создания заказа: {statusCode}
tr: Sipariş oluşturulurken hata: {statusCode}
zh: 创建订单错误: {statusCode}

# takeawayOrderFormErrorCreatingGeneric
source: Error: {error}
ar: خطأ: {error}
de: Fehler: {error}
fr: Erreur : {error}
it: Errore: {error}
ru: Ошибка: {error}
tr: Hata: {error}
zh: 错误: {error}

# takeawayOrderFormCustomerNameLabel
source: Customer Name Surname*
ar: اسم العميل والكنية*
de: Name Nachname des Kunden*
es: Nombre Apellido del Cliente*
fr: Nom Prénom du Client*
it: Nome Cognome Cliente*
ru: Имя Фамилия клиента*
tr: Müşteri Adı Soyadı*
zh: 顾客姓名 姓氏*

# takeawayOrderFormCustomerNameValidator
source: Customer name is required.
ar: اسم العميل مطلوب.
de: Der Name des Kunden ist erforderlich.
es: El nombre del cliente es obligatorio.
fr: Le nom du client est requis.
it: Il nome del cliente è obbligatorio.
ru: Имя клиента обязательно.
tr: Müşteri adı gerekli.
zh: 顾客姓名为必填项。

# takeawayOrderFormCustomerPhoneLabel
source: Phone Number*
ar: رقم الهاتف*
de: Telefonnummer*
es: Número de Teléfono*
fr: Numéro de Téléphone*
it: Numero di Telefono*
ru: Номер телефона*
tr: Telefon Numarası*
zh: 电话号码*

# takeawayOrderFormCustomerPhoneValidator
source: Phone number is required.
ar: رقم الهاتف مطلوب.
de: Die Telefonnummer ist erforderlich.
es: El número de teléfono es obligatorio.
fr: Le numéro de téléphone est requis.
it: Il numero di telefono è obbligatorio.
ru: Номер телефона обязателен.
tr: Telefon numarası gerekli.
zh: 电话号码为必填项。

# takeawayOrderFormCreateButton
source: Create Order
ar: إنشاء الطلب
de: Bestellung erstellen
es: Crear Pedido
fr: Créer la Commande
it: Crea Ordine
ru: Создать заказ
tr: Siparişi Oluştur
zh: 创建订单

# staffPerformanceScreenTitle
source: Staff Performance Report
ar: تقرير أداء الموظفين
de: Personal-Leistungsbericht
es: Informe de Rendimiento del Personal
fr: Rapport de Performance du Personnel
it: Report Performance Staff
ru: Отчет о производительности персонала
tr: Personel Performans Raporu
zh: 员工绩效报告

# staffPerformanceErrorFetching
source: An error occurred while fetching performance data: {error}
ar: حدث خطأ أثناء جلب بيانات الأداء: {error}
de: Fehler beim Abrufen der Leistungsdaten: {error}
es: Ocurrió un error al obtener datos de rendimiento: {error}
fr: Une erreur s'est produite lors de la récupération des données de performance : {error}
it: Si è verificato un errore durante il recupero dei dati di performance: {error}
ru: Произошла ошибка при получении данных о производительности: {error}
tr: Performans verileri alınırken hata oluştu: {error}
zh: 获取绩效数据时发生错误: {error}

# staffPerformanceTimeRangeToday
source: Today
ar: اليوم
de: Heute
es: Hoy
fr: Aujourd'hui
it: Oggi
ru: Сегодня
tr: Bugün
zh: 今天

# staffPerformanceTimeRangeThisWeek
source: This Week
ar: هذا الأسبوع
de: Diese Woche
es: Esta Semana
fr: Cette Semaine
it: Questa Settimana
ru: На этой неделе
tr: Bu Hafta
zh: 本周

# staffPerformanceTimeRangeThisMonth
source: This Month
ar: هذا الشهر
de: Diesen Monat
es: Este Mes
fr: Ce Mois-ci
it: Questo Mese
ru: В этом месяце
tr: Bu Ay
zh: 本月

# staffPerformanceTimeRangeLast7Days
source: Last 7 Days
ar: آخر 7 أيام
de: Letzte 7 Tage
es: Últimos 7 Días
fr: 7 Derniers Jours
it: Ultimi 7 Giorni
ru: Последние 7 дней
tr: Son 7 Gün
zh: 过去 7 天

# staffPerformanceTimeRangeLast30Days
source: Last 30 Days
ar: آخر 30 يومًا
de: Letzte 30 Tage
es: Últimos 30 Días
fr: 30 Derniers Jours
it: Ultimi 30 Giorni
ru: Последние 30 дней
tr: Son 30 Gün
zh: 过去 30 天

# staffPerformanceTimeRangeCustom
source: Custom Date Range
ar: نطاق تاريخ مخصص
de: Benutzerdefinierter Datumsbereich
es: Rango de Fechas Personalizado
fr: Plage de Dates Personnalisée
it: Intervallo Date Personalizzato
ru: Пользовательский диапазон дат
tr: Özel Tarih Aralığı
zh: 自定义日期范围

# staffPerformancePickDateTooltip
source: Select Date Range
ar: تحديد نطاق التاريخ
de: Datumsbereich auswählen
es: Seleccionar Rango de Fechas
fr: Sélectionner la Plage de Dates
it: Seleziona Intervallo Date
ru: Выбрать диапазон дат
tr: Tarih Aralığı Seç
zh: 选择日期范围

# staffPerformanceNoData
source: No staff with reporting permissions were found.
ar: لم يتم العثور على موظفين لديهم أذونات إعداد التقارير.
de: Es wurde kein Personal mit Berichtsrechten gefunden.
es: No se encontró personal con permisos de informe.
fr: Aucun personnel avec des autorisations de rapport n'a été trouvé.
it: Nessun membro staff con permessi di reporting è stato trovato.
ru: Не найдено сотрудников с разрешениями на отчетность.
tr: Raporlanacak yetkiye sahip personel bulunamadı.
zh: 未找到具有报告权限的员工。

# staffPerformanceOrderCountLabel
source: Sales Order Count: {count}
ar: عدد طلبات المبيعات: {count}
de: Anzahl Verkaufsaufträge: {count}
es: Recuento de Pedidos de Venta: {count}
fr: Nombre de Commandes de Vente : {count}
it: Conteggio Ordini di Vendita: {count}
ru: Количество заказов на продажу: {count}
tr: Satış Sipariş Adedi: {count}
zh: 销售订单数: {count}

# staffPerformancePreparedItemsLabel
source: Prepared Item Count: {count}
ar: عدد العناصر المحضرة: {count}
de: Anzahl zubereiteter Artikel: {count}
es: Recuento de Artículos Preparados: {count}
fr: Nombre d'Articles Préparés : {count}
it: Conteggio Articoli Preparati: {count}
ru: Количество приготовленных товаров: {count}
tr: Hazırlanan Ürün Adedi: {count}
zh: 已准备产品数: {count}

# staffPerformanceChipSalesPermission
source: Sales Permission
ar: إذن المبيعات
de: Verkaufsberechtigung
es: Permiso de Ventas
fr: Autorisation de Vente
it: Permesso di Vendita
ru: Разрешение на продажи
tr: Satış Yetkisi
zh: 销售权限

# manageCampaignsScreenTitle
source: Campaign Management
ar: إدارة الحملات
de: Kampagnenverwaltung
es: Gestión de Campañas
fr: Gestion des Campagnes
it: Gestione Campagne
ru: Управление кампаниями
tr: Kampanya Yönetimi
zh: 促销活动管理

# manageCampaignsTooltipAdd
source: Add New Campaign
ar: إضافة حملة جديدة
de: Neue Kampagne hinzufügen
es: Añadir Nueva Campaña
fr: Ajouter une Nouvelle Campagne
it: Aggiungi Nuova Campagna
ru: Добавить новую кампанию
tr: Yeni Kampanya Ekle
zh: 添加新促销活动

# manageCampaignsErrorFetching
source: Error loading campaigns: {error}
ar: خطأ في تحميل الحملات: {error}
de: Fehler beim Laden der Kampagnen: {error}
es: Error al cargar campañas: {error}
fr: Erreur lors du chargement des campagnes : {error}
it: Errore caricamento campagne: {error}
ru: Ошибка загрузки кампаний: {error}
tr: Kampanyalar yüklenirken hata: {error}
zh: 加载促销活动错误: {error}

# manageCampaignsNoCampaigns
source: No campaigns have been created yet.
ar: لم يتم إنشاء أي حملات بعد.
de: Es wurden noch keine Kampagnen erstellt.
es: Aún no se han creado campañas.
fr: Aucune campagne n'a été créée pour le moment.
it: Nessuna campagna è stata ancora creata.
ru: Кампании еще не созданы.
tr: Henüz kampanya oluşturulmamış.
zh: 尚未创建任何促销活动。

# manageCampaignsDeleteDialogTitle
source: Delete Campaign
ar: حذف الحملة
de: Kampagne löschen
es: Eliminar Campaña
fr: Supprimer la Campagne
it: Elimina Campagna
ru: Удалить кампанию
tr: Kampanyayı Sil
zh: 删除促销活动

# manageCampaignsDeleteDialogContent
source: Are you sure you want to delete the campaign named '{campaignName}'? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف الحملة المسماة '{campaignName}'؟ لا يمكن التراجع عن هذا الإجراء.
de: Sind Sie sicher, dass Sie die Kampagne '{campaignName}' löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar la campaña llamada '{campaignName}'? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer la campagne nommée '{campaignName}' ? Cette action est irréversible.
it: Sei sicuro di voler eliminare la campagna chiamata '{campaignName}'? Questa azione non può essere annullata.
ru: Вы уверены, что хотите удалить кампанию с именем «{campaignName}»? Это действие необратимо.
tr: '{campaignName}' adlı kampanyayı silmek istediğinize emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除促销活动“{campaignName}”吗？此操作不可撤销。

# manageCampaignsDeleteDialogConfirmButton
source: Yes, Delete
ar: نعم، حذف
de: Ja, löschen
es: Sí, Eliminar
fr: Oui, Supprimer
it: Sì, Elimina
ru: Да, удалить
tr: Evet, Sil
zh: 是，删除

# manageCampaignsSuccessDelete
source: The '{campaignName}' campaign has been deleted.
ar: تم حذف حملة '{campaignName}'.
de: Die Kampagne '{campaignName}' wurde gelöscht.
es: La campaña '{campaignName}' ha sido eliminada.
fr: La campagne '{campaignName}' a été supprimée.
it: La campagna '{campaignName}' è stata eliminata.
ru: Кампания «{campaignName}» удалена.
tr: '{campaignName}' kampanyası silindi.
zh: 促销活动“{campaignName}”已删除。

# manageCampaignsErrorDelete
source: Error deleting campaign: {error}
ar: خطأ في حذف الحملة: {error}
de: Fehler beim Löschen der Kampagne: {error}
es: Error al eliminar campaña: {error}
fr: Erreur lors de la suppression de la campagne : {error}
it: Errore eliminazione campagna: {error}
ru: Ошибка удаления кампании: {error}
tr: Kampanya silinirken hata: {error}
zh: 删除促销活动错误: {error}

# manageCampaignsStatusActive
source: Active
ar: نشط
de: Aktiv
es: Activa
it: Attiva
ru: Активна
tr: Aktif
zh: 活跃

# manageCampaignsStatusInactive
source: Inactive
ar: غير نشط
de: Inaktiv
es: Inactiva
it: Inattiva
ru: Неактивна
tr: Pasif
zh: 非活跃

# manageCampaignsStartDate
source: Start: {date}
ar: البدء: {date}
es: Inicio: {date}
fr: Début : {date}
it: Inizio: {date}
ru: Начало: {date}
tr: Başlangıç: {date}
zh: 开始: {date}

# manageCampaignsEndDate
source: - End: {date}
ar: - الانتهاء: {date}
de: - Ende: {date}
es: - Fin: {date}
fr: - Fin : {date}
it: - Fine: {date}
ru: - Конец: {date}
tr: - Bitiş: {date}
zh: - 结束: {date}

# creditSalesScreenTitle
source: Credit Sales Management
ar: إدارة المبيعات الآجلة
de: Kreditverkaufsverwaltung
es: Gestión de Ventas a Crédito
fr: Gestion des Ventes à Crédit
it: Gestione Vendite a Credito
ru: Управление продажами в кредит
tr: Veresiye Yönetimi
zh: 赊账销售管理

# creditSalesUnknown
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ru: Неизвестно
tr: Bilinmiyor
zh: 未知

# creditSalesInvalidDate
source: Invalid Date
ar: تاريخ غير صالح
de: Ungültiges Datum
es: Fecha No Válida
fr: Date Invalide
it: Data Non Valida
ru: Недействительная дата
tr: Hatalı Tarih
zh: 无效日期

# creditSalesErrorFetching
source: Error fetching credit sales: {error}
ar: خطأ في جلب المبيعات الآجلة: {error}
de: Fehler beim Abrufen der Kreditverkäufe: {error}
es: Error al obtener ventas a crédito: {error}
fr: Erreur lors de la récupération des ventes à crédit : {error}
it: Errore recupero vendite a credito: {error}
ru: Ошибка получения продаж в кредит: {error}
tr: Veresiye satışlar alınırken hata: {error}
zh: 获取赊账销售错误: {error}

# creditSalesErrorLoadMore
source: Could not load more data.
ar: تعذر تحميل المزيد من البيانات.
de: Weitere Daten konnten nicht geladen werden.
es: No se pudieron cargar más datos.
fr: Impossible de charger plus de données.
it: Impossibile caricare altri dati.
ru: Не удалось загрузить больше данных.
tr: Daha fazla veri yüklenemedi.
zh: 无法加载更多数据。

# creditSalesNoActiveOrders
source: There are no active credit sales orders.
ar: لا توجد أوامر مبيعات آجلة نشطة.
de: Es gibt keine aktiven Kreditverkaufsaufträge.
es: No hay órdenes de ventas a crédito activas.
fr: Il n'y a pas de commandes de ventes à crédit actives.
it: Non ci sono ordini di vendita a credito attivi.
ru: Нет активных заказов на продажу в кредит.
tr: Aktif veresiye siparişi bulunmamaktadır.
zh: 没有活跃的赊账销售订单。

# creditSalesCardOrderId
source: Order ID: #{orderId}
ar: معرف الطلب: #{orderId}
de: Bestell-ID: #{orderId}
es: ID del Pedido: #{orderId}
fr: ID de la Commande : #{orderId}
it: ID Ordine: #{orderId}
ru: ID заказа: #{orderId}
tr: Sipariş ID: #{orderId}
zh: 订单 ID: #{orderId}

# creditSalesCardCustomer
source: Customer: {name}
ar: العميل: {name}
de: Kunde: {name}
es: Cliente: {name}
fr: Client : {name}
it: Cliente: {name}
ru: Клиент: {name}
tr: Müşteri: {name}
zh: 顾客: {name}

# creditSalesCardPhone
source: Phone: {phone}
ar: الهاتف: {phone}
de: Telefon: {phone}
es: Teléfono: {phone}
fr: Téléphone : {phone}
it: Telefono: {phone}
ru: Телефон: {phone}
tr: Telefon: {phone}
zh: 电话: {phone}

# creditSalesCardNotes
source: Notes: {notes}
ar: ملاحظات: {notes}
de: Notizen: {notes}
es: Notas: {notes}
it: Note: {notes}
ru: Примечания: {notes}
tr: Not: {notes}
zh: 备注: {notes}

# creditSalesCardCreditDate
source: Credit Date: {date}
ar: تاريخ الأجل: {date}
de: Kreditdatum: {date}
es: Fecha del Crédito: {date}
fr: Date de Crédit : {date}
it: Data Credito: {date}
ru: Дата кредита: {date}
tr: Veresiye Tarihi: {date}
zh: 赊账日期: {date}

# creditSalesCardPayButton
source: Make Payment
ar: إجراء الدفع
de: Zahlung vornehmen
es: Realizar Pago
fr: Effectuer le Paiement
it: Effettua Pagamento
ru: Произвести оплату
tr: Ödeme Yap
zh: 进行支付

# kdsScreenSnackbarOrderUpdated
source: Order status updated.
ar: تم تحديث حالة الطلب.
de: Bestellstatus aktualisiert.
es: Estado del pedido actualizado.
fr: Statut de la commande mis à jour.
it: Stato ordine aggiornato.
ru: Статус заказа обновлен.
tr: Sipariş durumu güncellendi.
zh: 订单状态已更新。

# manageShiftsScreenTitle
source: Shift Templates
ar: قوالب المناوبة
de: Schichtvorlagen
es: Plantillas de Turnos
fr: Modèles de Quart
it: Modelli di Turno
ru: Шаблоны смен
tr: Vardiya Şablonları
zh: 班次模板

# manageShiftsTooltipAdd
source: Add New Shift Template
ar: إضافة قالب مناوبة جديد
de: Neue Schichtvorlage hinzufügen
es: Añadir Nueva Plantilla de Turno
fr: Ajouter un Nouveau Modèle de Quart
it: Aggiungi Nuovo Modello di Turno
ru: Добавить новый шаблон смены
tr: Yeni Vardiya Şablonu Ekle
zh: 添加新班次模板

# manageShiftsDeleteDialogTitle
source: Delete Shift
ar: حذف المناوبة
de: Schicht löschen
es: Eliminar Turno
fr: Supprimer le Quart
it: Elimina Turno
ru: Удалить смену
tr: Vardiyayı Sil
zh: 删除班次

# manageShiftsDeleteDialogContent
source: The '{shiftName}' shift template will be deleted. All assignments using this template will also be deleted. Are you sure?
ar: سيتم حذف قالب المناوبة '{shiftName}'. سيتم أيضًا حذف جميع التعيينات التي تستخدم هذا القالب. هل أنت متأكد؟
de: Die Schichtvorlage '{shiftName}' wird gelöscht. Alle Zuweisungen, die diese Vorlage verwenden, werden ebenfalls gelöscht. Sind Sie sicher?
es: La plantilla de turno '{shiftName}' será eliminada. Todas las asignaciones que utilicen esta plantilla también serán eliminadas. ¿Estás seguro?
fr: Le modèle de quart '{shiftName}' sera supprimé. Toutes les assignations utilisant ce modèle seront également supprimées. Êtes-vous sûr ?
it: Il modello di turno '{shiftName}' verrà eliminato. Tutte le assegnazioni che utilizzano questo modello verranno anch'esse eliminate. Sei sicuro?
ru: Шаблон смены «{shiftName}» будет удален. Все назначения, использующие этот шаблон, также будут удалены. Вы уверены?
tr: '{shiftName}' vardiya şablonu silinecek. Bu şablonun kullanıldığı tüm atamalar da silinir. Emin misiniz?
zh: 班次模板“{shiftName}”将被删除。所有使用此模板的分配也将被删除。您确定吗？

# manageShiftsSuccessDelete
source: '{shiftName}' has been deleted.
ar: تم حذف '{shiftName}'.
de: '{shiftName}' wurde gelöscht.
es: '{shiftName}' ha sido eliminado.
fr: '{shiftName}' a été supprimé.
it: '{shiftName}' è stato eliminato.
ru: «{shiftName}» удален.
tr: '{shiftName}' silindi.
zh: “{shiftName}”已删除。

# manageShiftsAddDialogTitle
source: New Shift Template
ar: قالب مناوبة جديد
de: Neue Schichtvorlage
es: Nueva Plantilla de Turno
fr: Nouveau Modèle de Quart
it: Nuovo Modello di Turno
ru: Новый шаблон смены
tr: Yeni Vardiya Şablonu
zh: 新班次模板

# manageShiftsEditDialogTitle
source: Edit Shift
ar: تعديل المناوبة
de: Schicht bearbeiten
es: Editar Turno
fr: Modifier le Quart
it: Modifica Turno
ru: Редактировать смену
tr: Vardiyayı Düzenle
zh: 编辑班次

# manageShiftsShiftNameLabel
source: Shift Name
ar: اسم المناوبة
de: Schichtname
es: Nombre del Turno
fr: Nom du Quart
it: Nome Turno
ru: Название смены
tr: Vardiya Adı
zh: 班次名称

# manageShiftsStartTimeLabel
source: Start: {time}
ar: البدء: {time}
es: Inicio: {time}
fr: Début : {time}
it: Inizio: {time}
ru: Начало: {time}
tr: Başlangıç: {time}
zh: 开始: {time}

# manageShiftsEndTimeLabel
source: End: {time}
ar: الانتهاء: {time}
de: Ende: {time}
es: Fin: {time}
fr: Fin : {time}
it: Fine: {time}
ru: Конец: {time}
tr: Bitiş: {time}
zh: 结束: {time}

# manageShiftsSelectButton
source: Select
ar: تحديد
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ru: Выбрать
tr: Seç
zh: 选择

# manageShiftsColorLabel
source: Shift Color
ar: لون المناوبة
de: Schichtfarbe
es: Color del Turno
fr: Couleur du Quart
it: Colore Turno
ru: Цвет смены
tr: Vardiya Rengi
zh: 班次颜色

# generalYes
source: Yes
ar: نعم
de: Ja
es: Sí
fr: Oui
it: Sì
ru: Да
tr: Evet
zh: 是

# generalNo
source: No
ar: لا
de: Nein
fr: Non
ru: Нет
tr: Hayır
zh: 否

# manageKdsScreenTitle
source: KDS Screen Management
ar: إدارة شاشة KDS
de: KDS-Bildschirmverwaltung
es: Gestión de Pantallas KDS
fr: Gestion des Écrans KDS
it: Gestione Schermi KDS
ru: Управление экранами KDS
tr: KDS Ekranları Yönetimi
zh: KDS 屏幕管理

# manageKdsTooltipAdd
source: Add New KDS Screen
ar: إضافة شاشة KDS جديدة
de: Neuen KDS-Bildschirm hinzufügen
es: Añadir Nueva Pantalla KDS
fr: Ajouter un Nouvel Écran KDS
it: Aggiungi Nuovo Schermo KDS
ru: Добавить новый экран KDS
tr: Yeni KDS Ekranı Ekle
zh: 添加新 KDS 屏幕

# manageKdsErrorLoading
source: Error loading KDS Screens: {error}
ar: خطأ في تحميل شاشات KDS: {error}
de: Fehler beim Laden der KDS-Bildschirme: {error}
es: Error al cargar Pantallas KDS: {error}
fr: Erreur lors du chargement des Écrans KDS : {error}
it: Errore caricamento Schermi KDS: {error}
ru: Ошибка загрузки экранов KDS: {error}
tr: KDS Ekranları yüklenirken hata: {error}
zh: 加载 KDS 屏幕错误: {error}

# manageKdsAddDialogTitle
source: New KDS Screen
ar: شاشة KDS جديدة
de: Neuer KDS-Bildschirm
es: Nueva Pantalla KDS
fr: Nouvel Écran KDS
it: Nuovo Schermo KDS
ru: Новый экран KDS
tr: Yeni KDS Ekranı
zh: 新 KDS 屏幕

# manageKdsEditDialogTitle
source: Edit KDS Screen
ar: تعديل شاشة KDS
de: KDS-Bildschirm bearbeiten
es: Editar Pantalla KDS
fr: Modifier l'Écran KDS
it: Modifica Schermo KDS
ru: Редактировать экран KDS
tr: KDS Ekranını Düzenle
zh: 编辑 KDS 屏幕

# manageKdsNameLabel
source: Screen Name*
ar: اسم الشاشة*
de: Bildschirmname*
es: Nombre de la Pantalla*
fr: Nom de l'Écran*
it: Nome Schermo*
ru: Название экрана*
tr: Ekran Adı*
zh: 屏幕名称*

# manageKdsNameValidator
source: Screen name is required.
ar: اسم الشاشة مطلوب.
de: Der Bildschirmname ist erforderlich.
es: El nombre de la pantalla es obligatorio.
fr: Le nom de l'écran est requis.
it: Il nome dello schermo è obbligatorio.
ru: Название экрана обязательно.
tr: Ekran adı gerekli.
zh: 屏幕名称为必填项。

# manageKdsDescriptionLabel
source: Description (Optional)
ar: الوصف (اختياري)
de: Beschreibung (Optional)
es: Descripción (Opcional)
fr: Description (Facultatif)
it: Descrizione (Opzionale)
ru: Описание (Необязательно)
tr: Açıklama (Opsiyonel)
zh: 描述 (可选)

# manageKdsIsActiveLabel
source: Is Active?
ar: هل هي نشطة؟
de: Ist aktiv?
es: ¿Está Activa?
fr: Est Actif ?
it: È Attivo?
ru: Активен?
tr: Aktif Mi?
zh: 是否活跃？

# manageKdsDeleteDialogTitle
source: Delete KDS Screen
ar: حذف شاشة KDS
de: KDS-Bildschirm löschen
es: Eliminar Pantalla KDS
fr: Supprimer l'Écran KDS
it: Elimina Schermo KDS
ru: Удалить экран KDS
tr: KDS Ekranını Sil
zh: 删除 KDS 屏幕

# manageKdsDeleteDialogContent
source: Are you sure you want to delete the KDS screen named '{screenName}'? The redirection of categories assigned to this screen will be removed.
ar: هل أنت متأكد أنك تريد حذف شاشة KDS المسماة '{screenName}'؟ ستتم إزالة إعادة توجيه الفئات المعينة لهذه الشاشة.
de: Sind Sie sicher, dass Sie den KDS-Bildschirm '{screenName}' löschen möchten? Die Weiterleitung von Kategorien, die diesem Bildschirm zugewiesen sind, wird entfernt.
es: ¿Estás seguro de que quieres eliminar la pantalla KDS llamada '{screenName}'? La redirección de las categorías asignadas a esta pantalla será eliminada.
fr: Êtes-vous sûr de vouloir supprimer l'écran KDS nommé '{screenName}' ? La redirection des catégories assignées à cet écran sera supprimée.
it: Sei sicuro di voler eliminare lo schermo KDS chiamato '{screenName}'? Il reindirizzamento delle categorie assegnate a questo schermo verrà rimosso.
ru: Вы уверены, что хотите удалить экран KDS с именем «{screenName}»? Перенаправление категорий, назначенных этому экрану, будет удалено.
tr: '{screenName}' adlı KDS ekranını silmek istediğinizden emin misiniz? Bu ekrana atanmış kategorilerin yönlendirmesi kaldırılacaktır.
zh: 您确定要删除 KDS 屏幕“{screenName}”吗？分配给此屏幕的类别重定向将被移除。
