Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# setupCategoriesErrorLoadingTemplates
source: An error occurred while loading templates: {errorDetails}
ar: حدث خطأ أثناء تحميل القوالب: {errorDetails}
de: Beim Laden der Vorlagen ist ein Fehler aufgetreten: {errorDetails}
es: Ocurrió un error al cargar las plantillas: {errorDetails}
fr: Une erreur s'est produite lors du chargement des modèles : {errorDetails}
it: Si è verificato un errore durante il caricamento dei modelli: {errorDetails}
ru: Произошла ошибка при загрузке шаблонов: {errorDetails}
tr: Şablonlar yüklenirken bir hata oluştu: {errorDetails}
zh: 加载模板时发生错误: {errorDetails}

# setupCategoriesManualAddTitle
source: Manual Category Entry
ar: إدخال الفئة يدويًا
de: Manuelle Kategorieeingabe
es: Entrada Manual de Categoría
fr: Saisie Manuelle de Catégorie
it: Inserimento Categoria Manuale
ru: Ручной ввод категории
tr: Manuel Kategori Ekleme
zh: 手动输入类别

# setupCategoriesErrorCreating
source: Error creating categories: {errorDetails}
ar: خطأ في إنشاء الفئات: {errorDetails}
de: Fehler beim Erstellen der Kategorien: {errorDetails}
es: Error al crear categorías: {errorDetails}
fr: Erreur lors de la création des catégories : {errorDetails}
it: Errore creazione categorie: {errorDetails}
ru: Ошибка создания категорий: {errorDetails}
tr: Kategori oluşturulurken hata: {errorDetails}
zh: 创建类别错误: {errorDetails}

# categoryLimitInfo
source: Current: {current}, Selected: {selected}, Limit: {limit}
ar: الحالي: {current}، المحدد: {selected}، الحد الأقصى: {limit}
de: Aktuell: {current}, Ausgewählt: {selected}, Limit: {limit}
es: Actual: {current}, Seleccionado: {selected}, Límite: {limit}
fr: Actuel : {current}, Sélectionné : {selected}, Limite : {limit}
it: Attuale: {current}, Selezionate: {selected}, Limite: {limit}
ru: Текущий: {current}, Выбрано: {selected}, Лимит: {limit}
tr: Mevcut: {current}, Seçilen: {selected}, Limit: {limit}
zh: 当前: {current}, 已选择: {selected}, 限制: {limit}

# searchCategoryTemplateLabel
source: Search Category Templates
ar: البحث في قوالب الفئات
de: Kategorievorlagen durchsuchen
es: Buscar Plantillas de Categoría
fr: Rechercher des Modèles de Catégorie
it: Cerca Modelli Categoria
ru: Поиск шаблонов категорий
tr: Kategori Şablonu Ara
zh: 搜索类别模板

# searchCategoryTemplateHint
source: Search by category name...
ar: البحث حسب اسم الفئة...
de: Nach Kategoriename suchen...
es: Buscar por nombre de categoría...
fr: Rechercher par nom de catégorie...
it: Cerca per nome categoria...
ru: Поиск по названию категории...
tr: Kategori adı ile ara...
zh: 按类别名称搜索...

source: Select All
ar: تحديد الكل
de: Alle auswählen
es: Seleccionar Todo
fr: Tout Sélectionner
it: Seleziona Tutto
ru: Выбрать все
tr: Tümünü Seç
zh: 全选

source: Deselect All
ar: إلغاء تحديد الكل
de: Alle abwählen
es: Deseleccionar Todo
fr: Tout Désélectionner
it: Deseleziona Tutto
ru: Снять выбор со всех
tr: Tümünü Bırak
zh: 取消全选

# templatesDisplayed
source: Displaying: {count} templates
ar: عرض: {count} قوالب
de: Anzeige: {count} Vorlagen
es: Mostrando: {count} plantillas
fr: Affichage : {count} modèles
it: Visualizzazione: {count} modelli
ru: Отображается: {count} шаблон(а/ов)
tr: Görüntülenen: {count} şablon
zh: 正在显示: {count} 个模板

source: No templates found
ar: لم يتم العثور على قوالب
de: Keine Vorlagen gefunden
es: No se encontraron plantillas
fr: Aucun modèle trouvé
it: Nessun modello trovato
ru: Шаблоны не найдены
tr: Şablon bulunamadı
zh: 未找到模板

# noTemplatesMatchSearch
source: No category templates found matching your search criteria.
ar: لم يتم العثور على قوالب فئات تطابق معايير البحث الخاصة بك.
de: Keine Kategorievorlagen gefunden, die Ihren Suchkriterien entsprechen.
es: No se encontraron plantillas de categoría que coincidan con tus criterios de búsqueda.
fr: Aucun modèle de catégorie trouvé correspondant à vos critères de recherche.
it: Nessun modello di categoria trovato corrispondente ai criteri di ricerca.
ru: Не найдено шаблонов категорий, соответствующих вашему поиску.
tr: Arama kriterlerinize uygun kategori şablonu bulunamadı.
zh: 未找到匹配您搜索条件的 类别模板。

# iconInfo
source: Icon: {iconName}
ar: الأيقونة: {iconName}
de: Symbol: {iconName}
es: Icono: {iconName}
fr: Icône : {iconName}
it: Icona: {iconName}
ru: Иконка: {iconName}
tr: İkon: {iconName}
zh: 图标: {iconName}

source: Limit will be exceeded
ar: سيتم تجاوز الحد الأقصى
de: Limit wird überschritten
es: Se excederá el límite
fr: La limite sera dépassée
it: Limite superato
ru: Лимит будет превышен
tr: Limit aşılacak
zh: 将超出限制

# createTemplateButtonWithCount
source: Create {count} Templates
ar: إنشاء {count} قوالب
de: {count} Vorlagen erstellen
es: Crear {count} Plantillas
fr: Créer {count} Modèles
it: Crea {count} Modelli
ru: Создать {count} шаблон(а/ов)
tr: {count} Şablon Oluştur
zh: 创建 {count} 个模板

# quickStartTitle
source: Quick Start
ar: البدء السريع
de: Schnellstart
es: Inicio Rápido
fr: Démarrage Rapide
it: Avvio Rapido
ru: Быстрый старт
tr: Hızlı Başlangıç
zh: 快速开始

# quickStartDescription
source: Quickly add ready-made items for popular categories
ar: أضف بسرعة عناصر جاهزة للفئات الشائعة
de: Fügen Sie schnell vorgefertigte Artikel für beliebte Kategorien hinzu
es: Añade rápidamente artículos predefinidos para categorías populares
fr: Ajoutez rapidement des articles prêts à l'emploi pour les catégories populaires
it: Aggiungi rapidamente articoli pronti per le categorie popolari
ru: Быстро добавляйте готовые товары для популярных категорий
tr: Popüler kategoriler için hazır ürünleri hızla ekleyin
zh: 快速添加流行类别的现成产品

# addFromTemplateButton
source: Add from Template
ar: إضافة من القالب
de: Aus Vorlage hinzufügen
es: Añadir desde Plantilla
fr: Ajouter à partir du Modèle
it: Aggiungi da Modello
ru: Добавить из шаблона
tr: Şablondan Ürün Ekle
zh: 从模板添加

# menuItemsAddedSuccess
source: {count,plural, =1{1 item successfully added!} other{# items successfully added!}}
ar: تمت إضافة {count,plural, =1{1 عنصر بنجاح!} other{# عناصر بنجاح!}}
de: {count,plural, =1{1 Artikel erfolgreich hinzugefügt!} other{# Artikel erfolgreich hinzugefügt!}}
es: {count,plural, =1{¡1 artículo añadido con éxito!} other{¡# artículos añadidos con éxito!}}
fr: {count,plural, =1{1 article ajouté avec succès !} other{# articles ajoutés avec succès !}}
it: {count,plural, =1{1 articolo aggiunto con successo!} other{# articoli aggiunti con successo!}}
ru: {count,plural, one{1 товар успешно добавлен!} few{# товара успешно добавлены!} many{# товаров успешно добавлено!} other{# товаров успешно добавлено!}}
tr: {count,plural, =1{1 ürün başarıyla eklendi!} other{# ürün başarıyla eklendi!}}
zh: {count,plural, =1{1 个产品成功添加！} other{# 个产品成功添加！}}

# menuItemsAddedError
source: No items could be added. Please try again.
ar: لم يتم إضافة أي عناصر. الرجاء المحاولة مرة أخرى.
de: Es konnten keine Artikel hinzugefügt werden. Bitte versuchen Sie es erneut.
es: No se pudo añadir ningún artículo. Por favor, inténtalo de nuevo.
fr: Aucun article n'a pu être ajouté. Veuillez réessayer.
it: Nessun articolo è stato aggiunto. Per favore, riprova.
ru: Не удалось добавить ни одного товара. Пожалуйста, попробуйте снова.
tr: Hiçbir ürün eklenemedi. Lütfen tekrar deneyin.
zh: 未能添加任何产品。请重试。

# errorCreatingCustomProduct
source: Error creating custom product: {error}
ar: خطأ في إنشاء منتج مخصص: {error}
de: Fehler beim Erstellen des benutzerdefinierten Produkts: {error}
es: Error al crear producto personalizado: {error}
fr: Erreur lors de la création du produit personnalisé : {error}
it: Errore creazione prodotto personalizzato: {error}
ru: Ошибка создания пользовательского продукта: {error}
tr: Özel ürün oluşturulurken hata: {error}
zh: 创建自定义产品错误: {error}

# menuItemService_errorBusinessInfoMissing
source: Business information is missing. Please restart the application.
ar: معلومات العمل مفقودة. يرجى إعادة تشغيل التطبيق.
de: Geschäftsinformationen fehlen. Bitte starten Sie die Anwendung neu.
es: Falta información del negocio. Por favor, reinicia la aplicación.
fr: Les informations de l'entreprise sont manquantes. Veuillez redémarrer l'application.
it: Informazioni attività mancanti. Per favore, riavvia l'applicazione.
ru: Отсутствует информация о бизнесе. Пожалуйста, перезапустите приложение.
tr: İşletme bilgisi eksik. Lütfen uygulamayı yeniden başlatın.
zh: 商家信息缺失。请重新启动应用程序。

# menuItemService_errorInvalidCategory
source: Invalid category. Please select a different category.
ar: فئة غير صالحة. الرجاء تحديد فئة مختلفة.
de: Ungültige Kategorie. Bitte wählen Sie eine andere Kategorie.
es: Categoría no válida. Por favor, selecciona una categoría diferente.
fr: Catégorie invalide. Veuillez sélectionner une catégorie différente.
it: Categoria non valida. Per favore, seleziona una categoria diversa.
ru: Недействительная категория. Пожалуйста, выберите другую категорию.
tr: Geçersiz kategori. Lütfen farklı bir kategori seçin.
zh: 类别无效。请选择一个不同的类别。

# menuItemService_errorProductAlreadyExists
source: A product with this name already exists. Please try a different name.
ar: منتج بهذا الاسم موجود بالفعل. يرجاء تجربة اسم مختلف.
de: Ein Produkt mit diesem Namen existiert bereits. Bitte versuchen Sie einen anderen Namen.
es: Ya existe un producto con este nombre. Por favor, prueba con un nombre diferente.
fr: Un produit portant ce nom existe déjà. Veuillez essayer un nom différent.
it: Esiste già un prodotto con questo nome. Per favore, prova un nome diverso.
ru: Продукт с таким названием уже существует. Пожалуйста, попробуйте другое название.
tr: Bu isimde bir ürün zaten mevcut. Lütfen farklı bir isim deneyin.
zh: 已存在同名产品。请尝试不同的名称。

# menuItemService_errorPriceRequiredForManualProduct
source: Price must be specified for a manual product.
ar: يجب تحديد السعر للمنتج اليدوي.
de: Für ein manuelles Produkt muss ein Preis angegeben werden.
es: El precio debe especificarse para un producto manual.
fr: Le prix doit être spécifié pour un produit manuel.
it: Il prezzo deve essere specificato per un prodotto manuale.
ru: Цена должна быть указана для продукта, добавляемого вручную.
tr: Manuel ürün için fiyat belirtmek zorunludur.
zh: 手动产品必须指定价格。

# menuItemService_errorAuthorization
source: Authorization error. Please log in again.
ar: خطأ في التفويض. الرجاء تسجيل الدخول مرة أخرى.
de: Autorisierungsfehler. Bitte melden Sie sich erneut an.
es: Error de autorización. Por favor, inicia sesión de nuevo.
fr: Erreur d'autorisation. Veuillez vous reconnecter.
it: Errore di autorizzazione. Per favore, accedi di nuovo.
ru: Ошибка авторизации. Пожалуйста, войдите снова.
tr: Yetki hatası. Lütfen tekrar giriş yapın.
zh: 授权错误。请重新登录。

# menuItemService_errorForbidden
source: You are not authorized for this action.
ar: أنت غير مخول لهذا الإجراء.
de: Sie sind für diese Aktion nicht autorisiert.
es: No estás autorizado para esta acción.
fr: Vous n'êtes pas autorisé à effectuer cette action.
it: Non sei autorizzato per questa azione.
ru: У вас нет разрешения на это действие.
tr: Bu işlem için yetkiniz bulunmuyor.
zh: 您没有权限执行此操作。

# menuItemService_errorProductLimitReached
source: You have reached your product adding limit.
ar: لقد وصلت إلى الحد الأقصى لإضافة المنتجات.
de: Sie haben Ihr Produkt-Hinzufügungs-Limit erreicht.
es: Has alcanzado tu límite de adición de productos.
fr: Vous avez atteint votre limite d'ajout de produits.
it: Hai raggiunto il limite di aggiunta prodotti.
ru: Вы достигли лимита на добавление продуктов.
tr: Ürün ekleme limitinize ulaştınız.
zh: 您已达到产品添加限制。

# menuItemService_errorCreatingCustomProduct
source: Error creating custom product: {error}
ar: خطأ في إنشاء منتج مخصص: {error}
de: Fehler beim Erstellen des benutzerdefinierten Produkts: {error}
es: Error al crear producto personalizado: {error}
fr: Erreur lors de la création du produit personnalisé : {error}
it: Errore creazione prodotto personalizzato: {error}
ru: Ошибка создания пользовательского продукта: {error}
tr: Özel ürün oluşturulurken hata: {error}
zh: 创建自定义产品错误: {error}

# menuItemService_unnamedProduct
source: Unnamed Product
ar: منتج غير مسمى
de: Unbenanntes Produkt
es: Producto sin Nombre
fr: Produit sans Nom
it: Prodotto Senza Nome
ru: Безымянный продукт
tr: İsimsiz Ürün
zh: 未命名产品

# menuItemService_errorCouldNotCreateUniqueName
source: Could not make the product name unique. Please try a different name manually.
ar: تعذر جعل اسم المنتج فريدًا. يرجى تجربة اسم مختلف يدويًا.
de: Der Produktname konnte nicht eindeutig gemacht werden. Bitte versuchen Sie manuell einen anderen Namen.
es: No se pudo hacer que el nombre del producto fuera único. Por favor, prueba con un nombre diferente manualmente.
fr: Impossible de rendre le nom du produit unique. Veuillez essayer un nom différent manuellement.
it: Impossibile rendere il nome del prodotto unico. Per favore, prova un nome diverso manualmente.
ru: Не удалось сделать название продукта уникальным. Пожалуйста, попробуйте другое название вручную.
tr: Ürün ismi benzersiz hale getirilemedi. Lütfen manuel olarak farklı bir isim deneyin.
zh: 无法创建唯一的产品名称。请手动尝试不同的名称。

# menuItemService_errorCreatingProduct
source: An error occurred while creating the product: {error}
ar: حدث خطأ أثناء إنشاء المنتج: {error}
de: Ein Fehler ist beim Erstellen des Produkts aufgetreten: {error}
es: Ocurrió un error al crear el producto: {error}
fr: Une erreur s'est produite lors de la création du produit : {error}
it: Si è verificato un errore durante la creazione del prodotto: {error}
ru: Произошла ошибка при создании продукта: {error}
tr: Ürün oluşturulurken bir hata oluştu: {error}
zh: 创建产品时发生错误: {error}

# menuItemService_errorVariantImageUploadFailed
source: Failed to upload variant image.
ar: فشل تحميل صورة المتغير.
de: Hochladen des Variantenbilds fehlgeschlagen.
es: Error al subir la imagen de la variante.
fr: Échec du téléchargement de l'image de la variante.
it: Caricamento immagine variante fallito.
ru: Не удалось загрузить изображение варианта.
tr: Varyant görseli yüklenemedi.
zh: 变体图片上传失败。

# menuItemService_errorFetchingTemplateData
source: An error occurred while fetching template data.
ar: حدث خطأ أثناء جلب بيانات القالب.
de: Beim Abrufen der Vorlagendaten ist ein Fehler aufgetreten.
es: Ocurrió un error al obtener datos de la plantilla.
fr: Une erreur s'est produite lors de la récupération des données de modèle.
it: Si è verificato un errore durante il recupero dei dati del modello.
ru: Произошла ошибка при получении данных шаблона.
tr: Şablon verileri alınırken bir hata oluştu.
zh: 获取模板数据时发生错误。

# menuItemService_errorNetworkFetchingTemplate
source: Network error while fetching template data: {error}
ar: خطأ في الشبكة أثناء جلب بيانات القالب: {error}
de: Netzwerkfehler beim Abrufen der Vorlagendaten: {error}
es: Error de red al obtener datos de la plantilla: {error}
fr: Erreur réseau lors de la récupération des données de modèle : {error}
it: Errore di rete durante il recupero dei dati del modello: {error}
ru: Ошибка сети при получении данных шаблона: {error}
tr: Şablon verisi alınırken ağ hatası: {error}
zh: 获取模板数据时的网络错误: {error}

# menuItemService_errorFirebaseUploadFailed
source: File upload failed.
ar: فشل تحميل الملف.
de: Dateiupload fehlgeschlagen.
es: Error al subir el archivo.
fr: Échec du téléchargement du fichier.
it: Caricamento file fallito.
ru: Не удалось загрузить файл.
tr: Dosya yüklemesi başarısız oldu.
zh: 文件上传失败。

# manualMenuItemAddTitle
source: Add Product Manually
ar: إضافة منتج يدويًا
de: Produkt manuell hinzufügen
es: Añadir Producto Manualmente
fr: Ajouter un Produit Manuellement
it: Aggiungi Prodotto Manualmente
ru: Добавить продукт вручную
tr: Manuel Ürün Ekleme
zh: 手动添加产品

# menuItemPriceHint
source: e.g., 25.50
ar: مثال: 25.50
de: z. B. 25,50
es: ej. 25.50
fr: ex: 25.50
it: es. 25.50
ru: например, 25.50
tr: Örn: 25.50
zh: 例如: 25.50

# selectCategoryFirst
source: Please select a category first
ar: الرجاء تحديد فئة أولاً
de: Bitte wählen Sie zuerst eine Kategorie aus
es: Por favor, selecciona una categoría primero
fr: Veuillez d'abord sélectionner une catégorie
it: Per favore, seleziona prima una categoria
ru: Пожалуйста, сначала выберите категорию
tr: Önce bir kategori seçin
zh: 请先选择一个类别

source: Loading templates...
ar: جاري تحميل القوالب...
de: Vorlagen werden geladen...
es: Cargando plantillas...
fr: Chargement des modèles...
it: Caricamento modelli...
ru: Загрузка шаблонов...
tr: Şablonlar yükleniyor...
zh: 正在加载模板...

# noTemplatesFoundForCategory
source: No templates found for this category
ar: لم يتم العثور على قوالب لهذه الفئة
de: Keine Vorlagen für diese Kategorie gefunden
es: No se encontraron plantillas para esta categoría
fr: Aucun modèle trouvé pour cette catégorie
it: Nessun modello trovato per questa categoria
ru: Шаблоны для этой категории не найдены
tr: Bu kategori için şablon bulunamadı
zh: 此类别未找到模板

source: Add Custom Product
ar: إضافة منتج مخصص
de: Benutzerdefiniertes Produkt hinzufügen
es: Añadir Producto Personalizado
fr: Ajouter un Produit Personnalisé
it: Aggiungi Prodotto Personalizzato
ru: Добавить пользовательский продукт
tr: Özel Ürün Ekle
zh: 添加自定义产品

# noProductsFoundForSearchCriteria
source: No products found matching your search criteria.
ar: لم يتم العثور على منتجات تطابق معايير البحث الخاصة بك.
de: Keine Produkte gefunden, die Ihren Suchkriterien entsprechen.
es: No se encontraron productos que coincidan con tus criterios de búsqueda.
fr: Aucun produit trouvé correspondant à vos critères de recherche.
it: Nessun prodotto trovato corrispondente ai criteri di ricerca.
ru: Не найдено продуктов, соответствующих вашему поиску.
tr: Arama kriterlerinize uygun ürün bulunamadı.
zh: 未找到匹配您搜索条件的 产品。

source: Add New Product
ar: إضافة منتج جديد
de: Neues Produkt hinzufügen
es: Añadir Nuevo Producto
fr: Ajouter un Nouveau Produit
it: Aggiungi Nuovo Prodotto
ru: Добавить новый продукт
tr: Yeni Ürün Ekle
zh: 添加新产品

source: Unnamed Product
ar: منتج غير مسمى
de: Unbenanntes Produkt
es: Producto sin Nombre
fr: Produit sans Nom
it: Prodotto Senza Nome
ru: Безымянный продукт
tr: İsimsiz Ürün
zh: 未命名产品

# productTypeRecipe
source: From Recipe
ar: من وصفة
de: Aus Rezept
es: Desde Receta
fr: À Partir de la Recette
it: Da Ricetta
ru: По рецепту
tr: Reçeteli
zh: 来自配方

# productTypeManual
source: Manual
ar: يدوي
de: Manuell
fr: Manuel
it: Manuale
ru: Вручную
tr: Manuel
zh: 手动

# priceLabel
source: Price
ar: السعر
de: Preis
es: Precio
fr: Prix
it: Prezzo
ru: Цена
tr: Fiyat
zh: 价格

source: Variants
ar: المتغيرات
de: Varianten
es: Variantes
fr: Variantes
it: Varianti
ru: Варианты
tr: Varyantlar
zh: 变体

# variantsAddedCount
source: {count} variants added
ar: تمت إضافة {count} متغير
de: {count} Varianten hinzugefügt
es: {count} variantes añadidas
fr: {count} variantes ajoutées
it: {count} varianti aggiunte
ru: Добавлено {count} вариант(а/ов)
tr: {count} varyant eklendi
zh: 已添加 {count} 个变体

source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить
tr: Ekle
zh: 添加

source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ru: Редактировать
tr: Düzenle
zh: 编辑

# menuItemVariantsDialogErrorLoadingVariants
source: Error loading variants: {error}
ar: خطأ في تحميل المتغيرات: {error}
de: Fehler beim Laden der Varianten: {error}
es: Error al cargar variantes: {error}
fr: Erreur lors du chargement des variantes : {error}
it: Errore caricamento varianti: {error}
ru: Ошибка загрузки вариантов: {error}
tr: Varyantlar yüklenirken hata: {error}
zh: 加载变体错误: {error}

# menuItemVariantsDialogQuickAddVariant
source: Quick Add Variant:
ar: إضافة متغير سريع:
de: Variante schnell hinzufügen:
es: Añadir Variante Rápida:
fr: Ajout Rapide de Variante :
it: Aggiunta Rapida Variante:
ru: Быстрое добавление варианта:
tr: Hızlı Varyant Ekle:
zh: 快速添加变体:

# menuItemVariantsDialogLoadingTemplates
source: Loading templates...
ar: جاري تحميل القوالب...
de: Vorlagen werden geladen...
es: Cargando plantillas...
fr: Chargement des modèles...
it: Caricamento modelli...
ru: Загрузка шаблонов...
tr: Şablonlar yükleniyor...
zh: 正在加载模板...

# menuItemVariantsDialogLimitReachedContent
source: You have reached your variant adding limit ({limit}). Upgrade your plan to add more variants.
ar: لقد وصلت إلى الحد الأقصى لإضافة المتغيرات ({limit}). قم بترقية باقتك لإضافة المزيد من المتغيرات.
de: Sie haben Ihr Varianten-Hinzufügungs-Limit ({limit}) erreicht. Upgraden Sie Ihren Plan, um weitere Varianten hinzuzufügen.
es: Has alcanzado tu límite de adición de variantes ({limit}). Mejora tu plan para añadir más variantes.
fr: Vous avez atteint votre limite d'ajout de variantes ({limit}). Mettez à niveau votre forfait pour ajouter plus de variantes.
it: Hai raggiunto il limite di aggiunta varianti ({limit}). Aggiorna il tuo piano per aggiungere più varianti.
ru: Вы достигли лимита на добавление вариантов ({limit}). Обновите свой план, чтобы добавить больше вариантов.
tr: Varyant ekleme limitinize ulaştınız ({limit}). Daha fazla varyant eklemek için planınızı yükseltin.
zh: 您已达到变体添加限制 ({limit})。请升级您的套餐以添加更多变体。

# menuItemVariantsDialogFirebaseUploadFailed
source: Firebase upload failed
ar: فشل تحميل Firebase
de: Firebase-Upload fehlgeschlagen
es: Error de subida a Firebase
fr: Échec du téléchargement Firebase
it: Caricamento Firebase fallito
ru: Не удалось загрузить в Firebase
tr: Firebase upload başarısız
zh: Firebase 上传失败

# menuItemVariantsDialogErrorUploadingPhoto
source: Error uploading photo: {error}
ar: خطأ في تحميل الصورة: {error}
de: Fehler beim Hochladen des Fotos: {error}
es: Error al subir foto: {error}
fr: Erreur lors du téléchargement de la photo : {error}
it: Errore caricamento foto: {error}
ru: Ошибка загрузки фото: {error}
tr: Fotoğraf yüklenirken hata: {error}
zh: 上传照片错误: {error}

# menuItemVariantsDialogVariantAddedSuccess
source: Variant "{variantName}" added successfully!
ar: تمت إضافة المتغير "{variantName}" بنجاح!
de: Variante "{variantName}" erfolgreich hinzugefügt!
es: ¡Variante "{variantName}" añadida con éxito!
fr: Variante "{variantName}" ajoutée avec succès !
it: Variante "{variantName}" aggiunta con successo!
ru: Вариант «{variantName}» успешно добавлен!
tr: "{variantName}" varyantı başarıyla eklendi!
zh: 变体“{variantName}”添加成功！

# menuItemVariantsDialogDeleteVariantTitle
source: Delete Variant
ar: حذف المتغير
de: Variante löschen
es: Eliminar Variante
fr: Supprimer la Variante
it: Elimina Variante
ru: Удалить вариант
tr: Varyant Sil
zh: 删除变体

# menuItemVariantsDialogDeleteVariantContent
source: Are you sure you want to delete the "{variantName}" variant?
ar: هل أنت متأكد أنك تريد حذف المتغير "{variantName}"؟
de: Sind Sie sicher, dass Sie die Variante "{variantName}" löschen möchten?
es: ¿Estás seguro de que quieres eliminar la variante "{variantName}"?
fr: Êtes-vous sûr de vouloir supprimer la variante "{variantName}" ?
it: Sei sicuro di voler eliminare la variante "{variantName}"?
ru: Вы уверены, что хотите удалить вариант «{variantName}»?
tr: "{variantName}" varyantını silmek istediğinizden emin misiniz?
zh: 您确定要删除变体“{variantName}”吗？

# menuItemVariantsDialogVariantDeletedSuccess
source: "{variantName}" variant deleted
ar: تم حذف المتغير "{variantName}"
de: Variante "{variantName}" gelöscht
es: Variante "{variantName}" eliminada
fr: Variante "{variantName}" supprimée
it: Variante "{variantName}" eliminata
ru: Вариант «{variantName}» удален
tr: "{variantName}" varyantı silindi
zh: 变体“{variantName}”已删除

# menuItemVariantsDialogErrorDeletingVariant
source: Error deleting variant: {error}
ar: خطأ في حذف المتغير: {error}
de: Fehler beim Löschen der Variante: {error}
es: Error al eliminar variante: {error}
fr: Erreur lors de la suppression de la variante : {error}
it: Errore eliminazione variante: {error}
ru: Ошибка удаления варианта: {error}
tr: Varyant silinirken hata: {error}
zh: 删除变体错误: {error}

# menuItemVariantsDialogUnnamedProduct
source: Unnamed Product
ar: منتج غير مسمى
de: Unbenanntes Produkt
es: Producto sin Nombre
fr: Produit sans Nom
it: Prodotto Senza Nome
ru: Безымянный продукт
tr: İsimsiz Ürün
zh: 未命名产品
