Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# errorUploadingPhotoGeneral
source: Firebase upload error: {error}
ar: خطأ في تحميل Firebase: {error}
de: Firebase-Upload-Fehler: {error}
es: Error de subida a Firebase: {error}
fr: Erreur de téléchargement Firebase : {error}
it: Errore caricamento Firebase: {error}
ru: Ошибка загрузки Firebase: {error}
tr: Firebase yükleme hatası: {error}
zh: Firebase上传错误: {error}

# errorLoadingCategories
source: Failed to load categories: {statusCode}
ar: فشل في تحميل الفئات: {statusCode}
de: Laden der Kategorien fehlgeschlagen: {statusCode}
es: Error al cargar categorías: {statusCode}
fr: Échec du chargement des catégories : {statusCode}
it: Impossibile caricare le categorie: {statusCode}
ru: Не удалось загрузить категории: {statusCode}
tr: Kategoriler yüklenemedi: {statusCode}
zh: 加载类别失败: {statusCode}

# errorLoadingCategoriesGeneral
source: Error while loading categories: {error}
ar: خطأ أثناء تحميل الفئات: {error}
de: Fehler beim Laden der Kategorien: {error}
es: Error al cargar categorías: {error}
fr: Erreur lors du chargement des catégories : {error}
it: Errore durante il caricamento delle categorie: {error}
ru: Ошибка при загрузке категорий: {error}
tr: Kategoriler yüklenirken hata: {error}
zh: 加载类别时出错: {error}

# errorMenuItemGeneral
source: Error during operation: {statusCode} - {details}
ar: خطأ أثناء العملية: {statusCode} - {details}
de: Fehler während des Vorgangs: {statusCode} - {details}
es: Error durante la operación: {statusCode} - {details}
fr: Erreur pendant l'opération : {statusCode} - {details}
it: Errore durante l'operazione: {statusCode} - {details}
ru: Ошибка во время операции: {statusCode} - {details}
tr: İşlem sırasında hata: {statusCode} - {details}
zh: 操作期间出错: {statusCode} - {details}

# errorMenuItemApi
source: API request error: {error}
ar: خطأ في طلب API: {error}
de: API-Anfragefehler: {error}
es: Error de solicitud API: {error}
fr: Erreur de requête API : {error}
it: Errore richiesta API: {error}
ru: Ошибка запроса API: {error}
tr: API isteği hatası: {error}
zh: API请求错误: {error}

# manageVariantPageTitle
source: Product Variant Management
ar: إدارة متغيرات المنتج
de: Produktvarianten-Verwaltung
es: Gestión de Variantes de Producto
fr: Gestion des Variantes de Produit
it: Gestione Variante Prodotto
ru: Управление вариантами продукта
tr: Ürün Varyant Yönetimi
zh: 产品变体管理

# errorFetchingVariants
source: An error occurred while fetching variants: {statusCode}
ar: حدث خطأ أثناء جلب المتغيرات: {statusCode}
de: Ein Fehler ist beim Abrufen der Varianten aufgetreten: {statusCode}
es: Ocurrió un error al obtener variantes: {statusCode}
fr: Une erreur s'est produite lors de la récupération des variantes : {statusCode}
it: Si è verificato un errore durante il recupero delle varianti: {statusCode}
ru: Произошла ошибка при получении вариантов: {statusCode}
tr: Varyantlar alınırken hata oluştu: {statusCode}
zh: 获取变体时发生错误: {statusCode}

# errorFetchingVariantsGeneral
source: Error fetching variants: {error}
ar: خطأ في جلب المتغيرات: {error}
de: Fehler beim Abrufen der Varianten: {error}
es: Error al obtener variantes: {error}
fr: Erreur lors de la récupération des variantes : {error}
it: Errore recupero varianti: {error}
ru: Ошибка получения вариантов: {error}
tr: Varyantları çekerken hata: {error}
zh: 获取变体错误: {error}

# variantPhotoNotSelected
source: Photo not selected.
ar: لم يتم تحديد صورة.
de: Foto nicht ausgewählt.
es: Foto no seleccionada.
fr: Photo non sélectionnée.
it: Foto non selezionata.
ru: Фото не выбрано.
tr: Fotoğraf seçilmedi.
zh: 未选择照片。

# infoVariantAddedSuccess
source: Variant added successfully!
ar: تمت إضافة المتغير بنجاح!
de: Variante erfolgreich hinzugefügt!
es: ¡Variante añadida con éxito!
fr: Variante ajoutée avec succès !
it: Variante aggiunta con successo!
ru: Вариант успешно добавлен!
tr: Varyant başarıyla eklendi!
zh: 变体添加成功！

# errorAddingVariant
source: Error while adding variant: {statusCode} - {details}
ar: خطأ أثناء إضافة المتغير: {statusCode} - {details}
de: Fehler beim Hinzufügen der Variante: {statusCode} - {details}
es: Error al añadir variante: {statusCode} - {details}
fr: Erreur lors de l'ajout de la variante : {statusCode} - {details}
it: Errore durante l'aggiunta della variante: {statusCode} - {details}
ru: Ошибка при добавлении варианта: {statusCode} - {details}
tr: Varyant eklenirken hata: {statusCode} - {details}
zh: 添加变体时出错: {statusCode} - {details}

# errorAddingVariantGeneral
source: Error during API request: {error}
ar: خطأ أثناء طلب API: {error}
de: Fehler während der API-Anfrage: {error}
es: Error durante la solicitud API: {error}
fr: Erreur lors de la requête API : {error}
it: Errore durante la richiesta API: {error}
ru: Ошибка во время запроса API: {error}
tr: API isteği sırasında hata: {error}
zh: API请求期间出错: {error}

# dialogDeleteVariantTitle
source: Delete Variant
ar: حذف المتغير
de: Variante löschen
es: Eliminar Variante
fr: Supprimer la Variante
it: Elimina Variante
ru: Удалить вариант
tr: Varyantı Sil
zh: 删除变体

# infoVariantDeletedSuccess
source: Variant deleted successfully.
ar: تم حذف المتغير بنجاح.
de: Variante erfolgreich gelöscht.
es: Variante eliminada con éxito.
fr: Variante supprimée avec succès.
it: Variante eliminata con successo.
ru: Вариант успешно удален.
tr: Varyant başarıyla silindi.
zh: 变体删除成功。

# errorDeletingVariant
source: Error while deleting variant: {statusCode} - {details}
ar: خطأ أثناء حذف المتغير: {statusCode} - {details}
de: Fehler beim Löschen der Variante: {statusCode} - {details}
es: Error al eliminar variante: {statusCode} - {details}
fr: Erreur lors de la suppression de la variante : {statusCode} - {details}
it: Errore durante l'eliminazione della variante: {statusCode} - {details}
ru: Ошибка при удалении варианта: {statusCode} - {details}
tr: Varyant silinirken hata: {statusCode} - {details}
zh: 删除变体时出错: {statusCode} - {details}

# errorDeletingVariantGeneral
source: Variant deletion error: {error}
ar: خطأ في حذف المتغير: {error}
de: Fehler beim Löschen der Variante: {error}
es: Error al eliminar variante: {error}
fr: Erreur de suppression de la variante : {error}
it: Errore eliminazione variante: {error}
ru: Ошибка удаления варианта: {error}
tr: Varyant silme hatası: {error}
zh: 变体删除错误: {error}

# variantNameLabel
source: Variant Name (e.g., Large)
ar: اسم المتغير (مثال: كبير)
de: Variantenname (z. B. Groß)
es: Nombre de la Variante (ej. Grande)
fr: Nom de la Variante (ex: Grand)
it: Nome Variante (es. Grande)
ru: Название варианта (например, Большой)
tr: Varyant Adı (örn: Büyük)
zh: 变体名称 (例如: 大份)

# variantNameValidator
source: Please enter the variant name
ar: الرجاء إدخال اسم المتغير
de: Bitte geben Sie den Variantennamen ein
es: Por favor, introduce el nombre de la variante
fr: Veuillez saisir le nom de la variante
it: Per favore, inserisci il nome della variante
ru: Пожалуйста, введите название варианта
tr: Lütfen varyant adını girin
zh: 请输入变体名称

# variantPriceLabel
source: Price*
ar: السعر*
de: Preis*
es: Precio*
fr: Prix*
it: Prezzo*
ru: Цена*
tr: Fiyatı*
zh: 价格*

# variantPriceValidator
source: Price is required.
ar: السعر مطلوب.
de: Preis ist erforderlich.
es: El precio es obligatorio.
fr: Le prix est requis.
it: Il prezzo è obbligatorio.
ru: Цена обязательна.
tr: Fiyat gerekli.
zh: 价格为必填项。

# variantPriceValidatorInvalid
source: Please enter a valid price.
ar: الرجاء إدخال سعر صالح.
de: Bitte geben Sie einen gültigen Preis ein.
es: Por favor, introduce un precio válido.
fr: Veuillez saisir un prix valide.
it: Per favore, inserisci un prezzo valido.
ru: Пожалуйста, введите действительную цену.
tr: Geçerli bir fiyat girin.
zh: 请输入有效的价格。

# variantIsExtraLabel
source: Is it an extra option?
ar: هل هو خيار إضافي؟
de: Ist es eine zusätzliche Option?
es: ¿Es una opción extra?
fr: Est-ce une option supplémentaire ?
it: È un'opzione extra?
ru: Это дополнительная опция?
tr: Ekstra Seçenek Mi?
zh: 这是附加选项吗？

# buttonSelectPhoto
source: Select Photo
ar: تحديد صورة
de: Foto auswählen
es: Seleccionar Foto
fr: Sélectionner la Photo
it: Seleziona Foto
ru: Выбрать фото
tr: Fotoğraf Seç
zh: 选择照片

# buttonAddVariant
source: Add Variant
ar: إضافة متغير
de: Variante hinzufügen
es: Añadir Variante
fr: Ajouter la Variante
it: Aggiungi Variante
ru: Добавить вариант
tr: Varyant Ekle
zh: 添加变体

# currentVariantsTitle
source: Current Variants
ar: المتغيرات الحالية
de: Aktuelle Varianten
es: Variantes Actuales
fr: Variantes Actuelles
it: Varianti Attuali
ru: Текущие варианты
tr: Mevcut Varyantlar
zh: 当前变体

# noVariantsAdded
source: No variants have been added for this product yet.
ar: لم تتم إضافة أي متغيرات لهذا المنتج بعد.
de: Für dieses Produkt wurden noch keine Varianten hinzugefügt.
es: Aún no se han añadido variantes para este producto.
fr: Aucune variante n'a été ajoutée pour ce produit pour le moment.
it: Nessuna variante è stata ancora aggiunta per questo prodotto.
ru: Для этого продукта варианты еще не добавлены.
tr: Bu ürün için henüz varyant eklenmemiş.
zh: 此产品尚未添加任何变体。

# variantExtraSuffix
source: (Extra)
ar: (إضافي)
ru: (Дополнительно)
tr: (Ekstra)
zh: (附加项)

# editVariantPageTitle
source: Edit Variant
ar: تعديل المتغير
de: Variante bearbeiten
es: Editar Variante
fr: Modifier la Variante
it: Modifica Variante
ru: Редактировать вариант
tr: Varyant Düzenle
zh: 编辑变体

# variantPhotoNotUploaded
source: Photo not uploaded.
ar: لم يتم تحميل الصورة.
de: Foto nicht hochgeladen.
es: Foto no subida.
fr: Photo non téléchargée.
it: Foto non caricata.
ru: Фото не загружено.
tr: Fotoğraf yüklenmemiş.
zh: 照片未上传。

# buttonChangePhoto
source: Change Photo
ar: تغيير الصورة
de: Foto ändern
es: Cambiar Foto
fr: Changer la Photo
it: Cambia Foto
ru: Изменить фото
tr: Fotoğraf Değiştir
zh: 更改照片

# infoVariantUpdatedSuccess
source: Variant updated successfully!
ar: تم تحديث المتغير بنجاح!
de: Variante erfolgreich aktualisiert!
es: ¡Variante actualizada con éxito!
fr: Variante mise à jour avec succès !
it: Variante aggiornata con successo!
ru: Вариант успешно обновлен!
tr: Varyant başarıyla güncellendi!
zh: 变体更新成功！

# errorUpdatingVariant
source: Error while updating variant: {statusCode} - {details}
ar: خطأ أثناء تحديث المتغير: {statusCode} - {details}
de: Fehler beim Aktualisieren der Variante: {statusCode} - {details}
es: Error al actualizar variante: {statusCode} - {details}
fr: Erreur lors de la mise à jour de la variante : {statusCode} - {details}
it: Errore durante l'aggiornamento della variante: {statusCode} - {details}
ru: Ошибка при обновлении варианта: {statusCode} - {details}
tr: Varyant güncellenirken hata: {statusCode} - {details}
zh: 更新变体时出错: {statusCode} - {details}

# errorUpdatingVariantGeneral
source: Error during API request: {error}
ar: خطأ أثناء طلب API: {error}
de: Fehler während der API-Anfrage: {error}
es: Error durante la solicitud API: {error}
fr: Erreur lors de la requête API : {error}
it: Errore durante la richiesta API: {error}
ru: Ошибка во время запроса API: {error}
tr: API isteği sırasında hata: {error}
zh: API请求期间出错: {error}

# homePageTitleBusinessOwner
source: Business Dashboard
ar: لوحة تحكم العمل
de: Geschäfts-Dashboard
es: Panel de Control del Negocio
fr: Tableau de Bord de l'Entreprise
it: Dashboard Attività
ru: Панель управления бизнесом
tr: İşletme Paneli
zh: 商家仪表板

# homePageTitleStaff
source: Staff Dashboard
ar: لوحة تحكم الموظفين
de: Personal-Dashboard
es: Panel de Control del Personal
fr: Tableau de Bord du Personnel
it: Dashboard Staff
ru: Панель управления персонала
tr: Personel Paneli
zh: 员工仪表板

# homePageTitleKitchenStaff
source: Kitchen Dashboard
ar: لوحة تحكم المطبخ
de: Küchen-Dashboard
es: Panel de Control de Cocina
fr: Tableau de Bord de la Cuisine
it: Dashboard Cucina
ru: Панель управления кухни
tr: Mutfak Paneli
zh: 厨房仪表板

# homeTabLabel
source: Home
ar: الرئيسية
de: Startseite
es: Inicio
fr: Accueil
ru: Главная
tr: Ana Sayfa
zh: 首页

# tableTabLabel
source: Tables
ar: الطاولات
de: Tische
es: Mesas
it: Tavoli
ru: Столы
tr: Masa
zh: 桌位

# takeawayTabLabel
source: Takeaway
ar: السفري
de: Außer Haus
es: Para Llevar
fr: À Emporter
it: Asporto
ru: На вынос
tr: Paket
zh: 外卖

# kitchenTabLabel
source: Kitchen
ar: المطبخ
de: Küche
es: Cocina
fr: Cuisine
it: Cucina
ru: Кухня
tr: Mutfak
zh: 厨房

# kdsSetupTabLabel
source: KDS Setup
ar: إعداد KDS
de: KDS-Einrichtung
es: Configuración KDS
fr: Configuration KDS
it: Configurazione KDS
ru: Настройка KDS
tr: KDS Kur
zh: KDS设置

# notificationsTabLabel
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
es: Notificaciones
it: Notifiche
ru: Уведомления
tr: Bildirimler
zh: 通知

# tooltipGoToHome
source: Go to Home
ar: الانتقال إلى الرئيسية
de: Zur Startseite
es: Ir a Inicio
fr: Aller à l'Accueil
it: Vai a Home
ru: Перейти на главную
tr: Ana Sayfa'ya Git
zh: 前往首页

# infoKdsScreensLoading
source: Loading KDS screens, please wait...
ar: جاري تحميل شاشات KDS، يرجى الانتظار...
de: KDS-Bildschirme werden geladen, bitte warten Sie...
es: Cargando pantallas KDS, por favor, espera...
fr: Chargement des écrans KDS, veuillez patienter...
it: Caricamento schermi KDS, attendere prego...
ru: Загрузка экранов KDS, пожалуйста, подождите...
tr: KDS ekranları yükleniyor, lütfen bekleyin...
zh: 正在加载KDS屏幕，请稍候...

# infoCreateKdsScreenFirst
source: Please create a KDS screen first. You are being redirected to the management page.
ar: الرجاء إنشاء شاشة KDS أولاً. سيتم توجيهك إلى صفحة الإدارة.
de: Bitte erstellen Sie zuerst einen KDS-Bildschirm. Sie werden zur Verwaltungsseite weitergeleitet.
es: Por favor, crea una pantalla KDS primero. Estás siendo redirigido a la página de gestión.
fr: Veuillez d'abord créer un écran KDS. Vous allez être redirigé vers la page de gestion.
it: Per favore, crea prima uno schermo KDS. Stai per essere reindirizzato alla pagina di gestione.
ru: Пожалуйста, сначала создайте экран KDS. Вы будете перенаправлены на страницу управления.
tr: Önce KDS ekranı oluşturun. Yönetim sayfasına yönlendiriliyorsunuz.
zh: 请先创建一个KDS屏幕。您将被重定向到管理页面。

# infoNoActiveKdsAvailable
source: No active KDS screens are accessible to you.
ar: لا توجد شاشات KDS نشطة متاحة لك.
de: Für Sie sind keine aktiven KDS-Bildschirme zugänglich.
es: No tienes acceso a pantallas KDS activas.
fr: Aucun écran KDS actif n'est accessible pour vous.
it: Nessuno schermo KDS attivo è accessibile per te.
ru: Для вас нет доступных активных экранов KDS.
tr: Erişebileceğiniz aktif bir KDS ekranı bulunmuyor.
zh: 您无法访问任何活跃的KDS屏幕。

# dialogSelectKdsScreenTitle
source: Select KDS Screen
ar: تحديد شاشة KDS
de: KDS-Bildschirm auswählen
es: Seleccionar Pantalla KDS
fr: Sélectionner l'Écran KDS
it: Seleziona Schermo KDS
ru: Выбрать экран KDS
tr: KDS Ekranı Seçin
zh: 选择KDS屏幕

# infoKdsSelectionPending
source: Awaiting KDS selection for kitchen tab...
ar: في انتظار تحديد شاشة KDS لعلامة تبويب المطبخ...
de: Warten auf KDS-Auswahl für den Küchen-Tab...
es: Esperando selección de KDS para la pestaña de cocina...
fr: En attente de la sélection KDS pour l'onglet cuisine...
it: In attesa di selezione KDS per la scheda cucina...
ru: Ожидание выбора KDS для вкладки «Кухня»...
tr: Mutfak sekmesi için KDS seçimi bekleniyor...
zh: 正在等待厨房标签页的KDS选择...

# buttonCreateKdsScreen
source: Create KDS Screen
ar: إنشاء شاشة KDS
de: KDS-Bildschirm erstellen
es: Crear Pantalla KDS
fr: Créer un Écran KDS
it: Crea Schermo KDS
ru: Создать экран KDS
tr: KDS Ekranı Oluştur
zh: 创建KDS屏幕

# infoContentLoading
source: Content is loading or you do not have access.
ar: جاري تحميل المحتوى أو ليس لديك حق الوصول.
de: Inhalt wird geladen oder Sie haben keinen Zugriff.
es: El contenido se está cargando o no tienes acceso.
fr: Le contenu est en cours de chargement ou vous n'avez pas accès.
it: Il contenuto è in caricamento o non hai accesso.
ru: Контент загружается или у вас нет доступа.
tr: İçerik yükleniyor veya erişim yok.
zh: 内容正在加载，或者您没有访问权限。

# pendingOrdersPageTitle
source: Unpaid Orders
ar: الطلبات غير المدفوعة
de: Unbezahlte Bestellungen
es: Pedidos Pendientes de Pago
fr: Commandes Impayées
it: Ordini Non Pagati
ru: Неоплаченные заказы
tr: Ödenmemiş Siparişler
zh: 未支付订单

# errorFetchingPendingOrders
source: An error occurred while fetching orders.
ar: حدث خطأ أثناء جلب الطلبات.
de: Ein Fehler ist beim Abrufen der Bestellungen aufgetreten.
es: Ocurrió un error al obtener pedidos.
fr: Une erreur s'est produite lors de la récupération des commandes.
it: Si è verificato un errore durante il recupero degli ordini.
ru: Произошла ошибка при получении заказов.
tr: Siparişler alınırken bir hata oluştu.
zh: 获取订单时发生错误。

# noPendingOrdersFound
source: No unpaid orders found.
ar: لم يتم العثور على طلبات غير مدفوعة.
de: Keine unbezahlten Bestellungen gefunden.
es: No se encontraron pedidos pendientes de pago.
fr: Aucune commande impayée trouvée.
it: Nessun ordine non pagato trovato.
ru: Не найдено неоплаченных заказов.
tr: Ödenmemiş sipariş bulunamadı.
zh: 未找到未支付订单。

# pendingOrderCardTitleTable
source: Table {tableNumber}
ar: طاولة {tableNumber}
de: Tisch {tableNumber}
es: Mesa {tableNumber}
it: Tavolo {tableNumber}
ru: Стол {tableNumber}
tr: Masa {tableNumber}
zh: 桌位 {tableNumber}

# pendingOrderCardTitleTakeaway
source: Takeaway Order
ar: طلب سفري
de: Außer-Haus-Bestellung
es: Pedido para Llevar
fr: Commande à Emporter
it: Ordine da Asporto
ru: Заказ на вынос
tr: Paket Sipariş
zh: 外卖订单

# editOrderTitleDetails
source: Order Details
ar: تفاصيل الطلب
de: Bestelldetails
es: Detalles del Pedido
fr: Détails de la Commande
it: Dettagli Ordine
ru: Детали заказа
tr: Sipariş Detayları
zh: 订单详情

# editOrderTitleTakeaway
source: Takeaway Order - {customerName}
ar: طلب سفري - {customerName}
de: Außer-Haus-Bestellung - {customerName}
es: Pedido para Llevar - {customerName}
fr: Commande à Emporter - {customerName}
it: Ordine da Asporto - {customerName}
ru: Заказ на вынос - {customerName}
tr: Paket Sipariş - {customerName}
zh: 外卖订单 - {customerName}

# editOrderTitleTable
source: Table {tableNumber}
ar: طاولة {tableNumber}
de: Tisch {tableNumber}
es: Mesa {tableNumber}
it: Tavolo {tableNumber}
ru: Стол {tableNumber}
tr: Masa {tableNumber}
zh: 桌位 {tableNumber}

# editOrderStatusCreditUnpaid
source: (Credit - Unpaid)
ar: (آجل - غير مدفوع)
de: (Kredit - Unbezahlt)
es: (Crédito - Impagado)
fr: (Crédit - Impayé)
it: (Credito - Non Pagato)
ru: (Кредит - Неоплачено)
tr: (Veresiye - Ödenmedi)
zh: (赊账 - 未支付)

# editOrderStatusCreditPaid
source: (Credit - Paid)
ar: (آجل - مدفوع)
de: (Kredit - Bezahlt)
es: (Crédito - Pagado)
fr: (Crédit - Payé)
it: (Credito - Pagato)
ru: (Кредит - Оплачено)
tr: (Veresiye - Ödendi)
zh: (赊账 - 已支付)

# editOrderPagerAssigned
source: Assigned Pager: {pagerInfo}
ar: جهاز النداء المعيّن: {pagerInfo}
de: Zugewiesener Pager: {pagerInfo}
es: Localizador Asignado: {pagerInfo}
fr: Biper Assigné : {pagerInfo}
it: Pager Assegnato: {pagerInfo}
ru: Назначен пейджер: {pagerInfo}
tr: Atanmış Cihaz: {pagerInfo}
zh: 已分配传呼机: {pagerInfo}

# editOrderPagerNotAssigned
source: Pager Not Assigned
ar: لم يتم تعيين جهاز نداء
de: Pager nicht zugewiesen
es: Localizador No Asignado
fr: Biper Non Assigné
it: Pager Non Assegnato
ru: Пейджер не назначен
tr: Çağrı Cihazı Atanmamış
zh: 未分配传呼机

# buttonChange
source: Change
ar: تغيير
de: Ändern
es: Cambiar
fr: Changer
it: Cambia
ru: Изменить
tr: Değiştir
zh: 更改

# buttonAssign
source: Assign
ar: تعيين
de: Zuweisen
es: Asignar
fr: Assigner
it: Assegna
ru: Назначить
tr: Ata
zh: 分配

# editOrderCreditNote
source: Credit Note: {note}
ar: ملاحظة آجلة: {note}
de: Kreditnotiz: {note}
es: Nota de Crédito: {note}
fr: Note de Crédit : {note}
it: Nota di Credito: {note}
ru: Кредитная запись: {note}
tr: Veresiye Notu: {note}
zh: 赊账备注: {note}

# editOrderTooltipAddProduct
source: Add New Product
ar: إضافة منتج جديد
de: Neues Produkt hinzufügen
es: Añadir Nuevo Producto
fr: Ajouter un Nouveau Produit
it: Aggiungi Nuovo Prodotto
ru: Добавить новый продукт
tr: Yeni Ürün Ekle
zh: 添加新产品

# editOrderButtonCloseCreditPayment
source: Close Credit Payment
ar: إنهاء الدفع الآجل
de: Kredit-Zahlung abschließen
es: Cerrar Pago a Crédito
fr: Clôturer le Paiement à Crédit
it: Chiudi Pagamento a Credito
ru: Закрыть оплату по кредиту
tr: Veresiye Ödemesini Kapat
zh: 关闭赊账支付

# editOrderStatusCreditPaymentReceived
source: CREDIT PAYMENT RECEIVED
ar: تم استلام الدفع الآجل
de: KREDIT-ZAHLUNG ERHALTEN
es: PAGO A CRÉDITO RECIBIDO
fr: PAIEMENT À CRÉDIT REÇU
it: PAGAMENTO A CREDITO RICEVUTO
ru: ПОЛУЧЕН КРЕДИТНЫЙ ПЛАТЕЖ
tr: VERESİYE ÖDEMESİ ALINDI
zh: 赊账支付已接收

# scheduleTitle
source: Roster Planning
ar: تخطيط المناوبات
de: Dienstplan-Planung
es: Planificación de Turnos
fr: Planification des Horaires
it: Pianificazione Turni
ru: Планирование расписания
tr: Rota Planlama
zh: 排班计划

# scheduleErrorLoadingData
source: Error loading data: {error}
ar: خطأ في تحميل البيانات: {error}
de: Fehler beim Laden der Daten: {error}
es: Error al cargar datos: {error}
fr: Erreur de chargement des données : {error}
it: Errore caricamento dati: {error}
ru: Ошибка загрузки данных: {error}
tr: Veriler yüklenirken hata: {error}
zh: 加载数据错误: {error}

# scheduleErrorFetchingShifts
source: Error fetching shifts: {error}
ar: خطأ في جلب المناوبات: {error}
de: Fehler beim Abrufen der Schichten: {error}
es: Error al obtener turnos: {error}
fr: Erreur de récupération des quarts : {error}
it: Errore recupero turni: {error}
ru: Ошибка получения смен: {error}
tr: Vardiyalar çekilirken hata: {error}
zh: 获取班次错误: {error}

# scheduleErrorCreateShiftTemplateFirst
source: Please create a shift template first.
ar: الرجاء إنشاء قالب مناوبة أولاً.
de: Bitte erstellen Sie zuerst eine Schichtvorlage.
es: Por favor, crea una plantilla de turno primero.
fr: Veuillez d'abord créer un modèle de quart.
it: Per favore, crea prima un modello di turno.
ru: Пожалуйста, сначала создайте шаблон смены.
tr: Lütfen önce vardiya şablonu oluşturun.
zh: 请先创建一个班次模板。

# scheduleTitleAssignShiftForDate
source: Assign Shift for {date}
ar: تعيين مناوبة لتاريخ {date}
de: Schicht für {date} zuweisen
es: Asignar Turno para {date}
fr: Assigner un Quart pour le {date}
it: Assegna Turno per {date}
ru: Назначить смену на {date}
tr: {date} Günü Vardiya Ata
zh: 为 {date} 分配班次

# scheduleErrorNoStaffToAssign
source: No staff members to assign found.
ar: لم يتم العثور على موظفين لتعيينهم.
de: Keine zuzuweisenden Personalmitglieder gefunden.
es: No se encontró personal para asignar.
fr: Aucun membre du personnel à assigner trouvé.
it: Nessun membro staff da assegnare trovato.
ru: Не найдено сотрудников для назначения.
tr: Atanacak personel bulunamadı.
zh: 未找到可分配的员工。

# scheduleStatusNoShiftAssigned
source: No Shift Assigned
ar: لم يتم تعيين مناوبة
de: Keine Schicht zugewiesen
es: Ningún Turno Asignado
fr: Aucun Quart Assigné
it: Nessun Turno Assegnato
ru: Смена не назначена
tr: Vardiya Atanmamış
zh: 未分配班次

# scheduleTooltipRemoveShift
source: Remove Shift
ar: إزالة المناوبة
de: Schicht entfernen
es: Eliminar Turno
fr: Supprimer le Quart
it: Rimuovi Turno
ru: Удалить смену
tr: Vardiyayı Kaldır
zh: 移除班次

# scheduleHintSelect
source: Select...
ar: حدد...
de: Auswählen...
es: Seleccionar...
fr: Sélectionner...
it: Seleziona...
ru: Выбрать...
tr: Seç...
zh: 选择...

# scheduleErrorSelectAtLeastOneDay
source: Please select at least one day from the calendar.
ar: الرجاء تحديد يوم واحد على الأقل من التقويم.
de: Bitte wählen Sie mindestens einen Tag aus dem Kalender aus.
es: Por favor, selecciona al menos un día del calendario.
fr: Veuillez sélectionner au moins un jour dans le calendrier.
it: Per favore, seleziona almeno un giorno dal calendario.
ru: Пожалуйста, выберите хотя бы один день в календаре.
tr: Lütfen takvimden en az bir gün seçin.
zh: 请从日历中至少选择一天。

# scheduleSuccessMultiDayAssignment
source: Assignment made for {count} days.
ar: تم التعيين لـ {count} أيام.
de: Zuweisung für {count} Tage erfolgt.
es: Asignación realizada para {count} días.
fr: Assignation effectuée pour {count} jours.
it: Assegnazione effettuata per {count} giorni.
ru: Назначение выполнено на {count} дней.
tr: {count} gün için atama yapıldı.
zh: 已为 {count} 天分配。
