Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# manageTablesInfoGuestLinkCopied
source: Guest QR link copied to clipboard.
ar: تم نسخ رابط QR للضيف إلى الحافظة.
de: Gast-QR-Link in die Zwischenablage kopiert.
es: Enlace QR para invitados copiado al portapapeles.
fr: Lien QR invité copié dans le presse-papiers.
it: Link QR ospite copiato negli appunti.
ru: Гостевая QR-ссылка скопирована в буфер обмена.
tr: Misafir QR linki panoya kopyalandı.
zh: 客人二维码链接已复制到剪贴板。

# manageTablesErrorNoGuestLink
source: No valid guest link found for this table.
ar: لم يتم العثور على رابط ضيف صالح لهذه الطاولة.
de: Kein gültiger Gast-Link für diesen Tisch gefunden.
es: No se encontró un enlace de invitado válido para esta mesa.
fr: Aucun lien invité valide trouvé pour cette table.
it: Nessun link ospite valido trovato per questo tavolo.
ru: Не найдена действительная гостевая ссылка для этого стола.
tr: Bu masa için geçerli bir misafir linki bulunamadı.
zh: 此桌位未找到有效的客人链接。

# manageTablesDialogQrTitle
source: Table {tableNumber} QR Code
ar: رمز QR للطاولة {tableNumber}
de: Tisch {tableNumber} QR-Code
es: Código QR de la Mesa {tableNumber}
fr: Code QR de la Table {tableNumber}
it: Codice QR Tavolo {tableNumber}
ru: QR-код стола {tableNumber}
tr: Masa {tableNumber} QR Kodu
zh: 桌位 {tableNumber} 二维码

# manageTablesErrorCreatingQr
source: An error occurred while generating the QR Code.
ar: حدث خطأ أثناء إنشاء رمز QR.
de: Beim Generieren des QR-Codes ist ein Fehler aufgetreten.
es: Ocurrió un error al generar el Código QR.
fr: Une erreur s'est produite lors de la génération du Code QR.
it: Si è verificato un errore durante la generazione del Codice QR.
ru: Произошла ошибка при создании QR-кода.
tr: QR Kod oluşturulurken hata oluştu.
zh: 生成二维码时发生错误。

# manageTablesTooltipAdd
source: Add New Table
ar: إضافة طاولة جديدة
de: Neuen Tisch hinzufügen
es: Añadir Nueva Mesa
fr: Ajouter une Nouvelle Table
it: Aggiungi Nuovo Tavolo
ru: Добавить новый стол
tr: Yeni Masa Ekle
zh: 添加新桌位

# manageTablesNoTablesFound
source: No tables have been added yet. Use the '+' button to add a new table.
ar: لم تتم إضافة أي طاولات بعد. استخدم زر '+' لإضافة طاولة جديدة.
de: Es wurden noch keine Tische hinzugefügt. Verwenden Sie die Schaltfläche '+' um einen neuen Tisch hinzuzufügen.
es: Aún no se han añadido mesas. Usa el botón '+' para añadir una nueva mesa.
fr: Aucune table n'a été ajoutée pour le moment. Utilisez le bouton '+' pour ajouter une nouvelle table.
it: Nessun tavolo è stato ancora aggiunto. Usa il pulsante '+' per aggiungere un nuovo tavolo.
ru: Столы еще не добавлены. Используйте кнопку '+' для добавления нового стола.
tr: Henüz masa eklenmemiş. Yeni masa eklemek için '+' butonunu kullanın.
zh: 尚未添加任何桌位。 使用“+”按钮添加新桌位。

# manageTablesCardTitle
source: Table {tableNumber}
ar: طاولة {tableNumber}
de: Tisch {tableNumber}
es: Mesa {tableNumber}
it: Tavolo {tableNumber}
ru: Стол {tableNumber}
tr: Masa {tableNumber}
zh: 桌位 {tableNumber}

# manageTablesCardGuestLink
source: Guest Link:
ar: رابط الضيف:
de: Gast-Link:
es: Enlace de Invitado:
fr: Lien Invité :
it: Link Ospite:
ru: Гостевая ссылка:
tr: Misafir Linki:
zh: 客人链接:

# manageTablesTooltipCopyLink
source: Copy Link
ar: نسخ الرابط
de: Link kopieren
es: Copiar Enlace
fr: Copier le Lien
it: Copia Link
ru: Копировать ссылку
tr: Linki Kopyala
zh: 复制链接

# manageTablesTooltipShowQr
source: Show QR Code
ar: عرض رمز QR
de: QR-Code anzeigen
es: Mostrar Código QR
fr: Afficher le Code QR
it: Mostra Codice QR
ru: Показать QR-код
tr: QR Kodu Göster
zh: 显示二维码

# notificationsPageTitle
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
es: Notificaciones
it: Notifiche
ru: Уведомления
tr: Bildirimler
zh: 通知

# connectionStatusWaiting
source: Awaiting connection status...
ar: في انتظار حالة الاتصال...
de: Warten auf Verbindungsstatus...
es: Esperando estado de conexión...
fr: En attente du statut de connexion...
it: In attesa di stato connessione...
ru: Ожидание статуса подключения...
tr: Bağlantı durumu bekleniyor...
zh: 正在等待连接状态...

# connectionStatusConnected
source: Connected to the notification server.
ar: متصل بخادم الإشعارات.
de: Mit dem Benachrichtigungsserver verbunden.
es: Conectado al servidor de notificaciones.
fr: Connecté au serveur de notification.
it: Connesso al server di notifica.
ru: Подключено к серверу уведомлений.
tr: Bildirim sunucusuna bağlı.
zh: 已连接到通知服务器。

# connectionStatusConnectingOrDisconnected
source: Connecting to notification server or disconnected.
ar: جاري الاتصال بخادم الإشعارات أو غير متصل.
de: Verbindung zum Benachrichtigungsserver wird hergestellt oder getrennt.
es: Conectando al servidor de notificaciones o desconectado.
fr: Connexion au serveur de notification en cours ou déconnecté.
it: Connessione al server di notifica o disconnesso.
ru: Подключение к серверу уведомлений или отключено.
tr: Bildirim sunucusuna bağlanılıyor veya bağlantı yok.
zh: 正在连接到通知服务器或已断开连接。

# connectionStatusSocketError
source: Failed to provide Socket.IO instance.
ar: فشل في توفير مثيل Socket.IO.
de: Socket.IO-Instanz konnte nicht bereitgestellt werden.
es: Error al proporcionar instancia de Socket.IO.
fr: Échec de la fourniture de l'instance Socket.IO.
it: Impossibile fornire l'istanza di Socket.IO.
ru: Не удалось предоставить экземпляр Socket.IO.
tr: Socket.IO örneği sağlanamadı.
zh: 无法提供 Socket.IO 实例。

# notificationConnected
source: Successfully connected to the notification server.
ar: تم الاتصال بنجاح بخادم الإشعارات.
de: Erfolgreich mit dem Benachrichtigungsserver verbunden.
es: Conectado con éxito al servidor de notificaciones.
fr: Connexion réussie au serveur de notification.
it: Connesso con successo al server di notifica.
ru: Успешно подключено к серверу уведомлений.
tr: Bildirim sunucusuna başarıyla bağlandı.
zh: 成功连接到通知服务器。

# notificationDisconnected
source: Disconnected from the notification server.
ar: تم قطع الاتصال بخادم الإشعارات.
de: Vom Benachrichtigungsserver getrennt.
es: Desconectado del servidor de notificaciones.
fr: Déconnecté du serveur de notification.
it: Disconnesso dal server di notifica.
ru: Отключено от сервера уведомлений.
tr: Bildirim sunucusuyla bağlantı koptu.
zh: 与通知服务器断开连接。

# notificationConnectionError
source: An error occurred while connecting to the notification server.
ar: حدث خطأ أثناء الاتصال بخادم الإشعارات.
de: Ein Fehler ist bei der Verbindung zum Benachrichtigungsserver aufgetreten.
es: Ocurrió un error al conectar con el servidor de notificaciones.
fr: Une erreur s'est produite lors de la connexion au serveur de notification.
it: Si è verificato un errore durante la connessione al server di notifica.
ru: Произошла ошибка при подключении к серверу уведомлений.
tr: Bildirim sunucusuna bağlanırken hata oluştu.
zh: 连接到通知服务器时发生错误。

# notificationSystemError
source: A system error occurred in the notification system.
ar: حدث خطأ في النظام في نظام الإشعارات.
de: Ein Systemfehler ist im Benachrichtigungssystem aufgetreten.
es: Ocurrió un error del sistema en el sistema de notificaciones.
fr: Une erreur système s'est produite dans le système de notification.
it: Si è verificato un errore di sistema nel sistema di notifica.
ru: Произошла системная ошибка в системе уведомлений.
tr: Bildirim sisteminde bir hata oluştu.
zh: 通知系统中发生系统错误。

# notificationDefaultOrderStatusUpdate
source: An order status has been updated.
ar: تم تحديث حالة الطلب.
de: Ein Bestellstatus wurde aktualisiert.
es: El estado de un pedido ha sido actualizado.
fr: Un statut de commande a été mis à jour.
it: Lo stato di un ordine è stato aggiornato.
ru: Статус заказа обновлен.
tr: Bir sipariş durumu güncellendi.
zh: 订单状态已更新。

# notificationDefaultWaitingListUpdate
source: The waiting list has been updated.
ar: تم تحديث قائمة الانتظار.
de: Die Warteliste wurde aktualisiert.
es: La lista de espera ha sido actualizada.
fr: La liste d'attente a été mise à jour.
it: La lista d'attesa è stata aggiornata.
ru: Список ожидания обновлен.
tr: Bekleme listesi güncellendi.
zh: 等待列表已更新。

# notificationsNoNotifications
source: No notifications yet.
ar: لا توجد إشعارات بعد.
de: Noch keine Benachrichtigungen.
es: Aún no hay notificaciones.
fr: Aucune notification pour le moment.
it: Ancora nessuna notifica.
ru: Уведомлений пока нет.
tr: Henüz bildirim yok.
zh: 暂无通知。

# addCampaignTitle
source: Create New Campaign
ar: إنشاء حملة جديدة
de: Neue Kampagne erstellen
es: Crear Nueva Campaña
fr: Créer une Nouvelle Campagne
it: Crea Nuova Campagna
ru: Создать новую кампанию
tr: Yeni Kampanya Oluştur
zh: 创建新促销活动

# editCampaignTitle
source: Edit Campaign
ar: تعديل الحملة
de: Kampagne bearbeiten
es: Editar Campaña
fr: Modifier la Campagne
it: Modifica Campagna
ru: Редактировать кампанию
tr: Kampanyayı Düzenle
zh: 编辑促销活动

# campaignNameLabel
source: Campaign Name*
ar: اسم الحملة*
de: Kampagnenname*
es: Nombre de la Campaña*
fr: Nom de la Campagne*
it: Nome Campagna*
ru: Название кампании*
tr: Kampanya Adı*
zh: 促销活动名称*

# validatorRequiredField
source: This field is required.
ar: هذا الحقل مطلوب.
de: Dieses Feld ist erforderlich.
es: Este campo es obligatorio.
fr: Ce champ est requis.
it: Questo campo è obbligatorio.
ru: Это поле обязательно.
tr: Bu alan zorunludur.
zh: 此字段为必填项。

# campaignDescriptionLabel
source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ru: Описание
tr: Açıklama
zh: 描述

# campaignPriceLabel
source: Campaign Price*
ar: سعر الحملة*
de: Kampagnenpreis*
es: Precio de la Campaña*
fr: Prix de la Campagne*
it: Prezzo Campagna*
ru: Цена кампании*
tr: Kampanya Fiyatı*
zh: 促销价格*

# validatorInvalidPositivePrice
source: Please enter a valid positive price
ar: الرجاء إدخال سعر موجب صالح
de: Bitte geben Sie einen gültigen positiven Preis ein
es: Por favor, introduce un precio positivo válido
fr: Veuillez saisir un prix positif valide
it: Per favore, inserisci un prezzo positivo valido
ru: Пожалуйста, введите действительную положительную цену
tr: Geçerli pozitif bir fiyat girin
zh: 请输入有效的正价格

# campaignActiveLabel
source: Active Campaign
ar: حملة نشطة
de: Aktive Kampagne
es: Campaña Activa
fr: Campagne Active
it: Campagna Attiva
ru: Активная кампания
tr: Aktif Kampanya
zh: 活跃促销活动

# campaignNoStartDate
source: No Start Date
ar: لا يوجد تاريخ بدء
de: Kein Startdatum
es: Sin Fecha de Inicio
fr: Pas de Date de Début
it: Nessuna Data di Inizio
ru: Нет даты начала
tr: Başlangıç Tarihi Yok
zh: 无开始日期

# campaignStartDateLabel
source: Start: {date}
ar: البدء: {date}
es: Inicio: {date}
fr: Début : {date}
it: Inizio: {date}
ru: Начало: {date}
tr: Başlangıç: {date}
zh: 开始: {date}

# campaignNoEndDate
source: No End Date
ar: لا يوجد تاريخ انتهاء
de: Kein Enddatum
es: Sin Fecha de Fin
fr: Pas de Date de Fin
it: Nessuna Data di Fine
ru: Нет даты окончания
tr: Bitiş Tarihi Yok
zh: 无结束日期

# campaignEndDateLabel
source: End: {date}
ar: الانتهاء: {date}
de: Ende: {date}
es: Fin: {date}
fr: Fin : {date}
it: Fine: {date}
ru: Конец: {date}
tr: Bitiş: {date}
zh: 结束: {date}

# campaignSelectImageButton
source: Select Campaign Image
ar: تحديد صورة الحملة
de: Kampagnenbild auswählen
es: Seleccionar Imagen de Campaña
fr: Sélectionner l'Image de Campagne
it: Seleziona Immagine Campagna
ru: Выбрать изображение кампании
tr: Kampanya Görseli Seç
zh: 选择促销活动图片

# campaignImageNotSelected
source: Image Not Selected
ar: لم يتم تحديد صورة
de: Bild nicht ausgewählt
es: Imagen No Seleccionada
fr: Image Non Sélectionnée
it: Immagine Non Selezionata
ru: Изображение не выбрано
tr: Görsel Seçilmedi
zh: 未选择图片

# campaignErrorAddItem
source: You must add at least one product to the campaign.
ar: يجب عليك إضافة منتج واحد على الأقل إلى الحملة.
de: Sie müssen mindestens ein Produkt zur Kampagne hinzufügen.
es: Debes añadir al menos un producto a la campaña.
fr: Vous devez ajouter au moins un produit à la campagne.
it: Devi aggiungere almeno un prodotto alla campagna.
ru: Вы должны добавить хотя бы один продукт в кампанию.
tr: Kampanyaya en az bir ürün eklemelisiniz.
zh: 您必须至少为促销活动添加一个产品。

# campaignErrorSubmit
source: An error occurred while saving the campaign: {error}
ar: حدث خطأ أثناء حفظ الحملة: {error}
de: Ein Fehler ist beim Speichern der Kampagne aufgetreten: {error}
es: Ocurrió un error al guardar la campaña: {error}
fr: Une erreur s'est produite lors de l'enregistrement de la campagne : {error}
it: Si è verificato un errore durante il salvataggio della campagna: {error}
ru: Произошла ошибка при сохранении кампании: {error}
tr: Kampanya kaydedilirken bir hata oluştu: {error}
zh: 保存促销活动时发生错误: {error}

# campaignSuccessCreated
source: Campaign created successfully.
ar: تم إنشاء الحملة بنجاح.
de: Kampagne erfolgreich erstellt.
es: Campaña creada con éxito.
fr: Campagne créée avec succès.
it: Campagna creata con successo.
ru: Кампания успешно создана.
tr: Kampanya başarıyla oluşturuldu.
zh: 促销活动创建成功。

# campaignSuccessUpdated
source: Campaign updated successfully.
ar: تم تحديث الحملة بنجاح.
de: Kampagne erfolgreich aktualisiert.
es: Campaña actualizada con éxito.
fr: Campagne mise à jour avec succès.
it: Campagna aggiornata con successo.
ru: Кампания успешно обновлена.
tr: Kampanya başarıyla güncellendi.
zh: 促销活动更新成功。

# campaignCreateButton
source: Create Campaign
ar: إنشاء حملة
de: Kampagne erstellen
es: Crear Campaña
fr: Créer la Campagne
it: Crea Campagna
ru: Создать кампанию
tr: Kampanyayı Oluştur
zh: 创建促销活动

# campaignUpdateButton
source: Update Campaign
ar: تحديث الحملة
de: Kampagne aktualisieren
es: Actualizar Campaña
fr: Mettre à Jour la Campagne
it: Aggiorna Campagna
ru: Обновить кампанию
tr: Kampanyayı Güncelle
zh: 更新促销活动

# newOrderTitle
source: New Order - Table {tableNumber}
ar: طلب جديد - طاولة {tableNumber}
de: Neue Bestellung - Tisch {tableNumber}
es: Nuevo Pedido - Mesa {tableNumber}
fr: Nouvelle Commande - Table {tableNumber}
it: Nuovo Ordine - Tavolo {tableNumber}
ru: Новый заказ - Стол {tableNumber}
tr: Yeni Sipariş - Masa {tableNumber}
zh: 新订单 - 桌位 {tableNumber}

# newOrderLoadingInitialData
source: Initial data could not be loaded.
ar: تعذر تحميل البيانات الأولية.
de: Anfangsdaten konnten nicht geladen werden.
es: No se pudieron cargar los datos iniciales.
fr: Les données initiales n'ont pas pu être chargées.
it: Impossibile caricare i dati iniziali.
ru: Не удалось загрузить исходные данные.
tr: Başlangıç verileri yüklenemedi.
zh: 无法加载初始数据。

# newOrderLoadingData
source: Loading data...
ar: جاري تحميل البيانات...
de: Daten werden geladen...
es: Cargando datos...
fr: Chargement des données...
it: Caricamento dati...
ru: Загрузка данных...
tr: Veriler yükleniyor...
zh: 正在加载数据...

# newOrderWaitingForTableType
source: Awaiting table type...
ar: في انتظار نوع الطاولة...
de: Warten auf Tischtyp...
es: Esperando tipo de mesa...
fr: En attente du type de table...
it: In attesa di tipo tavolo...
ru: Ожидание типа стола...
tr: Masa tipi bekleniyor...
zh: 正在等待桌位类型...

# newOrderTableTypeSingle
source: Single
ar: فردي
de: Einzeln
es: Individual
fr: Unique
it: Singolo
ru: Один
tr: Tekil
zh: 单个

# newOrderTableTypeSplit
source: Split
ar: مقسم
de: Geteilt
es: Dividida
fr: Divisée
it: Diviso
ru: Раздельный
tr: Bölünmüş
zh: 拆分

# newOrderNoOwnersEntered
source: No table owners entered.
ar: لم يتم إدخال مالكي الطاولة.
de: Keine Tischnutzer eingegeben.
es: No se introdujeron propietarios de mesa.
fr: Aucun propriétaire de table saisi.
it: Nessun proprietario del tavolo inserito.
ru: Владельцы стола не введены.
tr: Masa sahipleri girilmedi.
zh: 未输入桌位所有者。

# newOrderOwnersList
source: Owners: {owners}
ar: المالكون: {owners}
de: Nutzer: {owners}
es: Propietarios: {owners}
fr: Propriétaires : {owners}
it: Proprietari: {owners}
ru: Владельцы: {owners}
tr: Sahipler: {owners}
zh: 所有者: {owners}

# newOrderEditOwnersTooltip
source: Edit Table Owners
ar: تعديل مالكي الطاولة
de: Tischnutzer bearbeiten
es: Editar Propietarios de Mesa
fr: Modifier les Propriétaires de Table
it: Modifica Proprietari Tavolo
ru: Редактировать владельцев стола
tr: Masa Sahiplerini Düzenle
zh: 编辑桌位所有者

# newOrderCreateOrderButton
source: Create Order
ar: إنشاء الطلب
de: Bestellung erstellen
es: Crear Pedido
fr: Créer la Commande
it: Crea Ordine
ru: Создать заказ
tr: Siparişi Oluştur
zh: 创建订单

# newOrderErrorAddAtLeastOneProduct
source: Please add at least one product.
ar: الرجاء إضافة منتج واحد على الأقل.
de: Bitte fügen Sie mindestens ein Produkt hinzu.
es: Por favor, añade al menos un producto.
fr: Veuillez ajouter au moins un produit.
it: Per favore, aggiungi almeno un prodotto.
ru: Пожалуйста, добавьте хотя бы один продукт.
tr: Lütfen en az bir ürün ekleyin.
zh: 请至少添加一个产品。

# newOrderErrorMinOwnersForSplit
source: At least 2 table owner names must be entered for a split table.
ar: يجب إدخال اسمي مالكي طاولة على الأقل للطاولة المقسمة.
de: Für einen geteilten Tisch müssen mindestens 2 Tischnutzernamen eingegeben werden.
es: Se deben introducir al menos 2 nombres de propietarios de mesa para una mesa dividida.
fr: Au moins 2 noms de propriétaires de table doivent être saisis pour une table divisée.
it: Devono essere inseriti almeno 2 nomi di proprietari del tavolo per un tavolo diviso.
ru: Для раздельного стола необходимо ввести как минимум 2 имени владельцев стола.
tr: Bölünmüş masa için en az 2 masa sahibi adı girilmelidir.
zh: 对于拆分桌位，必须至少输入2个桌位所有者名称。

# newOrderSuccess
source: Order created successfully.
ar: تم إنشاء الطلب بنجاح.
de: Bestellung erfolgreich erstellt.
es: Pedido creado con éxito.
fr: Commande créée avec succès.
it: Ordine creato con successo.
ru: Заказ успешно создан.
tr: Sipariş başarıyla oluşturuldu.
zh: 订单创建成功。

# newOrderSuccessOffline
source: Order saved offline successfully. It will be sent when a connection is established.
ar: تم حفظ الطلب دون اتصال بالإنترنت بنجاح. سيتم إرساله عند إنشاء اتصال.
de: Bestellung erfolgreich offline gespeichert. Sie wird gesendet, wenn eine Verbindung hergestellt ist.
es: Pedido guardado sin conexión con éxito. Se enviará cuando se establezca una conexión.
fr: Commande enregistrée hors ligne avec succès. Elle sera envoyée lorsqu'une connexion sera établie.
it: Ordine salvato offline con successo. Verrà inviato quando verrà stabilita una connessione.
ru: Заказ успешно сохранен офлайн. Он будет отправлен при установлении соединения.
tr: Sipariş çevrimdışı olarak başarıyla kaydedildi. Bağlantı kurulduğunda gönderilecektir.
zh: 订单离线保存成功。连接建立后将发送。

# newOrderErrorGeneric
source: An error occurred while creating the order ({statusCode}): {details}
ar: حدث خطأ أثناء إنشاء الطلب ({statusCode}): {details}
de: Ein Fehler ist beim Erstellen der Bestellung aufgetreten ({statusCode}): {details}
es: Ocurrió un error al crear el pedido ({statusCode}): {details}
fr: Une erreur s'est produite lors de la création de la commande ({statusCode}) : {details}
it: Si è verificato un errore durante la creazione dell'ordine ({statusCode}): {details}
ru: Произошла ошибка при создании заказа ({statusCode}): {details}
tr: Sipariş oluşturulurken hata oluştu ({statusCode}): {details}
zh: 创建订单时发生错误 ({statusCode}): {details}

# newOrderErrorCatch
source: Order creation error: {error}
ar: خطأ في إنشاء الطلب: {error}
de: Fehler beim Erstellen der Bestellung: {error}
es: Error de creación de pedido: {error}
fr: Erreur de création de commande : {error}
it: Errore creazione ordine: {error}
ru: Ошибка создания заказа: {error}
tr: Sipariş oluşturma hatası: {error}
zh: 订单创建错误: {error}

# dialogTableTypeTitle
source: Table Type Selection
ar: تحديد نوع الطاولة
de: Tischtyp-Auswahl
es: Selección de Tipo de Mesa
fr: Sélection du Type de Table
it: Selezione Tipo Tavolo
ru: Выбор типа стола
tr: Masa Tipi Seçimi
zh: 桌位类型选择

# dialogTableTypeContent
source: Will this table be used by a single person or split among multiple people?
ar: هل سيتم استخدام هذه الطاولة من قبل شخص واحد أم سيتم تقسيمها بين عدة أشخاص؟
de: Wird dieser Tisch von einer einzelnen Person oder von mehreren Personen geteilt genutzt?
es: ¿Esta mesa será utilizada por una sola persona o se dividirá entre varias personas?
fr: Cette table sera-t-elle utilisée par une seule personne ou divisée entre plusieurs personnes ?
it: Questo tavolo sarà utilizzato da una singola persona o diviso tra più persone?
ru: Будет ли этот стол использоваться одним человеком или разделен между несколькими людьми?
tr: Bu masayı tek bir kişi mi yoksa birden fazla kişi arasında bölünmüş olarak mı kullanacaksınız?
zh: 此桌位将由单人使用还是多人拆分使用？

# dialogTableTypeButtonSingle
source: Single Table
ar: طاولة فردية
de: Einzel-Tisch
es: Mesa Individual
fr: Table Unique
it: Tavolo Singolo
ru: Один стол
tr: Tekil Masa
zh: 单人桌

# dialogTableTypeButtonSplit
source: Split Table
ar: طاولة مقسمة
de: Geteilter Tisch
es: Mesa Dividida
fr: Table Divisée
it: Tavolo Diviso
ru: Раздельный стол
tr: Bölünmüş Masa
zh: 拆分桌

# dialogTableOwnersTitle
source: Table Owners
ar: مالكو الطاولة
de: Tischnutzer
es: Propietarios de Mesa
fr: Propriétaires de Table
it: Proprietari Tavolo
ru: Владельцы стола
tr: Masa Sahipleri
zh: 桌位所有者

# dialogTableOwnersHint
source: Owner Name {number}
ar: اسم المالك {number}
de: Nutzername {number}
es: Nombre del Propietario {number}
fr: Nom du Propriétaire {number}
it: Nome Proprietario {number}
ru: Имя владельца {number}
tr: Sahip Adı {number}
zh: 所有者名称 {number}

# dialogTableOwnersAddButton
source: Add Table Owner
ar: إضافة مالك طاولة
de: Tischnutzer hinzufügen
es: Añadir Propietario de Mesa
fr: Ajouter un Propriétaire de Table
it: Aggiungi Proprietario Tavolo
ru: Добавить владельца стола
tr: Masa Sahibi Ekle
zh: 添加桌位所有者

# dialogButtonConfirmAction
source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fr: Confirmer
it: Conferma
ru: Подтвердить
tr: Onayla
zh: 确认

# completedOrdersTitle
source: Completed Orders
ar: الطلبات المكتملة
de: Abgeschlossene Bestellungen
es: Pedidos Completados
fr: Commandes Terminées
it: Ordini Completati
ru: Завершенные заказы
tr: Ödenmiş Siparişler
zh: 已完成订单

# completedOrdersUnknown
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ru: Неизвестно
tr: Bilinmiyor
zh: 未知

# completedOrdersInvalidDate
source: Invalid Date
ar: تاريخ غير صالح
de: Ungültiges Datum
es: Fecha No Válida
fr: Date Invalide
it: Data Non Valida
ru: Недействительная дата
tr: Hatalı Tarih
zh: 无效日期

# completedOrdersErrorLoadMore
source: Failed to load more orders.
ar: فشل في تحميل المزيد من الطلبات.
de: Laden weiterer Bestellungen fehlgeschlagen.
es: Error al cargar más pedidos.
fr: Échec du chargement de plus de commandes.
it: Impossibile caricare altri ordini.
ru: Не удалось загрузить больше заказов.
tr: Daha fazla sipariş yüklenemedi.
zh: 加载更多订单失败。

# completedOrdersNoOrdersFound
source: No completed orders found.
ar: لم يتم العثور على طلبات مكتملة.
de: Keine abgeschlossenen Bestellungen gefunden.
es: No se encontraron pedidos completados.
fr: Aucune commande terminée trouvée.
it: Nessun ordine completato trovato.
ru: Завершенных заказов не найдено.
tr: Ödenmiş sipariş bulunamadı.
zh: 未找到已完成订单。

# paymentTypeCreditCard
source: Credit Card
ar: بطاقة ائتمان
de: Kreditkarte
es: Tarjeta de Crédito
fr: Carte de Crédit
it: Carta di Credito
ru: Кредитная карта
tr: Kredi Kartı
zh: 信用卡

# paymentTypeCash
source: Cash
ar: نقدًا
de: Bargeld
es: Efectivo
fr: Espèces
it: Contanti
ru: Наличные
tr: Nakit
zh: 现金

# paymentTypeFoodCard
source: Food Card
ar: بطاقة طعام
de: Essenskarte
es: Tarjeta de Comida
fr: Carte Repas
it: Buono Pasto
ru: Продуктовая карта
tr: Yemek Kartı
zh: 餐卡

# paymentTypeUnknown
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ru: Неизвестно
tr: Bilinmiyor
zh: 未知

# orderCardTitleTable
source: Table {tableNumber} - Order #{orderId}
ar: طاولة {tableNumber} - طلب #{orderId}
de: Tisch {tableNumber} - Bestellung #{orderId}
es: Mesa {tableNumber} - Pedido #{orderId}
fr: Table {tableNumber} - Commande #{orderId}
it: Tavolo {tableNumber} - Ordine #{orderId}
ru: Стол {tableNumber} - Заказ #{orderId}
tr: Masa {tableNumber} - Sipariş #{orderId}
zh: 桌位 {tableNumber} - 订单 #{orderId}
