Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# notificationEventPagerStatusUpdated
source: Pager Status Updated
ar: تم تحديث حالة جهاز النداء
de: Pager-Status aktualisiert
es: Estado de Localizador Actualizado
fr: Statut du Biper Mis à Jour
it: Stato Pager Aggiornato
ru: Статус пейджера обновлен
tr: Çağrı Cihazı Durumu Güncellendi
zh: 传呼机状态已更新

# orderStatusPendingApproval
source: Pending Approval
ar: في انتظار الموافقة
de: Warten auf Genehmigung
es: Pendiente de Aprobación
fr: En Attente d'Approbation
it: In Attesa di Approvazione
ru: Ожидает одобрения
tr: Onay Bekliyor
zh: 等待批准

# orderStatusApproved
source: Approved
ar: تمت الموافقة
de: Genehmigt
es: Aprobado
fr: Approuvée
it: Approvato
ru: Одобрен
tr: Onaylandı
zh: 已批准

# orderStatusPreparing
source: Preparing
ar: قيد التحضير
de: Wird zubereitet
es: En Preparación
fr: En Préparation
it: In Preparazione
ru: Готовится
tr: Hazırlanıyor
zh: 准备中

# orderStatusReadyForPickup
source: Ready for Pickup
ar: جاهز للاستلام
de: Bereit zur Abholung
es: Listo para Recoger
fr: Prête pour le Ramassage
it: Pronto per il Ritiro
ru: Готов к получению
tr: Mutfakta Hazır
zh: 准备取走

# orderStatusReadyForDelivery
source: Ready for Delivery
ar: جاهز للتسليم
de: Bereit zur Auslieferung
es: Listo para Reparto
fr: Prête pour la Livraison
it: Pronto per la Consegna
ru: Готов к доставке
tr: Teslime Hazır
zh: 准备交付

# orderStatusCompleted
source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminée
it: Completato
ru: Завершен
tr: Tamamlandı
zh: 已完成

# orderStatusPendingSync
source: Pending Synchronization
ar: في انتظار المزامنة
de: Warten auf Synchronisierung
es: Pendiente de Sincronización
fr: En Attente de Synchronisation
it: In Attesa di Sincronizzazione
ru: Ожидает синхронизации
tr: Senkronizasyon Bekliyor
zh: 等待同步

source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto
ru: Неизвестно
tr: Bilinmiyor
zh: 未知

# creditPaymentTitle
source: Credit Record
ar: سجل آجل
de: Kredit-Datensatz
es: Registro a Crédito
fr: Enregistrement de Crédit
it: Registrazione Credito
ru: Кредитная запись
tr: Veresiye Kaydı
zh: 赊账记录

# creditPaymentValidationError
source: Name and phone fields cannot be left blank.
ar: لا يمكن ترك حقلي الاسم والهاتف فارغين.
de: Die Felder Name und Telefon dürfen nicht leer sein.
es: Los campos de nombre y teléfono no pueden dejarse en blanco.
fr: Les champs Nom et Téléphone ne peuvent pas être laissés vides.
it: I campi nome e telefono non possono essere lasciati vuoti.
ru: Поля имени и телефона не могут быть пустыми.
tr: İsim ve telefon alanları boş bırakılamaz.
zh: 姓名和电话字段不能为空。

# creditPaymentSuccess
source: Credit record created successfully!
ar: تم إنشاء سجل آجل بنجاح!
de: Kredit-Datensatz erfolgreich erstellt!
es: ¡Registro a crédito creado con éxito!
fr: Enregistrement de crédit créé avec succès !
it: Registrazione credito creata con successo!
ru: Кредитная запись успешно создана!
tr: Veresiye kaydı başarıyla oluşturuldu!
zh: 赊账记录创建成功！

# creditPaymentErrorWithDetails
source: An error occurred during credit record creation: {statusCode} - {details}
ar: حدث خطأ أثناء إنشاء سجل آجل: {statusCode} - {details}
de: Beim Erstellen des Kredit-Datensatzes ist ein Fehler aufgetreten: {statusCode} - {details}
es: Ocurrió un error durante la creación del registro a crédito: {statusCode} - {details}
fr: Une erreur s'est produite lors de la création de l'enregistrement de crédit : {statusCode} - {details}
it: Si è verificato un errore durante la creazione della registrazione a credito: {statusCode} - {details}
ru: Произошла ошибка при создании кредитной записи: {statusCode} - {details}
tr: Veresiye kaydı sırasında hata oluştu: {statusCode} - {details}
zh: 创建赊账记录时发生错误: {statusCode} - {details}

# creditPaymentCustomerNameLabel
source: Customer Name Surname*
ar: اسم العميل والكنية*
de: Name Nachname des Kunden*
es: Nombre Apellido del Cliente*
fr: Nom Prénom du Client*
it: Nome Cognome Cliente*
ru: Имя Фамилия клиента*
tr: Müşteri Adı Soyadı*
zh: 顾客姓名 姓氏*

# creditPaymentPhoneLabel
source: Phone*
ar: الهاتف*
de: Telefon*
es: Teléfono*
fr: Téléphone*
it: Telefono*
ru: Телефон*
tr: Telefon*
zh: 电话*

# creditPaymentNotesLabel
source: Notes (Optional)
ar: ملاحظات (اختياري)
de: Notizen (Optional)
es: Notas (Opcional)
fr: Notes (Facultatif)
it: Note (Opzionale)
ru: Примечания (Необязательно)
tr: Notlar (Opsiyonel)
zh: 备注 (可选)

# creditPaymentSaveButton
source: Save as Credit
ar: حفظ كـ آجل
de: Als Kredit speichern
es: Guardar como Crédito
fr: Enregistrer comme Crédit
it: Salva come Credito
ru: Сохранить как кредит
tr: Veresiye Kaydet
zh: 保存为赊账

# orderItemQuantity
source: Quantity: {count}
ar: الكمية: {count}
de: Menge: {count}
es: Cantidad: {count}
fr: Quantité : {count}
it: Quantità: {count}
ru: Количество: {count}
tr: Adet: {count}
zh: 数量: {count}

# orderItemExtrasLabel
source: Extras:
ar: الإضافات:
it: Extra:
ru: Дополнительно:
tr: Ekstralar:
zh: 附加项:

# orderItemUnknownExtra
source: Unknown Extra
ar: إضافة غير معروفة
de: Unbekanntes Extra
es: Extra Desconocido
fr: Extra Inconnu
it: Extra Sconosciuto
ru: Неизвестное дополнение
tr: Bilinmeyen Ekstra
zh: 未知附加项

# orderItemTableOwner
source: Table Owner: {owner}
ar: مالك الطاولة: {owner}
de: Tischnutzer: {owner}
es: Propietario de Mesa: {owner}
fr: Propriétaire de Table : {owner}
it: Proprietario Tavolo: {owner}
ru: Владелец стола: {owner}
tr: Masa Sahibi: {owner}
zh: 桌位所有者: {owner}

# orderItemStatusDelivered
source: Delivered
ar: تم التسليم
de: Ausgeliefert
es: Entregado
fr: Livré
it: Consegnato
ru: Доставлено
tr: Teslim Edildi
zh: 已交付

# orderItemTooltipAddExtra
source: Add Extra
ar: إضافة إضافي
de: Extra hinzufügen
es: Añadir Extra
fr: Ajouter un Extra
it: Aggiungi Extra
ru: Добавить дополнительно
tr: Ekstra Ekle
zh: 添加附加项

# orderItemTooltipRemove
source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Retirer
it: Rimuovi
ru: Удалить
tr: Kaldır
zh: 移除

# kdsStatusDisplayNoActionNeeded
source: {kdsName}: No Action Needed
ar: {kdsName}: لا حاجة لإجراء
de: {kdsName}: Keine Aktion erforderlich
es: {kdsName}: No se Requiere Acción
fr: {kdsName} : Aucune Action Requise
it: {kdsName}: Nessuna Azione Necessaria
ru: {kdsName}: Действий не требуется
tr: {kdsName}: İşlem Gerekmiyor
zh: {kdsName}: 无需操作

# kdsStatusDisplaySentToKitchen
source: {kdsName}: Sent to Kitchen
ar: {kdsName}: تم الإرسال إلى المطبخ
de: {kdsName}: An die Küche gesendet
es: {kdsName}: Enviado a Cocina
fr: {kdsName} : Envoyé à la Cuisine
it: {kdsName}: Inviato in Cucina
ru: {kdsName}: Отправлено на кухню
tr: {kdsName}: Mutfağa İletildi
zh: {kdsName}: 已发送至厨房

# kdsStatusDisplayPreparing
source: {kdsName}: {readyCount}/{totalCount} item(s) are being prepared
ar: {kdsName}: {readyCount}/{totalCount} عنصر (عناصر) قيد التحضير
de: {kdsName}: {readyCount}/{totalCount} Artikel werden zubereitet
es: {kdsName}: {readyCount}/{totalCount} artículo(s) en preparación
fr: {kdsName} : {readyCount}/{totalCount} article(s) en cours de préparation
it: {kdsName}: {readyCount}/{totalCount} articolo(i) in preparazione
ru: {kdsName}: {readyCount}/{totalCount} товар(а/ов) готовится
tr: {kdsName}: {readyCount}/{totalCount} ürün hazırlanıyor
zh: {kdsName}: {readyCount}/{totalCount} 个产品正在准备中

# kdsStatusDisplayReadyForPickup
source: {kdsName}: All items are ready, awaiting waiter
ar: {kdsName}: جميع العناصر جاهزة، في انتظار النادل
de: {kdsName}: Alle Artikel sind fertig, warten auf Kellner
es: {kdsName}: Todos los artículos listos, esperando camarero
fr: {kdsName} : Tous les articles sont prêts, en attente du serveur
it: {kdsName}: Tutti gli articoli pronti, in attesa del cameriere
ru: {kdsName}: Все товары готовы, ожидают официанта
tr: {kdsName}: Tüm ürünler hazır, garson bekleniyor
zh: {kdsName}: 所有产品已准备就绪，等待服务员

# kdsStatusDisplayAllPickedUp
source: {kdsName}: All items picked up
ar: {kdsName}: تم استلام جميع العناصر
de: {kdsName}: Alle Artikel abgeholt
es: {kdsName}: Todos los artículos recogidos
fr: {kdsName} : Tous les articles ramassés
it: {kdsName}: Tutti gli articoli ritirati
ru: {kdsName}: Все товары забраны
tr: {kdsName}: Tüm ürünler alındı
zh: {kdsName}: 所有产品已取走

# kdsStatusDisplayDefault
source: {kdsName}: Status Unknown
ar: {kdsName}: الحالة غير معروفة
de: {kdsName}: Status Unbekannt
es: {kdsName}: Estado Desconocido
fr: {kdsName} : Statut Inconnu
it: {kdsName}: Stato Sconosciuto
ru: {kdsName}: Статус неизвестен
tr: {kdsName}: Durum Bilinmiyor
zh: {kdsName}: 状态未知

# waitingCustomerErrorFetchList
source: Could not fetch customer list ({statusCode}) - {details}
ar: تعذر جلب قائمة العملاء ({statusCode}) - {details}
de: Kundenliste konnte nicht abgerufen werden ({statusCode}) - {details}
es: No se pudo obtener la lista de clientes ({statusCode}) - {details}
fr: Impossible de récupérer la liste des clients ({statusCode}) - {details}
it: Impossibile recuperare l'elenco dei clienti ({statusCode}) - {details}
ru: Не удалось получить список клиентов (Код: {statusCode}) - {details}
tr: Müşteri listesi alınamadı ({statusCode}) - {details}
zh: 无法获取顾客列表 ({statusCode}) - {details}

# waitingCustomerErrorFetchListGeneric
source: Error fetching customer list: {error}
ar: خطأ في جلب قائمة العملاء: {error}
de: Fehler beim Abrufen der Kundenliste: {error}
es: Error al obtener la lista de clientes: {error}
fr: Erreur lors de la récupération de la liste des clients : {error}
it: Errore recupero elenco clienti: {error}
ru: Ошибка получения списка клиентов: {error}
tr: Müşteri listesi alınırken hata: {error}
zh: 获取顾客列表错误: {error}

# waitingCustomerErrorNameEmpty
source: Name cannot be empty.
ar: لا يمكن أن يكون الاسم فارغًا.
de: Der Name darf nicht leer sein.
es: El nombre no puede estar vacío.
fr: Le nom ne peut pas être vide.
it: Il nome non può essere vuoto.
ru: Имя не может быть пустым.
tr: İsim boş olamaz.
zh: 姓名不能为空。

# waitingCustomerErrorPartySizePositive
source: Party size must be a positive value.
ar: يجب أن تكون عدد الأفراد قيمة موجبة.
de: Die Personenzahl muss ein positiver Wert sein.
es: El tamaño del grupo debe ser un valor positivo.
fr: La taille du groupe doit être une valeur positive.
it: Il numero di persone deve essere un valore positivo.
ru: Количество человек должно быть положительным числом.
tr: Kişi sayısı pozitif bir değer olmalıdır.
zh: 人数必须是正值。

# waitingCustomerSuccessAdd
source: Customer added successfully.
ar: تمت إضافة العميل بنجاح.
de: Kunde erfolgreich hinzugefügt.
es: Cliente añadido con éxito.
fr: Client ajouté avec succès.
it: Cliente aggiunto con successo.
ru: Клиент успешно добавлен.
tr: Müşteri başarıyla eklendi.
zh: 顾客添加成功。

# waitingCustomerErrorAdd
source: Error adding customer: {statusCode} - {details}
ar: خطأ في إضافة العميل: {statusCode} - {details}
de: Fehler beim Hinzufügen des Kunden: {statusCode} - {details}
es: Error al añadir cliente: {statusCode} - {details}
fr: Erreur lors de l'ajout du client : {statusCode} - {details}
it: Errore aggiunta cliente: {statusCode} - {details}
ru: Ошибка добавления клиента: {statusCode} - {details}
tr: Müşteri eklenirken hata: {statusCode} - {details}
zh: 添加顾客错误: {statusCode} - {details}

# waitingCustomerErrorAddGeneric
source: Error adding customer: {error}
ar: خطأ في إضافة العميل: {error}
de: Fehler beim Hinzufügen des Kunden: {error}
es: Error al añadir cliente: {error}
fr: Erreur lors de l'ajout du client : {error}
it: Errore aggiunta cliente: {error}
ru: Ошибка добавления клиента: {error}
tr: Müşteri ekleme hatası: {error}
zh: 添加顾客错误: {error}

# waitingCustomerSuccessUpdate
source: Customer updated successfully.
ar: تم تحديث العميل بنجاح.
de: Kunde erfolgreich aktualisiert.
es: Cliente actualizado con éxito.
fr: Client mis à jour avec succès.
it: Cliente aggiornato con successo.
ru: Клиент успешно обновлен.
tr: Müşteri başarıyla güncellendi.
zh: 顾客更新成功。

# waitingCustomerErrorUpdate
source: Error updating customer: {statusCode} - {details}
ar: خطأ في تحديث العميل: {statusCode} - {details}
de: Fehler beim Aktualisieren des Kunden: {statusCode} - {details}
es: Error al actualizar cliente: {statusCode} - {details}
fr: Erreur lors de la mise à jour du client : {statusCode} - {details}
it: Errore aggiornamento cliente: {statusCode} - {details}
ru: Ошибка обновления клиента: {statusCode} - {details}
tr: Müşteri güncellenirken hata: {statusCode} - {details}
zh: 更新顾客错误: {statusCode} - {details}

# waitingCustomerErrorUpdateGeneric
source: Error updating customer: {error}
ar: خطأ في تحديث العميل: {error}
de: Fehler beim Aktualisieren des Kunden: {error}
es: Error al actualizar cliente: {error}
fr: Erreur lors de la mise à jour du client : {error}
it: Errore aggiornamento cliente: {error}
ru: Ошибка обновления клиента: {error}
tr: Müşteri güncelleme hatası: {error}
zh: 更新顾客错误: {error}

# waitingCustomerInfoDeleting
source: Deleting customer...
ar: جاري حذف العميل...
de: Kunde wird gelöscht...
es: Eliminando cliente...
fr: Suppression du client...
it: Eliminazione cliente in corso...
ru: Удаление клиента...
tr: Müşteri siliniyor...
zh: 正在删除顾客...

# waitingCustomerSuccessDelete
source: Customer deleted successfully.
ar: تم حذف العميل بنجاح.
de: Kunde erfolgreich gelöscht.
es: Cliente eliminado con éxito.
fr: Client supprimé avec succès.
it: Cliente eliminato con successo.
ru: Клиент успешно удален.
tr: Müşteri başarıyla silindi.
zh: 顾客删除成功。

# waitingCustomerErrorDelete
source: Error deleting customer: {statusCode} - {details}
ar: خطأ في حذف العميل: {statusCode} - {details}
de: Fehler beim Löschen des Kunden: {statusCode} - {details}
es: Error al eliminar cliente: {statusCode} - {details}
fr: Erreur lors de la suppression du client : {statusCode} - {details}
it: Errore eliminazione cliente: {statusCode} - {details}
ru: Ошибка удаления клиента: {statusCode} - {details}
tr: Müşteri silinirken hata: {statusCode} - {details}
zh: 删除顾客错误: {statusCode} - {details}

# waitingCustomerErrorDeleteGeneric
source: Error deleting customer: {error}
ar: خطأ في حذف العميل: {error}
de: Fehler beim Löschen des Kunden: {error}
es: Error al eliminar cliente: {error}
fr: Erreur lors de la suppression du client : {error}
it: Errore eliminazione cliente: {error}
ru: Ошибка удаления клиента: {error}
tr: Müşteri silme hatası: {error}
zh: 删除顾客错误: {error}

# pagerServiceErrorFetch
source: Could not fetch pagers: {statusCode}
ar: تعذر جلب أجهزة النداء: {statusCode}
de: Pager konnten nicht abgerufen werden: {statusCode}
es: No se pudieron obtener los localizadores: {statusCode}
fr: Impossible de récupérer les bipers : {statusCode}
it: Impossibile recuperare i pager: {statusCode}
ru: Не удалось получить пейджеры: {statusCode}
tr: Çağrı cihazları alınamadı: {statusCode}
zh: 无法获取传呼机: {statusCode}

# pagerServiceErrorFetchGeneric
source: Error fetching pagers: {error}
ar: خطأ في جلب أجهزة النداء: {error}
de: Fehler beim Abrufen der Pager: {error}
es: Error al obtener localizadores: {error}
fr: Erreur lors de la récupération des bipers : {error}
it: Errore recupero pager: {error}
ru: Ошибка получения пейджеров: {error}
tr: Çağrı cihazları çekilirken hata: {error}
zh: 获取传呼机错误: {error}

# pagerServiceErrorCreate
source: Could not create pager: {statusCode} - {details}
ar: تعذر إنشاء جهاز النداء: {statusCode} - {details}
de: Pager konnte nicht erstellt werden: {statusCode} - {details}
es: No se pudo crear el localizador: {statusCode} - {details}
fr: Impossible de créer le biper : {statusCode} - {details}
it: Impossibile creare il pager: {statusCode} - {details}
ru: Не удалось создать пейджер: {statusCode} - {details}
tr: Çağrı cihazı oluşturulamadı: {statusCode} - {details}
zh: 无法创建传呼机: {statusCode} - {details}

# pagerServiceErrorCreateGeneric
source: Error creating pager: {error}
ar: خطأ في إنشاء جهاز النداء: {error}
de: Fehler beim Erstellen des Pagers: {error}
es: Error al crear localizador: {error}
fr: Erreur lors de la création du biper : {error}
it: Errore creazione pager: {error}
ru: Ошибка создания пейджера: {error}
tr: Çağrı cihazı oluşturulurken hata: {error}
zh: 创建传呼机错误: {error}

# pagerServiceErrorUpdateNoData
source: No data found to update.
ar: لم يتم العثور على بيانات للتحديث.
de: Keine Daten zum Aktualisieren gefunden.
es: No se encontraron datos para actualizar.
fr: Aucune donnée trouvée à mettre à jour.
it: Nessun dato trovato da aggiornare.
ru: Не найдено данных для обновления.
tr: Güncellenecek veri bulunamadı.
zh: 未找到要更新的数据。

# pagerServiceErrorUpdate
source: Could not update pager: {statusCode} - {details}
ar: تعذر تحديث جهاز النداء: {statusCode} - {details}
de: Pager konnte nicht aktualisiert werden: {statusCode} - {details}
es: No se pudo actualizar el localizador: {statusCode} - {details}
fr: Impossible de mettre à jour le biper : {statusCode} - {details}
it: Impossibile aggiornare il pager: {statusCode} - {details}
ru: Не удалось обновить пейджер: {statusCode} - {details}
tr: Çağrı cihazı güncellenemedi: {statusCode} - {details}
zh: 无法更新传呼机: {statusCode} - {details}

# pagerServiceErrorUpdateGeneric
source: Error updating pager: {error}
ar: خطأ في تحديث جهاز النداء: {error}
de: Fehler beim Aktualisieren des Pagers: {error}
es: Error al actualizar localizador: {error}
fr: Erreur lors de la mise à jour du biper : {error}
it: Errore aggiornamento pager: {error}
ru: Ошибка обновления пейджера: {error}
tr: Çağrı cihazı güncellenirken hata: {error}
zh: 更新传呼机错误: {error}

# pagerServiceErrorDelete
source: Could not delete pager: {statusCode}
ar: تعذر حذف جهاز النداء: {statusCode}
de: Pager konnte nicht gelöscht werden: {statusCode}
es: No se pudo eliminar el localizador: {statusCode}
fr: Impossible de supprimer le biper : {statusCode}
it: Impossibile eliminare il pager: {statusCode}
ru: Не удалось удалить пейджер: {statusCode}
tr: Çağrı cihazı silinemedi: {statusCode}
zh: 无法删除传呼机: {statusCode}

# pagerServiceErrorDeleteGeneric
source: Error deleting pager: {error}
ar: خطأ في حذف جهاز النداء: {error}
de: Fehler beim Löschen des Pagers: {error}
es: Error al eliminar localizador: {error}
fr: Erreur lors de la suppression du biper : {error}
it: Errore eliminazione pager: {error}
ru: Ошибка удаления пейджера: {error}
tr: Çağrı cihazı silinirken hata: {error}
zh: 删除传呼机错误: {error}

# bleStatusNotConnected
source: Not connected
ar: غير متصل
de: Nicht verbunden
es: No conectado
fr: Non connecté
it: Non connesso
ru: Не подключено
tr: Bağlı değil
zh: 未连接

# bleStatusUnsupportedWeb
source: Bluetooth LE is not supported on web platform.
ar: Bluetooth LE غير مدعوم على منصة الويب.
de: Bluetooth LE wird auf der Webplattform nicht unterstützt.
es: Bluetooth LE no es compatible en la plataforma web.
fr: Bluetooth LE n'est pas pris en charge sur la plateforme web.
it: Bluetooth LE non è supportato sulla piattaforma web.
ru: Bluetooth LE не поддерживается на веб-платформе.
tr: Bluetooth LE web platformunda desteklenmiyor.
zh: Web 平台上不支持低功耗蓝牙 (BLE)。

# bleStatusUnsupportedDevice
source: Bluetooth LE is not supported on this device.
ar: Bluetooth LE غير مدعوم على هذا الجهاز.
de: Bluetooth LE wird auf diesem Gerät nicht unterstützt.
es: Bluetooth LE no es compatible en este dispositivo.
fr: Bluetooth LE n'est pas pris en charge sur cet appareil.
it: Bluetooth LE non è supportato su questo dispositivo.
ru: Bluetooth LE не поддерживается на этом устройстве.
tr: Bluetooth LE bu cihazda desteklenmiyor.
zh: 此设备不支持低功耗蓝牙 (BLE)。

# bleStatusOn
source: Bluetooth is on, device is discoverable.
ar: البلوتوث قيد التشغيل، والجهاز قابل للاكتشاف.
de: Bluetooth ist eingeschaltet, Gerät ist erkennbar.
es: Bluetooth está activado, dispositivo visible.
fr: Bluetooth est activé, l'appareil est découvrable.
it: Bluetooth attivo, dispositivo rilevabile.
ru: Bluetooth включен, устройство обнаружено.
tr: Bluetooth açık, cihaz aranabilir.
zh: 蓝牙已开启，设备可被发现。

# bleStatusOff
source: Bluetooth is off.
ar: البلوتوث مغلق.
de: Bluetooth ist ausgeschaltet.
es: Bluetooth está desactivado.
fr: Bluetooth est désactivé.
it: Bluetooth disattivato.
ru: Bluetooth выключен.
tr: Bluetooth kapalı.
zh: 蓝牙已关闭。

# bleStatusPermissionsRequired
source: Bluetooth permissions required.
ar: أذونات البلوتوث مطلوبة.
de: Bluetooth-Berechtigungen erforderlich.
es: Permisos de Bluetooth requeridos.
fr: Autorisations Bluetooth requises.
it: Permessi Bluetooth richiesti.
ru: Требуются разрешения Bluetooth.
tr: Bluetooth izinleri gerekli.
zh: 需要蓝牙权限。

# bleStatusScanning
source: Scanning for pagers...
ar: جاري البحث عن أجهزة النداء...
de: Suche nach Pagern...
es: Escaneando localizadores...
fr: Recherche des bipers...
it: Scansione pager in corso...
ru: Сканирование пейджеров...
tr: Çağrı cihazları aranıyor...
zh: 正在扫描传呼机...

# bleStatusScanError
source: Scan error: {error}
ar: خطأ في المسح: {error}
de: Scan-Fehler: {error}
es: Error de escaneo: {error}
fr: Erreur de scan : {error}
it: Errore di scansione: {error}
ru: Ошибка сканирования: {error}
tr: Tarama hatası: {error}
zh: 扫描错误: {error}

# bleStatusScanStopped
source: Scan stopped.
ar: توقف المسح.
de: Scan gestoppt.
es: Escaneo detenido.
fr: Scan arrêté.
it: Scansione interrotta.
ru: Сканирование остановлено.
tr: Tarama durdu.
zh: 扫描已停止。

# bleStatusDeviceFound
source: {count} devices found.
ar: تم العثور على {count} جهاز.
de: {count} Geräte gefunden.
es: {count} dispositivos encontrados.
fr: {count} appareils trouvés.
it: {count} dispositivi trovati.
ru: Найдено {count} устройств.
tr: {count} cihaz bulundu.
zh: 已找到 {count} 个设备。

# bleStatusDeviceNotFound
source: Device not found.
ar: لم يتم العثور على الجهاز.
de: Gerät nicht gefunden.
es: Dispositivo no encontrado.
fr: Appareil non trouvé.
it: Dispositivo non trovato.
ru: Устройство не найдено.
tr: Cihaz bulunamadı.
zh: 未找到设备。

# bleStatusConnectingTo
source: Connecting to {deviceName}...
ar: جاري الاتصال بـ {deviceName}...
de: Verbindung zu {deviceName} wird hergestellt...
es: Conectando a {deviceName}...
fr: Connexion à {deviceName}...
it: Connessione a {deviceName} in corso...
ru: Подключение к {deviceName}...
tr: {deviceName}'e bağlanılıyor...
zh: 正在连接到 {deviceName}...

# bleStatusConnectedTo
source: Connected to {deviceName}.
ar: متصل بـ {deviceName}.
de: Verbunden mit {deviceName}.
es: Conectado a {deviceName}.
fr: Connecté à {deviceName}.
it: Connesso a {deviceName}.
ru: Подключено к {deviceName}.
tr: {deviceName} bağlandı.
zh: 已连接到 {deviceName}。

# bleStatusCouldNotConnectTo
source: Could not connect to {deviceName}.
ar: تعذر الاتصال بـ {deviceName}.
de: Verbindung zu {deviceName} konnte nicht hergestellt werden.
es: No se pudo conectar a {deviceName}.
fr: Impossible de se connecter à {deviceName}.
it: Impossibile connettersi a {deviceName}.
ru: Не удалось подключиться к {deviceName}.
tr: {deviceName}'e bağlanılamadı.
zh: 无法连接到 {deviceName}。

# bleStatusDisconnectedFrom
source: Disconnected from {deviceName}.
ar: تم قطع الاتصال من {deviceName}.
de: Verbindung zu {deviceName} getrennt.
es: Desconectado de {deviceName}.
fr: Déconnecté de {deviceName}.
it: Disconnesso da {deviceName}.
ru: Отключено от {deviceName}.
tr: {deviceName} bağlantısı kesildi.
zh: 已从 {deviceName} 断开连接。

# bleStatusDisconnectError
source: Error while disconnecting.
ar: خطأ أثناء قطع الاتصال.
de: Fehler beim Trennen der Verbindung.
es: Error al desconectar.
fr: Erreur lors de la déconnexion.
it: Errore durante la disconnessione.
ru: Ошибка при отключении.
tr: Bağlantı kesilirken hata oluştu.
zh: 断开连接时出错。

# bleStatusDiscoveringServices
source: Discovering services and characteristics...
ar: جاري اكتشاف الخدمات والخصائص...
de: Dienste und Eigenschaften werden gesucht...
es: Descubriendo servicios y características...
fr: Découverte des services et caractéristiques...
it: Rilevamento servizi e caratteristiche...
ru: Обнаружение служб и характеристик...
tr: Servisler ve karakteristikler aranıyor...
zh: 正在发现服务和特征...

# bleStatusDiscoveringServicesError
source: Service discovery error.
ar: خطأ في اكتشاف الخدمة.
de: Fehler bei der Dienstsuche.
es: Error de descubrimiento de servicio.
fr: Erreur de découverte de service.
it: Errore rilevamento servizi.
ru: Ошибка обнаружения службы.
tr: Servis keşfi hatası.
zh: 服务发现错误。
