Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# manageKdsSuccessDelete
source: The '{screenName}' KDS screen was successfully deleted.
ar: تم حذف شاشة KDS '{screenName}' بنجاح.
de: Der KDS-Bildschirm '{screenName}' wurde erfolgreich gelöscht.
es: La pantalla KDS '{screenName}' fue eliminada con éxito.
fr: L'écran KDS '{screenName}' a été supprimé avec succès.
it: Lo schermo KDS '{screenName}' è stato eliminato con successo.
ru: Экран KDS «{screenName}» успешно удален.
tr: '{screenName}' KDS ekranı başarıyla silindi.
zh: KDS 屏幕“{screenName}”已成功删除。

# manageKdsErrorDelete
source: Error deleting KDS screen: {error}
ar: خطأ في حذف شاشة KDS: {error}
de: Fehler beim Löschen des KDS-Bildschirms: {error}
es: Error al eliminar pantalla KDS: {error}
fr: Erreur lors de la suppression de l'écran KDS : {error}
it: Errore eliminazione schermo KDS: {error}
ru: Ошибка удаления экрана KDS: {error}
tr: KDS ekranı silinirken hata: {error}
zh: 删除 KDS 屏幕错误: {error}

# manageKdsNoScreensFound
source: No KDS screens have been created yet.
ar: لم يتم إنشاء أي شاشات KDS بعد.
de: Es wurden noch keine KDS-Bildschirme erstellt.
es: Aún no se han creado pantallas KDS.
fr: Aucun écran KDS n'a été créé pour le moment.
it: Nessuno schermo KDS è stato ancora creato.
ru: Экраны KDS еще не созданы.
tr: Henüz KDS ekranı oluşturulmadı.
zh: 尚未创建 KDS 屏幕。

# manageKdsCreateFirstButton
source: Create First KDS Screen
ar: إنشاء أول شاشة KDS
de: Ersten KDS-Bildschirm erstellen
es: Crear Primera Pantalla KDS
fr: Créer le Premier Écran KDS
it: Crea Primo Schermo KDS
ru: Создать первый экран KDS
tr: İlk KDS Ekranını Oluştur
zh: 创建第一个 KDS 屏幕

# manageKdsNoDescription
source: No description
ar: لا يوجد وصف
de: Keine Beschreibung
es: Sin descripción
fr: Aucune description
it: Nessuna descrizione
ru: Нет описания
tr: Açıklama yok
zh: 无描述

# manageKdsListItemSubtitle
source: {description} Slug: {slug} - Active: {isActive}
ar: الوصف: {description} الوصلة الثابتة: {slug} - نشط: {isActive}
de: {description} Slug: {slug} - Aktiv: {isActive}
es: {description} Slug: {slug} - Activa: {isActive}
fr: {description} Slug : {slug} - Actif : {isActive}
it: {description} Slug: {slug} - Attivo: {isActive}
ru: {description} Ярлык: {slug} - Активен: {isActive}
tr: {description} Slug: {slug} - Aktif: {isActive}
zh: {description} Slug: {slug} - 活跃: {isActive}

# passwordResetTitle
source: Forgot Password
ar: نسيت كلمة المرور
de: Passwort vergessen
es: Olvidé la Contraseña
fr: Mot de passe oublié
it: Password Dimenticata
ru: Забыли пароль
tr: Şifremi Unuttum
zh: 忘记密码

# passwordResetSuccessMessage
source: A password reset code has been sent to your email address. Please check your email.
ar: تم إرسال رمز إعادة تعيين كلمة المرور إلى عنوان بريدك الإلكتروني. يرجى التحقق من بريدك الإلكتروني.
de: Ein Passwort-Rücksetzungscode wurde an Ihre E-Mail-Adresse gesendet. Bitte überprüfen Sie Ihre E-Mails.
es: Se ha enviado un código de restablecimiento de contraseña a tu dirección de correo electrónico. Por favor, revisa tu correo.
fr: Un code de réinitialisation de mot de passe a été envoyé à votre adresse e-mail. Veuillez vérifier votre e-mail.
it: Un codice di reset password è stato inviato al tuo indirizzo email. Per favore, controlla la tua email.
ru: Код сброса пароля отправлен на ваш адрес электронной почты. Пожалуйста, проверьте почту.
tr: Şifre sıfırlama kodu e-posta adresinize gönderildi. Lütfen e-postanızı kontrol edin.
zh: 密码重置代码已发送到您的电子邮件地址。请检查您的电子邮件。

# passwordResetInstruction
source: Enter your registered email address. We will send you a password reset code.
ar: أدخل عنوان بريدك الإلكتروني المسجل. سنرسل لك رمزًا لإعادة تعيين كلمة المرور.
de: Geben Sie Ihre registrierte E-Mail-Adresse ein. Wir senden Ihnen einen Passwort-Rücksetzungscode.
es: Introduce tu dirección de correo electrónico registrada. Te enviaremos un código de restablecimiento de contraseña.
fr: Saisissez votre adresse e-mail enregistrée. Nous vous enverrons un code de réinitialisation de mot de passe.
it: Inserisci il tuo indirizzo email registrato. Ti invieremo un codice di reset password.
ru: Введите зарегистрированный адрес электронной почты. Мы отправим вам код сброса пароля.
tr: Kayıtlı e-posta adresinizi girin. Size bir şifre sıfırlama kodu göndereceğiz.
zh: 输入您注册的电子邮件地址。我们将向您发送一个密码重置代码。

# passwordResetSendCodeButton
source: Send Reset Code
ar: إرسال رمز إعادة التعيين
de: Rücksetzungscode senden
es: Enviar Código de Restablecimiento
fr: Envoyer le Code de Réinitialisation
it: Invia Codice di Reset
ru: Отправить код сброса
tr: Sıfırlama Kodu Gönder
zh: 发送重置代码

# passwordResetConfirmTitle
source: Create New Password
ar: إنشاء كلمة مرور جديدة
de: Neues Passwort erstellen
es: Crear Nueva Contraseña
fr: Créer un Nouveau Mot de Passe
it: Crea Nuova Password
ru: Создать новый пароль
tr: Yeni Şifre Oluştur
zh: 创建新密码
