Repository: irocronic/order-ai-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# ingredientNameLabel
source: Ingredient Name
ar: اسم المكون
de: Zutatenname
es: Nombre del Ingrediente
fr: Nom de l'Ingrédient
it: Nome Ingrediente
ru: Название ингредиента
tr: Malzeme Adı
zh: 原料名称

# ingredientInitialStockLabel
source: Initial Stock Quantity
ar: كمية المخزون الأولية
de: Anfängliche Lagermenge
es: Cantidad de Stock Inicial
fr: Quantité de Stock Initiale
it: Quantità Scorta Iniziale
ru: Начальное количество запаса
tr: Başlangıç Stok Miktarı
zh: 初始库存数量

# validatorInvalidNumber
source: Please enter a valid number.
ar: الرجاء إدخال رقم صالح.
de: Bitte geben Sie eine gültige Zahl ein.
es: Por favor, introduce un número válido.
fr: Veuillez saisir un numéro valide.
it: Per favore, inserisci un numero valido.
ru: Пожалуйста, введите действительное число.
tr: Lütfen geçerli bir sayı girin.
zh: 请输入有效的数字。

# addButton
source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить
tr: Ekle
zh: 添加

# ingredientSuccessAdd
source: Ingredient added successfully.
ar: تمت إضافة المكون بنجاح.
de: Zutat erfolgreich hinzugefügt.
es: Ingrediente añadido con éxito.
fr: Ingrédient ajouté avec succès.
it: Ingrediente aggiunto con successo.
ru: Ингредиент успешно добавлен.
tr: Malzeme başarıyla eklendi.
zh: 原料添加成功。

# ingredientNoItems
source: No ingredients have been added yet. Tap the '+' button to get started.
ar: لم تتم إضافة أي مكونات بعد. انقر على زر '+' للبدء.
de: Es wurden noch keine Zutaten hinzugefügt. Tippen Sie auf die Schaltfläche '+' um zu beginnen.
es: Aún no se han añadido ingredientes. Pulsa el botón '+' para empezar.
fr: Aucun ingrédient n'a été ajouté pour le moment. Appuyez sur le bouton '+' pour commencer.
it: Nessun ingrediente è stato ancora aggiunto. Tocca il pulsante '+' per iniziare.
ru: Ингредиенты еще не добавлены. Нажмите кнопку «+», чтобы начать.
tr: Henüz hiç malzeme eklenmemiş. Başlamak için '+' butonuna dokunun.
zh: 尚未添加任何原料。 点击“+”按钮开始添加。

# ingredientStockLabel
source: Stock: {quantity} {unit}
ar: المخزون: {quantity} {unit}
de: Bestand: {quantity} {unit}
it: Scorte: {quantity} {unit}
ru: Запас: {quantity} {unit}
tr: Stok: {quantity} {unit}
zh: 库存: {quantity} {unit}

# errorTitle
source: Error
ar: خطأ
de: Fehler
fr: Erreur
it: Errore
ru: Ошибка
tr: Hata
zh: 错误

# ingredientErrorFetchUnits
source: Could not fetch measurement units: {error}
ar: تعذر جلب وحدات القياس: {error}
de: Maßeinheiten konnten nicht abgerufen werden: {error}
es: No se pudieron obtener las unidades de medida: {error}
fr: Impossible de récupérer les unités de mesure : {error}
it: Impossibile recuperare le unità di misura: {error}
ru: Не удалось получить единицы измерения: {error}
tr: Ölçü birimleri alınamadı: {error}
zh: 无法获取计量单位: {error}

# ingredientUnitLabel
source: Measurement Unit
ar: وحدة القياس
de: Maßeinheit
es: Unidad de Medida
fr: Unité de Mesure
it: Unità di Misura
ru: Единица измерения
tr: Ölçü Birimi
zh: 计量单位

# ingredientErrorSelectUnit
source: Please select a unit.
ar: الرجاء تحديد وحدة.
de: Bitte wählen Sie eine Einheit aus.
es: Por favor, selecciona una unidad.
fr: Veuillez sélectionner une unité.
it: Per favore, seleziona un'unità.
ru: Пожалуйста, выберите единицу измерения.
tr: Lütfen bir birim seçin.
zh: 请选择一个单位。

# recipeFor
source: Recipe for {variantName}
ar: وصفة لـ {variantName}
de: Rezept für {variantName}
es: Receta para {variantName}
fr: Recette pour {variantName}
it: Ricetta per {variantName}
ru: Рецепт для {variantName}
tr: {variantName} için Reçete
zh: {variantName} 的配方

# recipeTitle
source: Recipe
ar: الوصفة
de: Rezept
es: Receta
fr: Recette
it: Ricetta
ru: Рецепт
tr: Reçete
zh: 配方

# ingredientAddToRecipe
source: Add Ingredient to Recipe
ar: إضافة مكون إلى الوصفة
de: Zutat zum Rezept hinzufügen
es: Añadir Ingrediente a la Receta
fr: Ajouter un Ingrédient à la Recette
it: Aggiungi Ingrediente alla Ricetta
ru: Добавить ингредиент в рецепт
tr: Reçeteye Malzeme Ekle
zh: 将原料添加到配方

# ingredientSelect
source: Select Ingredient...
ar: تحديد مكون...
de: Zutat auswählen...
es: Seleccionar Ingrediente...
fr: Sélectionner l'Ingrédient...
it: Seleziona Ingrediente...
ru: Выбрать ингредиент...
tr: Malzeme Seçin...
zh: 选择原料...

source: Quantity
ar: الكمية
de: Menge
es: Cantidad
fr: Quantité
it: Quantità
ru: Количество
tr: Miktar
zh: 数量

# recipeNoIngredients
source: No ingredients have been added for this variant yet.
ar: لم تتم إضافة أي مكونات لهذا المتغير بعد.
de: Für diese Variante wurden noch keine Zutaten hinzugefügt.
es: Aún no se han añadido ingredientes para esta variante.
fr: Aucun ingrédient n'a été ajouté pour cette variante pour le moment.
it: Nessun ingrediente è stato ancora aggiunto per questa variante.
ru: Ингредиенты для этого варианта еще не добавлены.
tr: Bu varyant için henüz malzeme eklenmemiş.
zh: 此变体尚未添加任何原料。

# ingredientAdjustStockTitle
source: Adjust {ingredientName} Stock
ar: تعديل مخزون {ingredientName}
de: Bestand von {ingredientName} anpassen
es: Ajustar Stock de {ingredientName}
fr: Ajuster le Stock de {ingredientName}
it: Regola Scorte {ingredientName}
ru: Корректировка запаса {ingredientName}
tr: {ingredientName} Stoğunu Düzenle
zh: 调整 {ingredientName} 库存

# stockMovementTypeLabel
source: Movement Type
ar: نوع الحركة
de: Bewegungsart
es: Tipo de Movimiento
fr: Type de Mouvement
it: Tipo di Movimento
ru: Тип движения
tr: Hareket Tipi
zh: 变动类型

# descriptionLabel
source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ru: Описание
tr: Açıklama
zh: 描述

# descriptionHintOptional
source: Description (Optional)
ar: الوصف (اختياري)
de: Beschreibung (Optional)
es: Descripción (Opcional)
fr: Description (Facultatif)
it: Descrizione (Opzionale)
ru: Описание (Необязательно)
tr: Açıklama (Opsiyonel)
zh: 描述 (可选)

# validatorInvalidPositiveNumber
source: Please enter a valid number greater than 0.
ar: الرجاء إدخال رقم صالح أكبر من 0.
de: Bitte geben Sie eine gültige Zahl größer als 0 ein.
es: Por favor, introduce un número válido mayor que 0.
fr: Veuillez saisir un nombre valide supérieur à 0.
it: Per favore, inserisci un numero valido maggiore di 0.
ru: Пожалуйста, введите действительное число больше 0.
tr: Lütfen 0'dan büyük geçerli bir sayı girin.
zh: 请输入大于 0 的有效数字。

# ingredientSuccessStockUpdate
source: Stock updated successfully.
ar: تم تحديث المخزون بنجاح.
de: Bestand erfolgreich aktualisiert.
es: Stock actualizado con éxito.
fr: Stock mis à jour avec succès.
it: Scorte aggiornate con successo.
ru: Запас успешно обновлен.
tr: Stok başarıyla güncellendi.
zh: 库存更新成功。

# ingredientMenuTooltip
source: Actions
ar: الإجراءات
de: Aktionen
es: Acciones
it: Azioni
ru: Действия
tr: İşlemler
zh: 操作

# ingredientMenuAdjustStock
source: Adjust Stock
ar: تعديل المخزون
de: Bestand anpassen
es: Ajustar Stock
fr: Ajuster le Stock
it: Regola Scorte
ru: Корректировать запас
tr: Stok Ayarla
zh: 调整库存

# ingredientMenuHistory
source: View History
ar: عرض السجل
de: Verlauf anzeigen
es: Ver Historial
fr: Voir l'Historique
it: Visualizza Storico
ru: Просмотреть историю
tr: Geçmişi Görüntüle
zh: 查看历史记录

# ingredientHistoryTitle
source: {ingredientName} - Stock History
ar: {ingredientName} - سجل المخزون
de: {ingredientName} - Lagerverlauf
es: {ingredientName} - Historial de Stock
fr: {ingredientName} - Historique des Stocks
it: {ingredientName} - Storico Scorte
ru: {ingredientName} - История запасов
tr: {ingredientName} - Stok Geçmişi
zh: {ingredientName} - 库存历史记录

# ingredientHistoryNoMovements
source: No stock movements found for this ingredient.
ar: لم يتم العثور على حركات مخزون لهذا المكون.
de: Keine Lagerbewegungen für diese Zutat gefunden.
es: No se encontraron movimientos de stock para este ingrediente.
fr: Aucun mouvement de stock trouvé pour cet ingrédient.
it: Nessun movimento di scorte trovato per questo ingrediente.
ru: Движений запасов для этого ингредиента не найдено.
tr: Bu malzeme için stok hareketi bulunamadı.
zh: 未找到此原料的库存变动记录。

# ingredientHistoryStockBefore
source: Previous Quantity
ar: الكمية السابقة
de: Vorherige Menge
es: Cantidad Anterior
fr: Quantité Précédente
it: Quantità Precedente
ru: Предыдущее количество
tr: Önceki Miktar
zh: 先前数量

# ingredientHistoryStockAfter
source: New Quantity
ar: الكمية الجديدة
de: Neue Menge
es: Nueva Cantidad
fr: Nouvelle Quantité
it: Nuova Quantità
ru: Новое количество
tr: Sonraki Miktar
zh: 新数量

# systemUser
source: System
ar: النظام
es: Sistema
fr: Système
it: Sistema
ru: Система
tr: Sistem
zh: 系统

# homeMenuManageIngredientsAndRecipes
source: Ingredient and Recipe Management
ar: إدارة المكونات والوصفات
de: Zutaten- und Rezeptverwaltung
es: Gestión de Ingredientes y Recetas
fr: Gestion des Ingrédients et des Recettes
it: Gestione Ingredienti e Ricette
ru: Управление ингредиентами и рецептами
tr: Malzeme ve Reçete Yönetimi
zh: 原料和配方管理

# homeMenuSupplierManagement
source: Supplier Management
ar: إدارة الموردين
de: Lieferantenverwaltung
es: Gestión de Proveedores
fr: Gestion des Fournisseurs
it: Gestione Fornitori
ru: Управление поставщиками
tr: Tedarikçi Yönetimi
zh: 供应商管理

# homeMenuPurchaseOrders
source: Purchase Orders
ar: أوامر الشراء
de: Bestellungen
es: Órdenes de Compra
fr: Commandes d'Achat
it: Ordini di Acquisto
ru: Заказы на покупку
tr: Alım Siparişleri
zh: 采购订单

# supplierDeleteTitle
source: Delete Supplier
ar: حذف المورد
de: Lieferanten löschen
es: Eliminar Proveedor
fr: Supprimer le Fournisseur
it: Elimina Fornitore
ru: Удалить поставщика
tr: Tedarikçiyi Sil
zh: 删除供应商

# supplierDeleteConfirmation
source: Are you sure you want to delete the supplier named {supplierName}? This action is irreversible.
ar: هل أنت متأكد أنك تريد حذف المورد المسمى {supplierName}؟ هذا الإجراء لا رجعة فيه.
de: Sind Sie sicher, dass Sie den Lieferanten {supplierName} löschen möchten? Diese Aktion ist irreversibel.
es: ¿Estás seguro de que quieres eliminar al proveedor llamado {supplierName}? Esta acción es irreversible.
fr: Êtes-vous sûr de vouloir supprimer le fournisseur nommé {supplierName} ? Cette action est irréversible.
it: Sei sicuro di voler eliminare il fornitore chiamato {supplierName}? Questa azione è irreversibile.
ru: Вы уверены, что хотите удалить поставщика с именем {supplierName}? Это действие необратимо.
tr: {supplierName} adlı tedarikçiyi silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除供应商“{supplierName}”吗？此操作不可逆。

# supplierDeleteSuccess
source: The supplier named {supplierName} was successfully deleted.
ar: تم حذف المورد المسمى {supplierName} بنجاح.
de: Der Lieferant {supplierName} wurde erfolgreich gelöscht.
es: El proveedor llamado {supplierName} fue eliminado con éxito.
fr: Le fournisseur nommé {supplierName} a été supprimé avec succès.
it: Il fornitore chiamato {supplierName} è stato eliminato con successo.
ru: Поставщик с именем {supplierName} был успешно удален.
tr: {supplierName} adlı tedarikçi başarıyla silindi.
zh: 供应商“{supplierName}”已成功删除。

# supplierManagementTitle
source: Supplier Management
ar: إدارة الموردين
de: Lieferantenverwaltung
es: Gestión de Proveedores
fr: Gestion des Fournisseurs
it: Gestione Fornitori
ru: Управление поставщиками
tr: Tedarikçi Yönetimi
zh: 供应商管理

# supplierNoItems
source: No suppliers have been added yet.
ar: لم تتم إضافة أي موردين بعد.
de: Es wurden noch keine Lieferanten hinzugefügt.
es: Aún no se han añadido proveedores.
fr: Aucun fournisseur n'a été ajouté pour le moment.
it: Nessun fornitore è stato ancora aggiunto.
ru: Поставщики еще не добавлены.
tr: Henüz tedarikçi eklenmemiş.
zh: 尚未添加任何供应商。

# supplierNoContactPerson
source: No contact person specified
ar: لم يتم تحديد شخص اتصال
de: Keine Kontaktperson angegeben
es: No se especificó persona de contacto
fr: Aucune personne de contact spécifiée
it: Nessuna persona di contatto specificata
ru: Контактное лицо не указано
tr: Yetkili belirtilmemiş
zh: 未指定联系人

# purchaseOrderListTitle
source: Purchase Orders
ar: أوامر الشراء
de: Bestellungen
es: Órdenes de Compra
fr: Commandes d'Achat
it: Ordini di Acquisto
ru: Заказы на покупку
tr: Alım Siparişleri
zh: 采购订单

# purchaseOrderNoItems
source: No purchase orders have been created yet.
ar: لم يتم إنشاء أي أوامر شراء بعد.
de: Es wurden noch keine Bestellungen erstellt.
es: Aún no se han creado órdenes de compra.
fr: Aucune commande d'achat n'a été créée pour le moment.
it: Nessun ordine di acquisto è stato ancora creato.
ru: Заказы на покупку еще не созданы.
tr: Henüz alım siparişi oluşturulmamış.
zh: 尚未创建任何采购订单。

# purchaseOrderLabel
source: Order No
ar: رقم الطلب
de: Bestell-Nr
es: Nº de Pedido
fr: N° de Commande
it: N. Ordine
ru: № заказа
tr: Alım No
zh: 订单号

# purchaseOrderStatusLabel
source: Status
ar: الحالة
es: Estado
fr: Statut
it: Stato
ru: Статус
tr: Durum
zh: 状态

# purchaseOrderDateLabel
source: Date
ar: التاريخ
de: Datum
es: Fecha
it: Data
ru: Дата
tr: Tarih
zh: 日期

# purchaseOrderAddButton
source: New Purchase Order
ar: أمر شراء جديد
de: Neue Bestellung
es: Nueva Orden de Compra
fr: Nouvelle Commande d'Achat
it: Nuovo Ordine di Acquisto
ru: Новый заказ на покупку
tr: Yeni Alım Siparişi
zh: 新采购订单

# ingredientAddToOrder
source: Add Ingredient to Order
ar: إضافة مكون إلى الطلب
de: Zutat zur Bestellung hinzufügen
es: Añadir Ingrediente a la Orden
fr: Ajouter un Ingrédient à la Commande
it: Aggiungi Ingrediente all'Ordine
ru: Добавить ингредиент в заказ
tr: Siparişe Malzeme Ekle
zh: 将原料添加到订单

# purchaseOrderUnitPrice
source: Unit Purchase Price
ar: سعر شراء الوحدة
de: Einkaufspreis pro Einheit
es: Precio Unitario de Compra
fr: Prix d'Achat Unitaire
it: Prezzo di Acquisto Unitario
ru: Цена за единицу покупки
tr: Birim Alış Fiyatı
zh: 单位采购价格

# purchaseOrderValidationError
source: Please select a supplier and add at least one item.
ar: الرجاء تحديد مورد وإضافة عنصر واحد على الأقل.
de: Bitte wählen Sie einen Lieferanten aus und fügen Sie mindestens einen Artikel hinzu.
es: Por favor, selecciona un proveedor y añade al menos un artículo.
fr: Veuillez sélectionner un fournisseur et ajouter au moins un article.
it: Per favore, seleziona un fornitore e aggiungi almeno un articolo.
ru: Пожалуйста, выберите поставщика и добавьте хотя бы один товар.
tr: Lütfen bir tedarikçi seçin ve en az bir ürün ekleyin.
zh: 请选择一个供应商并至少添加一个产品。

# purchaseOrderCreateTitle
source: Create New Purchase Order
ar: إنشاء أمر شراء جديد
de: Neue Bestellung erstellen
es: Crear Nueva Orden de Compra
fr: Créer une Nouvelle Commande d'Achat
it: Crea Nuovo Ordine di Acquisto
ru: Создать новый заказ на покупку
tr: Yeni Alım Siparişi Oluştur
zh: 创建新采购订单

# purchaseOrderSelectSupplier
source: Select Supplier
ar: تحديد المورد
de: Lieferant auswählen
es: Seleccionar Proveedor
fr: Sélectionner le Fournisseur
it: Seleziona Fornitore
ru: Выбрать поставщика
tr: Tedarikçi Seçin
zh: 选择供应商

# purchaseOrderTotalCost
source: Total Cost
ar: التكلفة الإجمالية
de: Gesamtkosten
es: Costo Total
fr: Coût Total
it: Costo Totale
ru: Общая стоимость
tr: Toplam Maliyet
zh: 总成本

# purchaseOrderAddItemButton
source: Add Ingredient
ar: إضافة مكون
de: Zutat hinzufügen
es: Añadir Ingrediente
fr: Ajouter un Ingrédient
it: Aggiungi Ingrediente
ru: Добавить ингредиент
tr: Malzeme Ekle
zh: 添加原料

# purchaseOrderSaveButton
source: Save Purchase Order
ar: حفظ أمر الشراء
de: Bestellung speichern
es: Guardar Orden de Compra
fr: Enregistrer la Commande d'Achat
it: Salva Ordine di Acquisto
ru: Сохранить заказ на покупку
tr: Alım Siparişini Kaydet
zh: 保存采购订单

# supplierAddButton
source: Add Supplier
ar: إضافة مورد
de: Lieferant hinzufügen
es: Añadir Proveedor
fr: Ajouter un Fournisseur
it: Aggiungi Fornitore
ru: Добавить поставщика
tr: Tedarikçi Ekle
zh: 添加供应商

# supplierAddDialogTitle
source: Add New Supplier
ar: إضافة مورد جديد
de: Neuen Lieferanten hinzufügen
es: Añadir Nuevo Proveedor
fr: Ajouter un Nouveau Fournisseur
it: Aggiungi Nuovo Fornitore
ru: Добавить нового поставщика
tr: Yeni Tedarikçi Ekle
zh: 添加新供应商

# supplierEditDialogTitle
source: Edit {supplierName}
ar: تعديل {supplierName}
de: {supplierName} bearbeiten
es: Editar {supplierName}
fr: Modifier {supplierName}
it: Modifica {supplierName}
ru: Редактировать {supplierName}
tr: {supplierName} Düzenle
zh: 编辑 {supplierName}

# supplierNameLabel
source: Supplier Name
ar: اسم المورد
de: Lieferantenname
es: Nombre del Proveedor
fr: Nom du Fournisseur
it: Nome Fornitore
ru: Название поставщика
tr: Tedarikçi Adı
zh: 供应商名称

# supplierContactPersonLabel
source: Contact Person
ar: شخص الاتصال
de: Kontaktperson
es: Persona de Contacto
fr: Personne de Contact
it: Persona di Contatto
ru: Контактное лицо
tr: Yetkili Kişi
zh: 联系人

# phoneLabel
source: Phone
ar: الهاتف
de: Telefon
es: Teléfono
fr: Téléphone
it: Telefono
ru: Телефон
tr: Telefon
zh: 电话

# addressLabel
source: Address
ar: العنوان
de: Adresse
es: Dirección
fr: Adresse
it: Indirizzo
ru: Адрес
tr: Adres
zh: 地址

# dialogButtonCancelOrder
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# purchaseOrderCancelDialogTitle
source: Cancel Order
ar: إلغاء الطلب
de: Bestellung stornieren
es: Cancelar Pedido
fr: Annuler la Commande
it: Annulla Ordine
ru: Отменить заказ
tr: Siparişi İptal Et
zh: 取消订单

# purchaseOrderCancelDialogContent
source: Are you sure you want to cancel purchase order #{orderId}?
ar: هل أنت متأكد أنك تريد إلغاء أمر الشراء رقم #{orderId}؟
de: Sind Sie sicher, dass Sie die Bestellung Nr. #{orderId} stornieren möchten?
es: ¿Estás seguro de que quieres cancelar la orden de compra #{orderId}?
fr: Êtes-vous sûr de vouloir annuler la commande d'achat #{orderId} ?
it: Sei sicuro di voler annullare l'ordine di acquisto #{orderId}?
ru: Вы уверены, что хотите отменить заказ на покупку #{orderId}?
tr: #{orderId} numaralı alım siparişini iptal etmek istediğinizden emin misiniz?
zh: 您确定要取消采购订单 #{orderId} 吗？

# purchaseOrderSuccessCancel
source: Purchase order #{orderId} was successfully canceled.
ar: تم إلغاء أمر الشراء رقم #{orderId} بنجاح.
de: Bestellung Nr. #{orderId} wurde erfolgreich storniert.
es: La orden de compra #{orderId} fue cancelada con éxito.
fr: La commande d'achat #{orderId} a été annulée avec succès.
it: Ordine di acquisto #{orderId} annullato con successo.
ru: Заказ на покупку #{orderId} был успешно отменен.
tr: #{orderId} numaralı alım siparişi başarıyla iptal edildi.
zh: 采购订单 #{orderId} 已成功取消。

# ingredientNotificationSent
source: Notified to supplier
ar: تم الإخطار للمورد
de: Lieferant benachrichtigt
es: Notificado al proveedor
fr: Notifié au fournisseur
it: Notificato al fornitore
ru: Уведомлено поставщику
tr: Tedarikçiye bildirildi
zh: 已通知供应商

# sendButton
source: Send
ar: إرسال
de: Senden
es: Enviar
fr: Envoyer
it: Invia
ru: Отправить
tr: Gönder
zh: 发送

# ingredientSelectItems
source: Select Ingredients
ar: تحديد المكونات
de: Zutaten auswählen
es: Seleccionar Ingredientes
fr: Sélectionner les Ingrédients
it: Seleziona Ingredienti
ru: Выбрать ингредиенты
tr: Malzeme Seç
zh: 选择原料

# ingredientSendEmailToSupplier
source: Notify Supplier
ar: إخطار المورد
de: Lieferanten benachrichtigen
es: Notificar Proveedor
fr: Notifier le Fournisseur
it: Notifica Fornitore
ru: Уведомить поставщика
tr: Tedarikçiye Bildir
zh: 通知供应商

# ingredientSelectSupplierTitle
source: Select Supplier
ar: تحديد المورد
de: Lieferant auswählen
es: Seleccionar Proveedor
fr: Sélectionner le Fournisseur
it: Seleziona Fornitore
ru: Выбрать поставщика
tr: Tedarikçi Seç
zh: 选择供应商

# ingredientSelectSupplierContent
source: Select the supplier to whom the notification will be sent for the selected ingredients.
ar: حدد المورد الذي سيتم إرسال الإشعار إليه للمكونات المحددة.
de: Wählen Sie den Lieferanten aus, an den die Benachrichtigung für die ausgewählten Zutaten gesendet werden soll.
es: Selecciona el proveedor al que se enviará la notificación para los ingredientes seleccionados.
fr: Sélectionnez le fournisseur à qui la notification sera envoyée pour les ingrédients sélectionnés.
it: Seleziona il fornitore a cui verrà inviata la notifica per gli ingredienti selezionati.
ru: Выберите поставщика, которому будет отправлено уведомление о выбранных ингредиентах.
tr: Seçili malzemeler için bildirim gönderilecek tedarikçiyi seçin.
zh: 选择将发送所选原料通知的供应商。

# ingredientSelectSupplierHint
source: Select a supplier...
ar: تحديد مورد...
de: Einen Lieferanten auswählen...
es: Selecciona un proveedor...
fr: Sélectionner un fournisseur...
it: Seleziona un fornitore...
ru: Выбрать поставщика...
tr: Bir tedarikçi seçin...
zh: 选择一个供应商...

# ingredientErrorNoSuppliers
source: No registered suppliers found in the system.
ar: لم يتم العثور على موردين مسجلين في النظام.
de: Es wurden keine registrierten Lieferanten im System gefunden.
es: No se encontraron proveedores registrados en el sistema.
fr: Aucun fournisseur enregistré trouvé dans le système.
it: Nessun fornitore registrato trovato nel sistema.
ru: Не найдено зарегистрированных поставщиков в системе.
tr: Sistemde kayıtlı tedarikçi bulunamadı.
zh: 系统中未找到已注册的供应商。

# ingredientSuccessEmailSent
source: Ingredient request successfully sent to the supplier.
ar: تم إرسال طلب المكونات بنجاح إلى المورد.
de: Zutatenanfrage erfolgreich an den Lieferanten gesendet.
es: Solicitud de ingredientes enviada con éxito al proveedor.
fr: Demande d'ingrédients envoyée avec succès au fournisseur.
it: Richiesta ingredienti inviata con successo al fornitore.
ru: Запрос ингредиентов успешно отправлен поставщику.
tr: Malzeme talebi başarıyla tedarikçiye gönderildi.
zh: 原料请求已成功发送给供应商。

# ingredientErrorEmailSending
source: An error occurred while sending the email: {error}
ar: حدث خطأ أثناء إرسال البريد الإلكتروني: {error}
de: Beim Senden der E-Mail ist ein Fehler aufgetreten: {error}
es: Ocurrió un error al enviar el correo electrónico: {error}
fr: Une erreur s'est produite lors de l'envoi de l'e-mail : {error}
it: Si è verificato un errore durante l'invio dell'email: {error}
ru: Произошла ошибка при отправке электронного письма: {error}
tr: E-posta gönderilirken bir hata oluştu: {error}
zh: 发送电子邮件时发生错误: {error}

# ingredientErrorNoItemsSelected
source: Please select at least one ingredient.
ar: الرجاء تحديد مكون واحد على الأقل.
de: Bitte wählen Sie mindestens eine Zutat aus.
es: Por favor, selecciona al menos un ingrediente.
fr: Veuillez sélectionner au moins un ingrédient.
it: Per favore, seleziona almeno un ingrediente.
ru: Пожалуйста, выберите хотя бы один ингредиент.
tr: Lütfen en az bir malzeme seçin.
zh: 请至少选择一个原料。

# inventoryManagementTitle
source: Inventory Management
ar: إدارة المخزون
de: Bestandsverwaltung
es: Gestión de Inventario
fr: Gestion des Stocks
it: Gestione Inventario
ru: Управление инвентарем
tr: Envanter Yönetimi
zh: 库存管理

# menuItemIsFromRecipeLabel
source: Is this item prepared from a recipe?
ar: هل يتم إعداد هذا العنصر من وصفة؟
de: Wird dieser Artikel aus einem Rezept zubereitet?
es: ¿Este artículo se prepara a partir de una receta?
fr: Cet article est-il préparé à partir d'une recette ?
it: Questo articolo è preparato da una ricetta?
ru: Этот товар готовится по рецепту?
tr: Bu ürün reçete ile mi hazırlanıyor?
zh: 此产品是否根据配方制作？

# menuItemIsFromRecipeSubtitleYes
source: Yes, it will be produced from ingredients in the inventory.
ar: نعم، سيتم إنتاجه من المكونات الموجودة في المخزون.
de: Ja, er wird aus Zutaten im Bestand hergestellt.
es: Sí, se producirá a partir de ingredientes en el inventario.
fr: Oui, il sera produit à partir d'ingrédients dans l'inventaire.
it: Sì, sarà prodotto da ingredienti nell'inventario.
ru: Да, он будет произведен из ингредиентов в инвентаре.
tr: Evet, envanterdeki malzemelerden üretilecek.
zh: 是，它将由库存中的原料生产。
